; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--libcrypto-lib-o_time.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--libcrypto-lib-o_time.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

; Function Attrs: nounwind uwtable
define %struct.tm* @OPENSSL_gmtime(i64* %timer, %struct.tm* %result) #0 !dbg !9 {
entry:
  %retval = alloca %struct.tm*, align 8
  %timer.addr = alloca i64*, align 8
  %result.addr = alloca %struct.tm*, align 8
  %ts = alloca %struct.tm*, align 8
  store i64* %timer, i64** %timer.addr, align 8
  call void @llvm.dbg.declare(metadata i64** %timer.addr, metadata !37, metadata !38), !dbg !39
  store %struct.tm* %result, %struct.tm** %result.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.tm** %result.addr, metadata !40, metadata !38), !dbg !41
  call void @llvm.dbg.declare(metadata %struct.tm** %ts, metadata !42, metadata !38), !dbg !43
  store %struct.tm* null, %struct.tm** %ts, align 8, !dbg !43
  %0 = load i64*, i64** %timer.addr, align 8, !dbg !44
  %1 = load %struct.tm*, %struct.tm** %result.addr, align 8, !dbg !46
  %call = call %struct.tm* @gmtime_r(i64* %0, %struct.tm* %1) #3, !dbg !47
  %cmp = icmp eq %struct.tm* %call, null, !dbg !48
  br i1 %cmp, label %if.then, label %if.end, !dbg !49


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--libcrypto-lib-o_time.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!9 = distinct !DISubprogram(name: "OPENSSL_gmtime", scope: !10, file: !10, line: 14, type: !11, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!10 = !DIFile(filename: "crypto/o_time.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !32, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !15, line: 133, size: 448, align: 64, elements: !16)
!15 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !28}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !14, file: !15, line: 135, baseType: !5, size: 32, align: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !14, file: !15, line: 136, baseType: !5, size: 32, align: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !14, file: !15, line: 137, baseType: !5, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !14, file: !15, line: 138, baseType: !5, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !14, file: !15, line: 139, baseType: !5, size: 32, align: 32, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !14, file: !15, line: 140, baseType: !5, size: 32, align: 32, offset: 160)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !14, file: !15, line: 141, baseType: !5, size: 32, align: 32, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !14, file: !15, line: 142, baseType: !5, size: 32, align: 32, offset: 224)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !14, file: !15, line: 143, baseType: !5, size: 32, align: 32, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !14, file: !15, line: 146, baseType: !27, size: 64, align: 64, offset: 320)
!27 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !14, file: !15, line: 147, baseType: !29, size: 64, align: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !15, line: 75, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !36, line: 139, baseType: !27)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!37 = !DILocalVariable(name: "timer", arg: 1, scope: !9, file: !10, line: 14, type: !32)
!38 = !DIExpression()
!39 = !DILocation(line: 14, column: 41, scope: !9)
!40 = !DILocalVariable(name: "result", arg: 2, scope: !9, file: !10, line: 14, type: !13)
!41 = !DILocation(line: 14, column: 59, scope: !9)
!42 = !DILocalVariable(name: "ts", scope: !9, file: !10, line: 16, type: !13)
!43 = !DILocation(line: 16, column: 16, scope: !9)
!44 = !DILocation(line: 41, column: 18, scope: !45)
!45 = distinct !DILexicalBlock(scope: !9, file: !10, line: 41, column: 9)
!46 = !DILocation(line: 41, column: 25, scope: !45)
!47 = !DILocation(line: 41, column: 9, scope: !45)
!48 = !DILocation(line: 41, column: 33, scope: !45)
!49 = !DILocation(line: 41, column: 9, scope: !9)
!50 = !DILocation(line: 42, column: 9, scope: !45)
!51 = !DILocation(line: 43, column: 10, scope: !9)
!52 = !DILocation(line: 43, column: 8, scope: !9)
!53 = !DILocation(line: 56, column: 12, scope: !9)
!54 = !DILocation(line: 56, column: 5, scope: !9)
!55 = !DILocation(line: 57, column: 1, scope: !9)
!56 = distinct !DISubprogram(name: "OPENSSL_gmtime_adj", scope: !10, file: !10, line: 72, type: !57, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!57 = !DISubroutineType(types: !58)
!58 = !{!5, !13, !5, !27}
!59 = !DILocalVariable(name: "tm", arg: 1, scope: !56, file: !10, line: 72, type: !13)
!60 = !DILocation(line: 72, column: 35, scope: !56)
!61 = !DILocalVariable(name: "off_day", arg: 2, scope: !56, file: !10, line: 72, type: !5)
!62 = !DILocation(line: 72, column: 43, scope: !56)
!63 = !DILocalVariable(name: "offset_sec", arg: 3, scope: !56, file: !10, line: 72, type: !27)
!64 = !DILocation(line: 72, column: 57, scope: !56)
!65 = !DILocalVariable(name: "time_sec", scope: !56, file: !10, line: 74, type: !5)
!66 = !DILocation(line: 74, column: 9, scope: !56)
!67 = !DILocalVariable(name: "time_year", scope: !56, file: !10, line: 74, type: !5)
!68 = !DILocation(line: 74, column: 19, scope: !56)
!69 = !DILocalVariable(name: "time_month", scope: !56, file: !10, line: 74, type: !5)
!70 = !DILocation(line: 74, column: 30, scope: !56)
!71 = !DILocalVariable(name: "time_day", scope: !56, file: !10, line: 74, type: !5)
!72 = !DILocation(line: 74, column: 42, scope: !56)
!73 = !DILocalVariable(name: "time_jd", scope: !56, file: !10, line: 75, type: !27)
!74 = !DILocation(line: 75, column: 10, scope: !56)
!75 = !DILocation(line: 78, column: 21, scope: !76)
!76 = distinct !DILexicalBlock(scope: !56, file: !10, line: 78, column: 9)
!77 = !DILocation(line: 78, column: 25, scope: !76)
!78 = !DILocation(line: 78, column: 34, scope: !76)
!79 = !DILocation(line: 78, column: 10, scope: !76)
!80 = !DILocation(line: 78, column: 9, scope: !56)
!81 = !DILocation(line: 79, column: 9, scope: !76)
!82 = !DILocation(line: 83, column: 20, scope: !56)
!83 = !DILocation(line: 83, column: 5, scope: !56)
!84 = !DILocation(line: 85, column: 9, scope: !85)
!85 = distinct !DILexicalBlock(scope: !56, file: !10, line: 85, column: 9)
!86 = !DILocation(line: 85, column: 19, scope: !85)
