; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_tlsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_tlsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !49)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_tlsf.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !9, !12, !17, !30, !31, !32, !42, !43, !45}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "TLS_FEATURE", file: !6, line: 164, baseType: !7)
!6 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_INTEGER", file: !8, line: 438, flags: DIFlagFwdDecl)
!8 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !8, line: 213, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !8, line: 213, flags: DIFlagFwdDecl)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !15, line: 17, baseType: !16)
!15 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !15, line: 17, flags: DIFlagFwdDecl)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !19, line: 40, baseType: !20)
!19 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !8, line: 146, size: 192, align: 64, elements: !21)
!21 = !{!22, !24, !25, !28}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !20, file: !8, line: 147, baseType: !23, size: 32, align: 32)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !8, line: 148, baseType: !23, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !20, file: !8, line: 149, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !20, file: !8, line: 155, baseType: !29, size: 64, align: 64, offset: 128)
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !34, line: 28, baseType: !35)
!34 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 24, size: 192, align: 64, elements: !36)
!36 = !{!37, !40, !41}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !35, file: !34, line: 25, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !35, file: !34, line: 26, baseType: !38, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !35, file: !34, line: 27, baseType: !38, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !15, line: 20, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !30}
!49 = !{!50, !182, !183, !184}
!50 = distinct !DIGlobalVariable(name: "v3_tls_feature", scope: !0, file: !51, line: 32, type: !52, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_tls_feature)
!51 = !DIFile(filename: "crypto/x509v3/v3_tlsf.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !6, line: 92, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !6, line: 49, size: 832, align: 64, elements: !55)
!55 = !{!56, !57, !58, !86, !91, !93, !101, !107, !114, !161, !166, !171, !179, !181}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !54, file: !6, line: 50, baseType: !23, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !54, file: !6, line: 51, baseType: !23, size: 32, align: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !54, file: !6, line: 53, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !8, line: 318, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !19, line: 62, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !64, line: 580, size: 448, align: 64, elements: !65)
!64 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!65 = !{!66, !67, !68, !82, !83, !84, !85}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !63, file: !64, line: 581, baseType: !39, size: 8, align: 8)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !63, file: !64, line: 583, baseType: !29, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !63, file: !64, line: 584, baseType: !69, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !8, line: 210, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !64, line: 468, size: 320, align: 64, elements: !73)
!73 = !{!74, !76, !77, !78, !81}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !72, file: !64, line: 469, baseType: !75, size: 64, align: 64)
!75 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !72, file: !64, line: 470, baseType: !29, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !72, file: !64, line: 471, baseType: !75, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !72, file: !64, line: 472, baseType: !79, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !72, file: !64, line: 473, baseType: !59, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !63, file: !64, line: 586, baseType: !29, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !63, file: !64, line: 587, baseType: !43, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !63, file: !64, line: 588, baseType: !29, size: 64, align: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !63, file: !64, line: 589, baseType: !79, size: 64, align: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !54, file: !6, line: 55, baseType: !87, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !6, line: 28, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!30}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !54, file: !6, line: 56, baseType: !92, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !6, line: 29, baseType: !46)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !54, file: !6, line: 57, baseType: !94, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !6, line: 30, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!30, !30, !98, !29}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !54, file: !6, line: 58, baseType: !102, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !6, line: 31, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!23, !30, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !54, file: !6, line: 60, baseType: !108, size: 64, align: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !6, line: 38, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!38, !112, !30}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !54, file: !6, line: 61, baseType: !115, size: 64, align: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !6, line: 40, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!30, !112, !119, !79}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !6, line: 79, size: 448, align: 64, elements: !121)
!121 = !{!122, !123, !127, !128, !133, !137, !160}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !6, line: 82, baseType: !23, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !120, file: !6, line: 83, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !19, line: 124, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !19, line: 124, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !120, file: !6, line: 84, baseType: !124, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !120, file: !6, line: 85, baseType: !129, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !131, line: 93, baseType: !132)
!131 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !131, line: 93, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !120, file: !6, line: 86, baseType: !134, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !19, line: 126, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !19, line: 126, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !120, file: !6, line: 87, baseType: !138, size: 64, align: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !6, line: 76, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !6, line: 71, size: 256, align: 64, elements: !141)
!141 = !{!142, !146, !152, !156}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !140, file: !6, line: 72, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!38, !30, !79, !79}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !140, file: !6, line: 73, baseType: !147, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !30, !79}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !34, line: 30, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !140, file: !6, line: 74, baseType: !153, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !30, !38}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !140, file: !6, line: 75, baseType: !157, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !30, !150}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !120, file: !6, line: 88, baseType: !30, size: 64, align: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !54, file: !6, line: 63, baseType: !162, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !6, line: 33, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!150, !112, !30, !150}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !54, file: !6, line: 64, baseType: !167, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !6, line: 35, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!30, !112, !119, !150}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !54, file: !6, line: 66, baseType: !172, size: 64, align: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !6, line: 42, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!23, !112, !30, !176, !23}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !19, line: 79, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !19, line: 79, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !54, file: !6, line: 67, baseType: !180, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !6, line: 44, baseType: !116)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !54, file: !6, line: 68, baseType: !30, size: 64, align: 64, offset: 768)
!182 = distinct !DIGlobalVariable(name: "TLS_FEATURE_it", scope: !0, file: !51, line: 28, type: !61, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @TLS_FEATURE_it)
!183 = distinct !DIGlobalVariable(name: "TLS_FEATURE_item_tt", scope: !0, file: !51, line: 26, type: !70, isLocal: true, isDefinition: true, variable: %struct.ASN1_TEMPLATE_st* @TLS_FEATURE_item_tt)
!184 = distinct !DIGlobalVariable(name: "tls_feature_tbl", scope: !0, file: !51, line: 49, type: !185, isLocal: true, isDefinition: true, variable: [2 x %struct.TLS_FEATURE_NAME]* @tls_feature_tbl)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 256, align: 64, elements: !191)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "TLS_FEATURE_NAME", file: !51, line: 47, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 44, size: 128, align: 64, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !187, file: !51, line: 45, baseType: !29, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !51, line: 46, baseType: !79, size: 64, align: 64, offset: 64)
!191 = !{!192}
!192 = !DISubrange(count: 2)
!193 = !{i32 2, !"Dwarf Version", i32 4}
!194 = !{i32 2, !"Debug Info Version", i32 3}
!195 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!196 = distinct !DISubprogram(name: "TLS_FEATURE_new", scope: !51, file: !51, line: 30, type: !197, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!197 = !DISubroutineType(types: !198)
!198 = !{!4}
!199 = !DILocation(line: 30, column: 60, scope: !196)
!200 = !DILocation(line: 30, column: 45, scope: !196)
!201 = !DILocation(line: 30, column: 38, scope: !196)
!202 = distinct !DISubprogram(name: "TLS_FEATURE_free", scope: !51, file: !51, line: 30, type: !203, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !4}
!205 = !DILocalVariable(name: "a", arg: 1, scope: !202, file: !51, line: 30, type: !4)
!206 = !DIExpression()
!207 = !DILocation(line: 30, column: 133, scope: !202)
!208 = !DILocation(line: 30, column: 167, scope: !202)
!209 = !DILocation(line: 30, column: 153, scope: !202)
!210 = !DILocation(line: 30, column: 138, scope: !202)
!211 = !DILocation(line: 30, column: 192, scope: !202)
!212 = distinct !DISubprogram(name: "i2v_TLS_FEATURE", scope: !51, file: !51, line: 60, type: !213, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!213 = !DISubroutineType(types: !214)
!214 = !{!150, !215, !4, !150}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!216 = !DILocalVariable(name: "method", arg: 1, scope: !212, file: !51, line: 60, type: !215)
!217 = !DILocation(line: 60, column: 77, scope: !212)
!218 = !DILocalVariable(name: "tls_feature", arg: 2, scope: !212, file: !51, line: 61, type: !4)
!219 = !DILocation(line: 61, column: 59, scope: !212)
!220 = !DILocalVariable(name: "ext_list", arg: 3, scope: !212, file: !51, line: 62, type: !150)
!221 = !DILocation(line: 62, column: 74, scope: !212)
!222 = !DILocalVariable(name: "i", scope: !212, file: !51, line: 64, type: !23)
!223 = !DILocation(line: 64, column: 9, scope: !212)
!224 = !DILocalVariable(name: "j", scope: !212, file: !51, line: 65, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !226, line: 216, baseType: !75)
!226 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!227 = !DILocation(line: 65, column: 12, scope: !212)
!228 = !DILocalVariable(name: "ai", scope: !212, file: !51, line: 66, type: !17)
!229 = !DILocation(line: 66, column: 19, scope: !212)
!230 = !DILocalVariable(name: "tlsextid", scope: !212, file: !51, line: 67, type: !29)
!231 = !DILocation(line: 67, column: 10, scope: !212)
!232 = !DILocation(line: 68, column: 12, scope: !233)
!233 = distinct !DILexicalBlock(scope: !212, file: !51, line: 68, column: 5)
!234 = !DILocation(line: 68, column: 10, scope: !233)
!235 = !DILocation(line: 68, column: 17, scope: !236)
!236 = !DILexicalBlockFile(scope: !237, file: !51, discriminator: 1)
!237 = distinct !DILexicalBlock(scope: !233, file: !51, line: 68, column: 5)
!238 = !DILocation(line: 68, column: 41, scope: !236)
!239 = !DILocation(line: 68, column: 21, scope: !236)
!240 = !DILocation(line: 68, column: 19, scope: !236)
!241 = !DILocation(line: 68, column: 5, scope: !236)
!242 = !DILocation(line: 69, column: 36, scope: !243)
!243 = distinct !DILexicalBlock(scope: !237, file: !51, line: 68, column: 60)
!244 = !DILocation(line: 69, column: 49, scope: !243)
!245 = !DILocation(line: 69, column: 14, scope: !243)
!246 = !DILocation(line: 69, column: 12, scope: !243)
!247 = !DILocation(line: 70, column: 37, scope: !243)
