; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--asn1--libcrypto-lib-tasn_typ.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--asn1--libcrypto-lib-tasn_typ.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.ASN1_VALUE_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.stack_st_ASN1_TYPE = type opaque

@.str = private unnamed_addr constant [18 x i8] c"ASN1_OCTET_STRING\00", align 1
@ASN1_OCTET_STRING_it = constant %struct.ASN1_ITEM_st { i8 0, i64 4, %struct.ASN1_TEMPLATE_st* null, i64 0, i8* null, i64 0, i8* getelementptr inbounds ([18 x i8], [18 x i8]* @.str, i32 0, i32 0) }, align 8
@.str.1 = private unnamed_addr constant [13 x i8] c"ASN1_INTEGER\00", align 1
@ASN1_INTEGER_it = constant %struct.ASN1_ITEM_st { i8 0, i64 2, %struct.ASN1_TEMPLATE_st* null, i64 0, i8* null, i64 0, i8* getelementptr inbounds ([13 x i8], [13 x i8]* @.str.1, i32 0, i32 0) }, align 8
@.str.2 = private unnamed_addr constant [16 x i8] c"ASN1_ENUMERATED\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !90)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--asn1--libcrypto-lib-tasn_typ.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !18, !19, !22, !24, !26, !28, !30, !32, !34, !36, !38, !40, !42, !44, !46, !48, !50, !64, !87}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !6, line: 43, baseType: !7)
!6 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !8, line: 146, size: 192, align: 64, elements: !9)
!8 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!9 = !{!10, !12, !13, !16}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !7, file: !8, line: 147, baseType: !11, size: 32, align: 32)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !7, file: !8, line: 148, baseType: !11, size: 32, align: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !7, file: !8, line: 149, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !7, file: !8, line: 155, baseType: !17, size: 64, align: 64, offset: 128)
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !8, line: 213, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !8, line: 213, flags: DIFlagFwdDecl)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !6, line: 40, baseType: !7)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !6, line: 41, baseType: !7)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !6, line: 42, baseType: !7)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !6, line: 54, baseType: !7)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !6, line: 44, baseType: !7)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !6, line: 45, baseType: !7)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !6, line: 46, baseType: !7)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !6, line: 47, baseType: !7)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !6, line: 50, baseType: !7)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !6, line: 52, baseType: !7)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !6, line: 53, baseType: !7)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !6, line: 48, baseType: !7)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !6, line: 49, baseType: !7)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_NULL", file: !6, line: 57, baseType: !11)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !8, line: 473, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !8, line: 444, size: 128, align: 64, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !8, line: 445, baseType: !11, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !52, file: !8, line: 472, baseType: !56, size: 64, align: 64, offset: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !8, line: 446, size: 64, align: 64, elements: !57)
!57 = !{!58, !61, !63, !66, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !56, file: !8, line: 447, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !56, file: !8, line: 448, baseType: !62, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !6, line: 56, baseType: !11)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !56, file: !8, line: 449, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !6, line: 55, baseType: !7)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !56, file: !8, line: 450, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !6, line: 60, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !6, line: 60, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !56, file: !8, line: 451, baseType: !22, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !56, file: !8, line: 452, baseType: !24, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !56, file: !8, line: 453, baseType: !26, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !56, file: !8, line: 454, baseType: !4, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !56, file: !8, line: 455, baseType: !30, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !56, file: !8, line: 456, baseType: !32, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !56, file: !8, line: 457, baseType: !34, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !56, file: !8, line: 458, baseType: !36, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !56, file: !8, line: 459, baseType: !46, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !56, file: !8, line: 460, baseType: !44, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !56, file: !8, line: 461, baseType: !38, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !56, file: !8, line: 462, baseType: !40, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !56, file: !8, line: 463, baseType: !42, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !56, file: !8, line: 464, baseType: !28, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !56, file: !8, line: 469, baseType: !64, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !56, file: !8, line: 470, baseType: !64, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !56, file: !8, line: 471, baseType: !19, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_SEQUENCE_ANY", file: !8, line: 477, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_TYPE", file: !8, line: 475, flags: DIFlagFwdDecl)
!90 = !{!91, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!91 = distinct !DIGlobalVariable(name: "ASN1_OCTET_STRING_it", scope: !0, file: !92, line: 28, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_OCTET_STRING_it)
!92 = !DIFile(filename: "crypto/asn1/tasn_typ.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !6, line: 62, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !96, line: 580, size: 448, align: 64, elements: !97)
!96 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!97 = !{!98, !99, !100, !116, !117, !120, !121}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !95, file: !96, line: 581, baseType: !60, size: 8, align: 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !95, file: !96, line: 583, baseType: !17, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !95, file: !96, line: 584, baseType: !101, size: 64, align: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !8, line: 210, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !96, line: 468, size: 320, align: 64, elements: !105)
!105 = !{!106, !108, !109, !110, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !104, file: !96, line: 469, baseType: !107, size: 64, align: 64)
!107 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !104, file: !96, line: 470, baseType: !17, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !104, file: !96, line: 471, baseType: !107, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !104, file: !96, line: 472, baseType: !111, size: 64, align: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !104, file: !96, line: 473, baseType: !114, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !8, line: 318, baseType: !93)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !95, file: !96, line: 586, baseType: !17, size: 64, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !95, file: !96, line: 587, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !95, file: !96, line: 588, baseType: !17, size: 64, align: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !95, file: !96, line: 589, baseType: !111, size: 64, align: 64, offset: 384)
!122 = distinct !DIGlobalVariable(name: "ASN1_INTEGER_it", scope: !0, file: !92, line: 29, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_INTEGER_it)
!123 = distinct !DIGlobalVariable(name: "ASN1_ENUMERATED_it", scope: !0, file: !92, line: 30, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_ENUMERATED_it)
!124 = distinct !DIGlobalVariable(name: "ASN1_BIT_STRING_it", scope: !0, file: !92, line: 31, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_BIT_STRING_it)
!125 = distinct !DIGlobalVariable(name: "ASN1_UTF8STRING_it", scope: !0, file: !92, line: 32, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_UTF8STRING_it)
!126 = distinct !DIGlobalVariable(name: "ASN1_PRINTABLESTRING_it", scope: !0, file: !92, line: 33, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_PRINTABLESTRING_it)
!127 = distinct !DIGlobalVariable(name: "ASN1_T61STRING_it", scope: !0, file: !92, line: 34, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_T61STRING_it)
!128 = distinct !DIGlobalVariable(name: "ASN1_IA5STRING_it", scope: !0, file: !92, line: 35, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_IA5STRING_it)
!129 = distinct !DIGlobalVariable(name: "ASN1_GENERALSTRING_it", scope: !0, file: !92, line: 36, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_GENERALSTRING_it)
!130 = distinct !DIGlobalVariable(name: "ASN1_UTCTIME_it", scope: !0, file: !92, line: 37, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_UTCTIME_it)
!131 = distinct !DIGlobalVariable(name: "ASN1_GENERALIZEDTIME_it", scope: !0, file: !92, line: 38, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_GENERALIZEDTIME_it)
!132 = distinct !DIGlobalVariable(name: "ASN1_VISIBLESTRING_it", scope: !0, file: !92, line: 39, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_VISIBLESTRING_it)
!133 = distinct !DIGlobalVariable(name: "ASN1_UNIVERSALSTRING_it", scope: !0, file: !92, line: 40, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_UNIVERSALSTRING_it)
!134 = distinct !DIGlobalVariable(name: "ASN1_BMPSTRING_it", scope: !0, file: !92, line: 41, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_BMPSTRING_it)
!135 = distinct !DIGlobalVariable(name: "ASN1_NULL_it", scope: !0, file: !92, line: 43, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_NULL_it)
!136 = distinct !DIGlobalVariable(name: "ASN1_OBJECT_it", scope: !0, file: !92, line: 46, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_OBJECT_it)
!137 = distinct !DIGlobalVariable(name: "ASN1_ANY_it", scope: !0, file: !92, line: 48, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_ANY_it)
!138 = distinct !DIGlobalVariable(name: "ASN1_SEQUENCE_it", scope: !0, file: !92, line: 51, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_SEQUENCE_it)
!139 = distinct !DIGlobalVariable(name: "ASN1_PRINTABLE_it", scope: !0, file: !92, line: 57, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ASN1_PRINTABLE_it)
!140 = distinct !DIGlobalVariable(name: "DISPLAYTEXT_it", scope: !0, file: !92, line: 60, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @DISPLAYTEXT_it)
!141 = distinct !DIGlobalVariable(name: "DIRECTORYSTRING_it", scope: !0, file: !92, line: 63, type: !93, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @DIRECTORYSTRING_it)
