; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_admis.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_admis.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !173)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_admis.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !32, !33, !36, !53, !154, !162, !163, !30, !11, !168, !169}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "NAMING_AUTHORITY", file: !6, line: 872, baseType: !7)
!6 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamingAuthority_st", file: !8, line: 13, size: 192, align: 64, elements: !9)
!8 = !DIFile(filename: "crypto/x509v3/v3_admis.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!9 = !{!10, !15, !29}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "namingAuthorityId", scope: !7, file: !8, line: 14, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !13, line: 60, baseType: !14)
!13 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !13, line: 60, flags: DIFlagFwdDecl)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "namingAuthorityUrl", scope: !7, file: !8, line: 15, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !13, line: 46, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !19, line: 146, size: 192, align: 64, elements: !20)
!19 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!20 = !{!21, !23, !24, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !18, file: !19, line: 147, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !19, line: 148, baseType: !22, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !18, file: !19, line: 149, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !18, file: !19, line: 155, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "namingAuthorityText", scope: !7, file: !8, line: 16, baseType: !30, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !13, line: 55, baseType: !18)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !19, line: 213, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !19, line: 213, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROFESSION_INFO", file: !6, line: 873, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProfessionInfo_st", file: !8, line: 19, size: 320, align: 64, elements: !39)
!39 = !{!40, !41, !44, !47, !50}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "namingAuthority", scope: !38, file: !8, line: 20, baseType: !4, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "professionItems", scope: !38, file: !8, line: 21, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_STRING", file: !6, line: 867, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "professionOIDs", scope: !38, file: !8, line: 22, baseType: !45, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_OBJECT", file: !19, line: 536, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "registrationNumber", scope: !38, file: !8, line: 23, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !13, line: 44, baseType: !18)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "addProfessionInfo", scope: !38, file: !8, line: 24, baseType: !51, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !13, line: 43, baseType: !18)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ADMISSIONS", file: !6, line: 874, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Admissions_st", file: !8, line: 27, size: 192, align: 64, elements: !56)
!56 = !{!57, !150, !151}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "admissionAuthority", scope: !55, file: !8, line: 28, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !6, line: 153, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !6, line: 123, size: 128, align: 64, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !6, line: 133, baseType: !22, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !60, file: !6, line: 152, baseType: !64, size: 64, align: 64, offset: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !60, file: !6, line: 134, size: 64, align: 64, elements: !65)
!65 = !{!66, !69, !128, !129, !130, !131, !135, !142, !143, !144, !145, !146, !147, !148, !149}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !64, file: !6, line: 135, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !64, file: !6, line: 136, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !6, line: 116, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !6, line: 113, size: 128, align: 64, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !72, file: !6, line: 114, baseType: !11, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !72, file: !6, line: 115, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !19, line: 473, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !19, line: 444, size: 128, align: 64, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !19, line: 445, baseType: !22, size: 32, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !78, file: !19, line: 472, baseType: !82, size: 64, align: 64, offset: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !19, line: 446, size: 64, align: 64, elements: !83)
!83 = !{!84, !85, !87, !88, !89, !92, !95, !98, !99, !100, !103, !104, !107, !110, !113, !116, !119, !122, !125, !126, !127}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !82, file: !19, line: 447, baseType: !67, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !82, file: !19, line: 448, baseType: !86, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !13, line: 56, baseType: !22)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !82, file: !19, line: 449, baseType: !30, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !82, file: !19, line: 450, baseType: !11, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !82, file: !19, line: 451, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !13, line: 40, baseType: !18)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !82, file: !19, line: 452, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !13, line: 41, baseType: !18)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !82, file: !19, line: 453, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !13, line: 42, baseType: !18)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !82, file: !19, line: 454, baseType: !51, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !82, file: !19, line: 455, baseType: !48, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !82, file: !19, line: 456, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !13, line: 45, baseType: !18)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !82, file: !19, line: 457, baseType: !16, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !82, file: !19, line: 458, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !13, line: 47, baseType: !18)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !82, file: !19, line: 459, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !13, line: 49, baseType: !18)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !82, file: !19, line: 460, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !13, line: 48, baseType: !18)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !82, file: !19, line: 461, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !13, line: 50, baseType: !18)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !82, file: !19, line: 462, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !13, line: 52, baseType: !18)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !82, file: !19, line: 463, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !13, line: 53, baseType: !18)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !82, file: !19, line: 464, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !13, line: 54, baseType: !18)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !82, file: !19, line: 469, baseType: !30, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !82, file: !19, line: 470, baseType: !30, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !82, file: !19, line: 471, baseType: !33, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !64, file: !6, line: 137, baseType: !16, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !64, file: !6, line: 138, baseType: !16, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !64, file: !6, line: 139, baseType: !76, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !64, file: !6, line: 140, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !13, line: 129, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !13, line: 129, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !64, file: !6, line: 141, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !6, line: 121, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !6, line: 118, size: 128, align: 64, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !138, file: !6, line: 119, baseType: !30, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !138, file: !6, line: 120, baseType: !30, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !64, file: !6, line: 142, baseType: !16, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !64, file: !6, line: 143, baseType: !51, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !64, file: !6, line: 144, baseType: !11, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !64, file: !6, line: 146, baseType: !51, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !64, file: !6, line: 147, baseType: !132, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !64, file: !6, line: 148, baseType: !16, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !64, file: !6, line: 150, baseType: !11, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !64, file: !6, line: 151, baseType: !76, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "namingAuthority", scope: !55, file: !8, line: 29, baseType: !4, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "professionInfos", scope: !55, file: !8, line: 30, baseType: !152, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PROFESSION_INFO", file: !6, line: 881, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ADMISSION_SYNTAX", file: !6, line: 875, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AdmissionSyntax_st", file: !8, line: 33, size: 128, align: 64, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "admissionAuthority", scope: !156, file: !8, line: 34, baseType: !58, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "contentsOfAdmissions", scope: !156, file: !8, line: 35, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ADMISSIONS", file: !6, line: 880, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !166, line: 17, baseType: !167)
!166 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !166, line: 17, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !166, line: 20, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !162}
!173 = !{!174, !205, !206, !207, !208, !313, !317, !321, !322}
!174 = distinct !DIGlobalVariable(name: "NAMING_AUTHORITY_it", scope: !0, file: !175, line: 28, type: !176, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @NAMING_AUTHORITY_it)
!175 = !DIFile(filename: "crypto/x509v3/v3_admis.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !13, line: 62, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !179, line: 580, size: 448, align: 64, elements: !180)
!179 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!180 = !{!181, !182, !183, !199, !200, !203, !204}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !178, file: !179, line: 581, baseType: !68, size: 8, align: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !178, file: !179, line: 583, baseType: !28, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !178, file: !179, line: 584, baseType: !184, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !19, line: 210, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !179, line: 468, size: 320, align: 64, elements: !188)
!188 = !{!189, !191, !192, !193, !196}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !187, file: !179, line: 469, baseType: !190, size: 64, align: 64)
!190 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !187, file: !179, line: 470, baseType: !28, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !187, file: !179, line: 471, baseType: !190, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !187, file: !179, line: 472, baseType: !194, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !187, file: !179, line: 473, baseType: !197, size: 64, align: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !19, line: 318, baseType: !176)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !178, file: !179, line: 586, baseType: !28, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !178, file: !179, line: 587, baseType: !201, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !178, file: !179, line: 588, baseType: !28, size: 64, align: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !178, file: !179, line: 589, baseType: !194, size: 64, align: 64, offset: 384)
!205 = distinct !DIGlobalVariable(name: "PROFESSION_INFO_it", scope: !0, file: !175, line: 36, type: !176, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @PROFESSION_INFO_it)
!206 = distinct !DIGlobalVariable(name: "ADMISSIONS_it", scope: !0, file: !175, line: 42, type: !176, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ADMISSIONS_it)
!207 = distinct !DIGlobalVariable(name: "ADMISSION_SYNTAX_it", scope: !0, file: !175, line: 47, type: !176, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ADMISSION_SYNTAX_it)
!208 = distinct !DIGlobalVariable(name: "v3_ext_admission", scope: !0, file: !175, line: 57, type: !209, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_ext_admission)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !6, line: 92, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !6, line: 49, size: 832, align: 64, elements: !212)
!212 = !{!213, !214, !215, !216, !221, !223, !231, !237, !244, !292, !297, !302, !310, !312}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !211, file: !6, line: 50, baseType: !22, size: 32, align: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !211, file: !6, line: 51, baseType: !22, size: 32, align: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !211, file: !6, line: 53, baseType: !197, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !211, file: !6, line: 55, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !6, line: 28, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!162}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !211, file: !6, line: 56, baseType: !222, size: 64, align: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !6, line: 29, baseType: !170)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !211, file: !6, line: 57, baseType: !224, size: 64, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !6, line: 30, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!162, !162, !228, !28}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !211, file: !6, line: 58, baseType: !232, size: 64, align: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !6, line: 31, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!22, !162, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !211, file: !6, line: 60, baseType: !238, size: 64, align: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !6, line: 38, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!67, !242, !162}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !211, file: !6, line: 61, baseType: !245, size: 64, align: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !6, line: 40, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!162, !242, !249, !194}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !6, line: 79, size: 448, align: 64, elements: !251)
!251 = !{!252, !253, !257, !258, !263, !267, !291}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !250, file: !6, line: 82, baseType: !22, size: 32, align: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !250, file: !6, line: 83, baseType: !254, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !13, line: 124, baseType: !256)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !13, line: 124, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !250, file: !6, line: 84, baseType: !254, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !250, file: !6, line: 85, baseType: !259, size: 64, align: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !261, line: 93, baseType: !262)
!261 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !261, line: 93, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !250, file: !6, line: 86, baseType: !264, size: 64, align: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !13, line: 126, baseType: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !13, line: 126, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !250, file: !6, line: 87, baseType: !268, size: 64, align: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !6, line: 76, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !6, line: 71, size: 256, align: 64, elements: !271)
!271 = !{!272, !276, !283, !287}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !270, file: !6, line: 72, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!67, !162, !194, !194}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !270, file: !6, line: 73, baseType: !277, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !162, !194}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !282, line: 30, flags: DIFlagFwdDecl)
!282 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!283 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !270, file: !6, line: 74, baseType: !284, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !162, !67}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !270, file: !6, line: 75, baseType: !288, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !162, !280}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !250, file: !6, line: 88, baseType: !162, size: 64, align: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !211, file: !6, line: 63, baseType: !293, size: 64, align: 64, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !6, line: 33, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!280, !242, !162, !280}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !211, file: !6, line: 64, baseType: !298, size: 64, align: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !6, line: 35, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!162, !242, !249, !280}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !211, file: !6, line: 66, baseType: !303, size: 64, align: 64, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !6, line: 42, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!22, !242, !162, !307, !22}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !13, line: 79, baseType: !309)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !13, line: 79, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !211, file: !6, line: 67, baseType: !311, size: 64, align: 64, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !6, line: 44, baseType: !246)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !211, file: !6, line: 68, baseType: !162, size: 64, align: 64, offset: 768)
!313 = distinct !DIGlobalVariable(name: "NAMING_AUTHORITY_seq_tt", scope: !0, file: !175, line: 24, type: !314, isLocal: true, isDefinition: true, variable: [3 x %struct.ASN1_TEMPLATE_st]* @NAMING_AUTHORITY_seq_tt)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 960, align: 64, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 3)
!317 = distinct !DIGlobalVariable(name: "PROFESSION_INFO_seq_tt", scope: !0, file: !175, line: 30, type: !318, isLocal: true, isDefinition: true, variable: [5 x %struct.ASN1_TEMPLATE_st]* @PROFESSION_INFO_seq_tt)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 1600, align: 64, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 5)
!321 = distinct !DIGlobalVariable(name: "ADMISSIONS_seq_tt", scope: !0, file: !175, line: 38, type: !314, isLocal: true, isDefinition: true, variable: [3 x %struct.ASN1_TEMPLATE_st]* @ADMISSIONS_seq_tt)
!322 = distinct !DIGlobalVariable(name: "ADMISSION_SYNTAX_seq_tt", scope: !0, file: !175, line: 44, type: !323, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @ADMISSION_SYNTAX_seq_tt)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 640, align: 64, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 2)
!326 = !{i32 2, !"Dwarf Version", i32 4}
!327 = !{i32 2, !"Debug Info Version", i32 3}
!328 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!329 = distinct !DISubprogram(name: "d2i_NAMING_AUTHORITY", scope: !175, file: !175, line: 49, type: !330, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!330 = !DISubroutineType(types: !331)
!331 = !{!4, !332, !228, !28}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!333 = !DILocalVariable(name: "a", arg: 1, scope: !329, file: !175, line: 49, type: !332)
!334 = !DIExpression()
!335 = !DILocation(line: 49, column: 59, scope: !329)
!336 = !DILocalVariable(name: "in", arg: 2, scope: !329, file: !175, line: 49, type: !228)
!337 = !DILocation(line: 49, column: 84, scope: !329)
!338 = !DILocalVariable(name: "len", arg: 3, scope: !329, file: !175, line: 49, type: !28)
!339 = !DILocation(line: 49, column: 93, scope: !329)
!340 = !DILocation(line: 49, column: 156, scope: !329)
!341 = !DILocation(line: 49, column: 141, scope: !329)
!342 = !DILocation(line: 49, column: 159, scope: !329)
!343 = !DILocation(line: 49, column: 163, scope: !329)
!344 = !DILocation(line: 49, column: 127, scope: !329)
!345 = !DILocation(line: 49, column: 107, scope: !329)
!346 = !DILocation(line: 49, column: 100, scope: !329)
!347 = distinct !DISubprogram(name: "i2d_NAMING_AUTHORITY", scope: !175, file: !175, line: 49, type: !348, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!348 = !DISubroutineType(types: !349)
!349 = !{!22, !4, !236}
!350 = !DILocalVariable(name: "a", arg: 1, scope: !347, file: !175, line: 49, type: !4)
!351 = !DILocation(line: 49, column: 240, scope: !347)
!352 = !DILocalVariable(name: "out", arg: 2, scope: !347, file: !175, line: 49, type: !236)
!353 = !DILocation(line: 49, column: 259, scope: !347)
!354 = !DILocation(line: 49, column: 301, scope: !347)
!355 = !DILocation(line: 49, column: 287, scope: !347)
!356 = !DILocation(line: 49, column: 304, scope: !347)
!357 = !DILocation(line: 49, column: 273, scope: !347)
!358 = !DILocation(line: 49, column: 266, scope: !347)
!359 = distinct !DISubprogram(name: "NAMING_AUTHORITY_new", scope: !175, file: !175, line: 49, type: !360, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!360 = !DISubroutineType(types: !361)
!361 = !{!4}
!362 = !DILocation(line: 49, column: 412, scope: !359)
