; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--rand--libcrypto-lib-drbg_ctr.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--rand--libcrypto-lib-drbg_ctr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rand_drbg_st = type { i8*, %struct.rand_drbg_st*, i32, i32, i32, i16, %struct.rand_pool_st*, %struct.rand_pool_st*, i32, i64, i64, i64, i64, i64, i64, i64, i32, i32, i64, i64, i32, i32, i64, i32, %struct.crypto_ex_data_st, %union.anon, %struct.rand_drbg_method_st*, i64 (%struct.rand_drbg_st*, i8**, i32, i64, i64, i32)*, void (%struct.rand_drbg_st*, i8*, i64)*, i64 (%struct.rand_drbg_st*, i8**, i32, i64, i64)*, void (%struct.rand_drbg_st*, i8*, i64)* }
%struct.rand_pool_st = type { i8*, i64, i32, i64, i64, i64, i64 }
%struct.crypto_ex_data_st = type { %struct.stack_st_void* }
%struct.stack_st_void = type opaque
%union.anon = type { %struct.rand_drbg_hash_st }
%struct.rand_drbg_hash_st = type { %struct.evp_md_st*, %struct.evp_md_ctx_st*, i64, [111 x i8], [111 x i8], [111 x i8] }
%struct.evp_md_st = type opaque
%struct.evp_md_ctx_st = type opaque
%struct.rand_drbg_method_st = type { i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64)*, {}* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, globals: !12)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--rand--libcrypto-lib-drbg_ctr.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "drbg_status_e", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "crypto/rand/rand_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "DRBG_UNINITIALISED", value: 0)
!7 = !DIEnumerator(name: "DRBG_READY", value: 1)
!8 = !DIEnumerator(name: "DRBG_ERROR", value: 2)
!9 = !{!10, !11}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !{!13, !193, !194}
!13 = distinct !DIGlobalVariable(name: "df_key", scope: !14, file: !15, line: 403, type: !192, isLocal: true, isDefinition: true, variable: [32 x i8]* @drbg_ctr_init.df_key)
!14 = distinct !DISubprogram(name: "drbg_ctr_init", scope: !15, file: !15, line: 368, type: !16, isLocal: false, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !191)
!15 = !DIFile(filename: "crypto/rand/drbg_ctr.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !19}
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG", file: !21, line: 121, baseType: !22)
!21 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_st", file: !4, line: 184, size: 4544, align: 64, elements: !23)
!23 = !{!24, !28, !29, !30, !31, !32, !34, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !60, !61, !67, !68, !69, !70, !71, !73, !80, !147, !172, !179, !184, !189}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !22, file: !4, line: 185, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_RWLOCK", file: !27, line: 67, baseType: null)
!27 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!28 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !22, file: !4, line: 186, baseType: !19, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !22, file: !4, line: 187, baseType: !18, size: 32, align: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, file: !4, line: 188, baseType: !18, size: 32, align: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fork_count", scope: !22, file: !4, line: 195, baseType: !18, size: 32, align: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !22, file: !4, line: 196, baseType: !33, size: 16, align: 16, offset: 224)
!33 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "seed_pool", scope: !22, file: !4, line: 206, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_pool_st", file: !4, line: 168, size: 448, align: 64, elements: !37)
!37 = !{!38, !40, !44, !45, !46, !47, !48}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !36, file: !4, line: 169, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !4, line: 170, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 216, baseType: !43)
!42 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!43 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "attached", scope: !36, file: !4, line: 172, baseType: !18, size: 32, align: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "min_len", scope: !36, file: !4, line: 174, baseType: !41, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !36, file: !4, line: 175, baseType: !41, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !36, file: !4, line: 176, baseType: !41, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_requested", scope: !36, file: !4, line: 177, baseType: !41, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "adin_pool", scope: !22, file: !4, line: 211, baseType: !35, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !22, file: !4, line: 233, baseType: !18, size: 32, align: 32, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "max_request", scope: !22, file: !4, line: 234, baseType: !41, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "min_entropylen", scope: !22, file: !4, line: 235, baseType: !41, size: 64, align: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "max_entropylen", scope: !22, file: !4, line: 235, baseType: !41, size: 64, align: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "min_noncelen", scope: !22, file: !4, line: 236, baseType: !41, size: 64, align: 64, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "max_noncelen", scope: !22, file: !4, line: 236, baseType: !41, size: 64, align: 64, offset: 704)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "max_perslen", scope: !22, file: !4, line: 237, baseType: !41, size: 64, align: 64, offset: 768)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "max_adinlen", scope: !22, file: !4, line: 237, baseType: !41, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_gen_counter", scope: !22, file: !4, line: 244, baseType: !59, size: 32, align: 32, offset: 896)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_interval", scope: !22, file: !4, line: 249, baseType: !59, size: 32, align: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_time", scope: !22, file: !4, line: 251, baseType: !62, size: 64, align: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !63, line: 75, baseType: !64)
!63 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !65, line: 139, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!66 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_time_interval", scope: !22, file: !4, line: 256, baseType: !62, size: 64, align: 64, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_prop_counter", scope: !22, file: !4, line: 267, baseType: !59, size: 32, align: 32, offset: 1088)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_next_counter", scope: !22, file: !4, line: 268, baseType: !59, size: 32, align: 32, offset: 1120)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !22, file: !4, line: 270, baseType: !41, size: 64, align: 64, offset: 1152)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !22, file: !4, line: 271, baseType: !72, size: 32, align: 32, offset: 1216)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "DRBG_STATUS", file: !4, line: 81, baseType: !3)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !22, file: !4, line: 274, baseType: !74, size: 64, align: 64, offset: 1280)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !21, line: 167, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !27, line: 86, size: 64, align: 64, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !75, file: !27, line: 87, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !27, line: 87, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !22, file: !4, line: 281, baseType: !81, size: 2880, align: 64, offset: 1344)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !22, file: !4, line: 277, size: 2880, align: 64, elements: !82)
!82 = !{!83, !112, !132}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !81, file: !4, line: 278, baseType: !84, size: 1216, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_CTR", file: !4, line: 154, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_ctr_st", file: !4, line: 143, size: 1216, align: 64, elements: !86)
!86 = !{!87, !91, !92, !97, !98, !102, !106, !107, !108}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !85, file: !4, line: 144, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !21, line: 90, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !21, line: 90, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_df", scope: !85, file: !4, line: 145, baseType: !88, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !85, file: !4, line: 146, baseType: !93, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !21, line: 89, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !21, line: 89, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !85, file: !4, line: 147, baseType: !41, size: 64, align: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !85, file: !4, line: 148, baseType: !99, size: 256, align: 8, offset: 256)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !85, file: !4, line: 149, baseType: !103, size: 128, align: 8, offset: 512)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 128, align: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 16)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bltmp", scope: !85, file: !4, line: 151, baseType: !103, size: 128, align: 8, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bltmp_pos", scope: !85, file: !4, line: 152, baseType: !41, size: 64, align: 64, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "KX", scope: !85, file: !4, line: 153, baseType: !109, size: 384, align: 8, offset: 832)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 384, align: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 48)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !81, file: !4, line: 279, baseType: !113, size: 2880, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_HASH", file: !4, line: 130, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_hash_st", file: !4, line: 122, size: 2880, align: 64, elements: !115)
!115 = !{!116, !121, !125, !126, !130, !131}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !114, file: !4, line: 123, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !21, line: 91, baseType: !120)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_st", file: !21, line: 91, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !114, file: !4, line: 124, baseType: !122, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !21, line: 92, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_ctx_st", file: !21, line: 92, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "blocklen", scope: !114, file: !4, line: 125, baseType: !41, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !114, file: !4, line: 126, baseType: !127, size: 888, align: 8, offset: 192)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 888, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 111)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !114, file: !4, line: 127, baseType: !127, size: 888, align: 8, offset: 1080)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "vtmp", scope: !114, file: !4, line: 129, baseType: !127, size: 888, align: 8, offset: 1968)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "hmac", scope: !81, file: !4, line: 280, baseType: !133, size: 1216, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_HMAC", file: !4, line: 138, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_hmac_st", file: !4, line: 132, size: 1216, align: 64, elements: !135)
!135 = !{!136, !137, !141, !142, !146}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !134, file: !4, line: 133, baseType: !117, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !134, file: !4, line: 134, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMAC_CTX", file: !21, line: 106, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "hmac_ctx_st", file: !21, line: 106, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "blocklen", scope: !134, file: !4, line: 135, baseType: !41, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !134, file: !4, line: 136, baseType: !143, size: 512, align: 8, offset: 192)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, align: 8, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !134, file: !4, line: 137, baseType: !143, size: 512, align: 8, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !22, file: !4, line: 284, baseType: !148, size: 64, align: 64, offset: 4224)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_METHOD", file: !4, line: 117, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_method_st", file: !4, line: 112, size: 256, align: 64, elements: !151)
!151 = !{!152, !159, !164, !169}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "instantiate", scope: !150, file: !4, line: 113, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_instantiate_fn", file: !4, line: 85, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!18, !19, !157, !41, !157, !41, !157, !41}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reseed", scope: !150, file: !4, line: 114, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_reseed_fn", file: !4, line: 93, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!18, !19, !157, !41, !157, !41}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "generate", scope: !150, file: !4, line: 115, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_generate_fn", file: !4, line: 99, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!18, !19, !39, !41, !157, !41}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "uninstantiate", scope: !150, file: !4, line: 116, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_uninstantiate_fn", file: !4, line: 105, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "get_entropy", scope: !22, file: !4, line: 287, baseType: !173, size: 64, align: 64, offset: 4288)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_get_entropy_fn", file: !174, line: 120, baseType: !175)
!174 = !DIFile(filename: "include/openssl/rand_drbg.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!41, !19, !178, !18, !41, !41, !18}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_entropy", scope: !22, file: !4, line: 288, baseType: !180, size: 64, align: 64, offset: 4352)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_cleanup_entropy_fn", file: !174, line: 125, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !19, !39, !41}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "get_nonce", scope: !22, file: !4, line: 289, baseType: !185, size: 64, align: 64, offset: 4416)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_get_nonce_fn", file: !174, line: 127, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!41, !19, !178, !18, !41, !41}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_nonce", scope: !22, file: !4, line: 290, baseType: !190, size: 64, align: 64, offset: 4480)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_cleanup_nonce_fn", file: !174, line: 130, baseType: !181)
!191 = !{}
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 256, align: 8, elements: !100)
!193 = distinct !DIGlobalVariable(name: "drbg_ctr_meth", scope: !0, file: !15, line: 361, type: !149, isLocal: true, isDefinition: true, variable: { i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*)* }* @drbg_ctr_meth)
!194 = distinct !DIGlobalVariable(name: "c80", scope: !195, file: !15, line: 169, type: !11, isLocal: true, isDefinition: true, variable: i8* @ctr_df.c80)
!195 = distinct !DISubprogram(name: "ctr_df", scope: !15, file: !15, line: 164, type: !196, isLocal: true, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !191)
!196 = !DISubroutineType(types: !197)
!197 = !{!18, !198, !157, !41, !157, !41, !157, !41}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!199 = !{i32 2, !"Dwarf Version", i32 4}
!200 = !{i32 2, !"Debug Info Version", i32 3}
!201 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!202 = !DILocalVariable(name: "drbg", arg: 1, scope: !14, file: !15, line: 368, type: !19)
!203 = !DIExpression()
!204 = !DILocation(line: 368, column: 30, scope: !14)
!205 = !DILocalVariable(name: "ctr", scope: !14, file: !15, line: 370, type: !198)
!206 = !DILocation(line: 370, column: 20, scope: !14)
!207 = !DILocation(line: 370, column: 27, scope: !14)
!208 = !DILocation(line: 370, column: 33, scope: !14)
!209 = !DILocation(line: 370, column: 38, scope: !14)
!210 = !DILocalVariable(name: "keylen", scope: !14, file: !15, line: 371, type: !41)
!211 = !DILocation(line: 371, column: 12, scope: !14)
!212 = !DILocation(line: 373, column: 13, scope: !14)
!213 = !DILocation(line: 373, column: 19, scope: !14)
!214 = !DILocation(line: 373, column: 5, scope: !14)
!215 = !DILocation(line: 376, column: 9, scope: !216)
!216 = distinct !DILexicalBlock(scope: !14, file: !15, line: 373, column: 25)
!217 = !DILocation(line: 378, column: 16, scope: !216)
!218 = !DILocation(line: 379, column: 23, scope: !216)
!219 = !DILocation(line: 379, column: 9, scope: !216)
!220 = !DILocation(line: 379, column: 14, scope: !216)
!221 = !DILocation(line: 379, column: 21, scope: !216)
!222 = !DILocation(line: 380, column: 9, scope: !216)
!223 = !DILocation(line: 382, column: 16, scope: !216)
!224 = !DILocation(line: 383, column: 23, scope: !216)
!225 = !DILocation(line: 383, column: 9, scope: !216)
!226 = !DILocation(line: 383, column: 14, scope: !216)
!227 = !DILocation(line: 383, column: 21, scope: !216)
!228 = !DILocation(line: 384, column: 9, scope: !216)
!229 = !DILocation(line: 386, column: 16, scope: !216)
!230 = !DILocation(line: 387, column: 23, scope: !216)
!231 = !DILocation(line: 387, column: 9, scope: !216)
!232 = !DILocation(line: 387, column: 14, scope: !216)
!233 = !DILocation(line: 387, column: 21, scope: !216)
!234 = !DILocation(line: 388, column: 9, scope: !216)
!235 = !DILocation(line: 391, column: 5, scope: !14)
!236 = !DILocation(line: 391, column: 11, scope: !14)
!237 = !DILocation(line: 391, column: 16, scope: !14)
!238 = !DILocation(line: 393, column: 19, scope: !14)
!239 = !DILocation(line: 393, column: 5, scope: !14)
!240 = !DILocation(line: 393, column: 10, scope: !14)
!241 = !DILocation(line: 393, column: 17, scope: !14)
!242 = !DILocation(line: 394, column: 9, scope: !243)
!243 = distinct !DILexicalBlock(scope: !14, file: !15, line: 394, column: 9)
!244 = !DILocation(line: 394, column: 14, scope: !243)
!245 = !DILocation(line: 394, column: 18, scope: !243)
!246 = !DILocation(line: 394, column: 9, scope: !14)
