; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--bn--libcrypto-lib-bn_ctx.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--bn--libcrypto-lib-bn_ctx.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bignum_ctx = type { %struct.bignum_pool, %struct.bignum_ctx_stack, i32, i32, i32, i32 }
%struct.bignum_pool = type { %struct.bignum_pool_item*, %struct.bignum_pool_item*, %struct.bignum_pool_item*, i32, i32 }
%struct.bignum_pool_item = type { [16 x %struct.bignum_st], %struct.bignum_pool_item*, %struct.bignum_pool_item* }
%struct.bignum_st = type { i64*, i32, i32, i32, i32 }
%struct.bignum_ctx_stack = type { i32*, i32, i32 }

@.str = private unnamed_addr constant [19 x i8] c"crypto/bn/bn_ctx.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.bignum_ctx* @BN_CTX_new() #0 !dbg !8 {
entry:
  %retval = alloca %struct.bignum_ctx*, align 8
  %ret = alloca %struct.bignum_ctx*, align 8
  call void @llvm.dbg.declare(metadata %struct.bignum_ctx** %ret, metadata !62, metadata !63), !dbg !64
  %call = call i8* @CRYPTO_zalloc(i64 64, i8* getelementptr inbounds ([19 x i8], [19 x i8]* @.str, i32 0, i32 0), i32 138), !dbg !65
  %0 = bitcast i8* %call to %struct.bignum_ctx*, !dbg !65
  store %struct.bignum_ctx* %0, %struct.bignum_ctx** %ret, align 8, !dbg !67
  %cmp = icmp eq %struct.bignum_ctx* %0, null, !dbg !68

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--bn--libcrypto-lib-bn_ctx.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!8 = distinct !DISubprogram(name: "BN_CTX_new", scope: !9, file: !9, line: 134, type: !10, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!9 = !DIFile(filename: "crypto/bn/bn_ctx.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!10 = !DISubroutineType(types: !11)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !14, line: 81, baseType: !15)
!14 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !9, line: 75, size: 512, align: 64, elements: !16)
!16 = !{!17, !50, !58, !59, !60, !61}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !15, file: !9, line: 77, baseType: !18, size: 256, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_POOL", file: !9, line: 48, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_pool", file: !9, line: 43, size: 256, align: 64, elements: !20)
!20 = !{!21, !45, !46, !47, !49}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !19, file: !9, line: 45, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_POOL_ITEM", file: !9, line: 41, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_pool_item", file: !9, line: 36, size: 3200, align: 64, elements: !25)
!25 = !{!26, !42, !44}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !24, file: !9, line: 38, baseType: !27, size: 3072, align: 64)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 3072, align: 64, elements: !40)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !14, line: 80, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !30, line: 218, size: 192, align: 64, elements: !31)
!30 = !DIFile(filename: "crypto/bn/bn_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!31 = !{!32, !35, !37, !38, !39}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !29, file: !30, line: 219, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !29, file: !30, line: 221, baseType: !36, size: 32, align: 32, offset: 64)
!36 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !29, file: !30, line: 223, baseType: !36, size: 32, align: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !29, file: !30, line: 224, baseType: !36, size: 32, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !30, line: 225, baseType: !36, size: 32, align: 32, offset: 160)
!40 = !{!41}
!41 = !DISubrange(count: 16)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !24, file: !9, line: 40, baseType: !43, size: 64, align: 64, offset: 3072)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !9, line: 40, baseType: !43, size: 64, align: 64, offset: 3136)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !19, file: !9, line: 45, baseType: !22, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !19, file: !9, line: 45, baseType: !22, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !19, file: !9, line: 47, baseType: !48, size: 32, align: 32, offset: 192)
!48 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !19, file: !9, line: 47, baseType: !48, size: 32, align: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !15, file: !9, line: 79, baseType: !51, size: 128, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_STACK", file: !9, line: 64, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx_stack", file: !9, line: 59, size: 128, align: 64, elements: !53)
!53 = !{!54, !56, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !52, file: !9, line: 61, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !52, file: !9, line: 63, baseType: !48, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !52, file: !9, line: 63, baseType: !48, size: 32, align: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !15, file: !9, line: 81, baseType: !48, size: 32, align: 32, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "err_stack", scope: !15, file: !9, line: 83, baseType: !36, size: 32, align: 32, offset: 416)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "too_many", scope: !15, file: !9, line: 85, baseType: !36, size: 32, align: 32, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !15, file: !9, line: 87, baseType: !36, size: 32, align: 32, offset: 480)
!62 = !DILocalVariable(name: "ret", scope: !8, file: !9, line: 136, type: !12)
!63 = !DIExpression()
!64 = !DILocation(line: 136, column: 13, scope: !8)
!65 = !DILocation(line: 138, column: 16, scope: !66)
!66 = distinct !DILexicalBlock(scope: !8, file: !9, line: 138, column: 9)
!67 = !DILocation(line: 138, column: 14, scope: !66)
!68 = !DILocation(line: 138, column: 72, scope: !66)
!69 = !DILocation(line: 138, column: 9, scope: !8)
!70 = !DILocation(line: 139, column: 9, scope: !71)
!71 = distinct !DILexicalBlock(scope: !66, file: !9, line: 138, column: 54)
!72 = !DILocation(line: 140, column: 9, scope: !71)
!73 = !DILocation(line: 143, column: 19, scope: !8)
!74 = !DILocation(line: 143, column: 24, scope: !8)
!75 = !DILocation(line: 143, column: 5, scope: !8)
!76 = !DILocation(line: 144, column: 20, scope: !8)
!77 = !DILocation(line: 144, column: 25, scope: !8)
!78 = !DILocation(line: 144, column: 5, scope: !8)
!79 = !DILocation(line: 145, column: 12, scope: !8)
!80 = !DILocation(line: 145, column: 5, scope: !8)
!81 = !DILocation(line: 146, column: 1, scope: !8)
!82 = distinct !DISubprogram(name: "BN_POOL_init", scope: !9, file: !9, line: 283, type: !83, isLocal: true, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!86 = !DILocalVariable(name: "p", arg: 1, scope: !82, file: !9, line: 283, type: !85)
!87 = !DILocation(line: 283, column: 35, scope: !82)
!88 = !DILocation(line: 285, column: 28, scope: !82)
!89 = !DILocation(line: 285, column: 31, scope: !82)
!90 = !DILocation(line: 285, column: 36, scope: !82)
!91 = !DILocation(line: 285, column: 15, scope: !82)
!92 = !DILocation(line: 285, column: 18, scope: !82)
!93 = !DILocation(line: 285, column: 26, scope: !82)
!94 = !DILocation(line: 285, column: 5, scope: !82)
!95 = !DILocation(line: 285, column: 8, scope: !82)
!96 = !DILocation(line: 285, column: 13, scope: !82)
!97 = !DILocation(line: 286, column: 15, scope: !82)
!98 = !DILocation(line: 286, column: 18, scope: !82)
!99 = !DILocation(line: 286, column: 23, scope: !82)
!100 = !DILocation(line: 286, column: 5, scope: !82)
!101 = !DILocation(line: 286, column: 8, scope: !82)
!102 = !DILocation(line: 286, column: 13, scope: !82)
!103 = !DILocation(line: 287, column: 1, scope: !82)
!104 = distinct !DISubprogram(name: "BN_STACK_init", scope: !9, file: !9, line: 239, type: !105, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!108 = !DILocalVariable(name: "st", arg: 1, scope: !104, file: !9, line: 239, type: !107)
!109 = !DILocation(line: 239, column: 37, scope: !104)
!110 = !DILocation(line: 241, column: 5, scope: !104)
!111 = !DILocation(line: 241, column: 9, scope: !104)
!112 = !DILocation(line: 241, column: 17, scope: !104)
!113 = !DILocation(line: 242, column: 17, scope: !104)
!114 = !DILocation(line: 242, column: 21, scope: !104)
!115 = !DILocation(line: 242, column: 26, scope: !104)
!116 = !DILocation(line: 242, column: 5, scope: !104)
!117 = !DILocation(line: 242, column: 9, scope: !104)
!118 = !DILocation(line: 242, column: 15, scope: !104)
!119 = !DILocation(line: 243, column: 1, scope: !104)
!120 = distinct !DISubprogram(name: "BN_CTX_secure_new", scope: !9, file: !9, line: 148, type: !10, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!121 = !DILocalVariable(name: "ret", scope: !120, file: !9, line: 150, type: !12)
!122 = !DILocation(line: 150, column: 13, scope: !120)
!123 = !DILocation(line: 150, column: 19, scope: !120)
