; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--rand--libcrypto-lib-drbg_hmac.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--rand--libcrypto-lib-drbg_hmac.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rand_drbg_st = type { i8*, %struct.rand_drbg_st*, i32, i32, i32, i16, %struct.rand_pool_st*, %struct.rand_pool_st*, i32, i64, i64, i64, i64, i64, i64, i64, i32, i32, i64, i64, i32, i32, i64, i32, %struct.crypto_ex_data_st, %union.anon, %struct.rand_drbg_method_st*, i64 (%struct.rand_drbg_st*, i8**, i32, i64, i64, i32)*, void (%struct.rand_drbg_st*, i8*, i64)*, i64 (%struct.rand_drbg_st*, i8**, i32, i64, i64)*, void (%struct.rand_drbg_st*, i8*, i64)* }
%struct.rand_pool_st = type { i8*, i64, i32, i64, i64, i64, i64 }
%struct.crypto_ex_data_st = type { %struct.stack_st_void* }
%struct.stack_st_void = type opaque
%union.anon = type { %struct.rand_drbg_hash_st }
%struct.rand_drbg_hash_st = type { %struct.evp_md_st*, %struct.evp_md_ctx_st*, i64, [111 x i8], [111 x i8], [111 x i8] }
%struct.evp_md_st = type opaque
%struct.evp_md_ctx_st = type opaque
%struct.rand_drbg_method_st = type { i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64)*, {}* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, globals: !12)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--rand--libcrypto-lib-drbg_hmac.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "drbg_status_e", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "crypto/rand/rand_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "DRBG_UNINITIALISED", value: 0)
!7 = !DIEnumerator(name: "DRBG_READY", value: 1)
!8 = !DIEnumerator(name: "DRBG_ERROR", value: 2)
!9 = !{!10, !11}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !{!13}
!13 = distinct !DIGlobalVariable(name: "drbg_hmac_meth", scope: !0, file: !14, line: 191, type: !15, isLocal: true, isDefinition: true, variable: { i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*, i8*, i64, i8*, i64)*, i32 (%struct.rand_drbg_st*)* }* @drbg_hmac_meth)
!14 = !DIFile(filename: "crypto/rand/drbg_hmac.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_METHOD", file: !4, line: 117, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_method_st", file: !4, line: 112, size: 256, align: 64, elements: !17)
!17 = !{!18, !175, !180, !185}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "instantiate", scope: !16, file: !4, line: 113, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_instantiate_fn", file: !4, line: 85, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!11, !23, !173, !46, !173, !46, !173, !46}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG", file: !25, line: 121, baseType: !26)
!25 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_st", file: !4, line: 184, size: 4544, align: 64, elements: !27)
!27 = !{!28, !32, !33, !34, !35, !36, !38, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !65, !66, !72, !73, !74, !75, !76, !78, !85, !152, !154, !161, !166, !171}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !26, file: !4, line: 185, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_RWLOCK", file: !31, line: 67, baseType: null)
!31 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!32 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !26, file: !4, line: 186, baseType: !23, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !26, file: !4, line: 187, baseType: !11, size: 32, align: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !4, line: 188, baseType: !11, size: 32, align: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "fork_count", scope: !26, file: !4, line: 195, baseType: !11, size: 32, align: 32, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !4, line: 196, baseType: !37, size: 16, align: 16, offset: 224)
!37 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "seed_pool", scope: !26, file: !4, line: 206, baseType: !39, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_pool_st", file: !4, line: 168, size: 448, align: 64, elements: !41)
!41 = !{!42, !45, !49, !50, !51, !52, !53}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !40, file: !4, line: 169, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !4, line: 170, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 216, baseType: !48)
!47 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!48 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "attached", scope: !40, file: !4, line: 172, baseType: !11, size: 32, align: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "min_len", scope: !40, file: !4, line: 174, baseType: !46, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !40, file: !4, line: 175, baseType: !46, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !40, file: !4, line: 176, baseType: !46, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_requested", scope: !40, file: !4, line: 177, baseType: !46, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "adin_pool", scope: !26, file: !4, line: 211, baseType: !39, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !26, file: !4, line: 233, baseType: !11, size: 32, align: 32, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "max_request", scope: !26, file: !4, line: 234, baseType: !46, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "min_entropylen", scope: !26, file: !4, line: 235, baseType: !46, size: 64, align: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "max_entropylen", scope: !26, file: !4, line: 235, baseType: !46, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "min_noncelen", scope: !26, file: !4, line: 236, baseType: !46, size: 64, align: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "max_noncelen", scope: !26, file: !4, line: 236, baseType: !46, size: 64, align: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "max_perslen", scope: !26, file: !4, line: 237, baseType: !46, size: 64, align: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "max_adinlen", scope: !26, file: !4, line: 237, baseType: !46, size: 64, align: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_gen_counter", scope: !26, file: !4, line: 244, baseType: !64, size: 32, align: 32, offset: 896)
!64 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_interval", scope: !26, file: !4, line: 249, baseType: !64, size: 32, align: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_time", scope: !26, file: !4, line: 251, baseType: !67, size: 64, align: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !68, line: 75, baseType: !69)
!68 = !DIFile(filename: "/usr/include/time.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !70, line: 139, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!71 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_time_interval", scope: !26, file: !4, line: 256, baseType: !67, size: 64, align: 64, offset: 1024)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_prop_counter", scope: !26, file: !4, line: 267, baseType: !64, size: 32, align: 32, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reseed_next_counter", scope: !26, file: !4, line: 268, baseType: !64, size: 32, align: 32, offset: 1120)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !26, file: !4, line: 270, baseType: !46, size: 64, align: 64, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !26, file: !4, line: 271, baseType: !77, size: 32, align: 32, offset: 1216)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "DRBG_STATUS", file: !4, line: 81, baseType: !3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !26, file: !4, line: 274, baseType: !79, size: 64, align: 64, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !25, line: 167, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !31, line: 86, size: 64, align: 64, elements: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !80, file: !31, line: 87, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !31, line: 87, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !26, file: !4, line: 281, baseType: !86, size: 2880, align: 64, offset: 1344)
!86 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !26, file: !4, line: 277, size: 2880, align: 64, elements: !87)
!87 = !{!88, !117, !137}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !86, file: !4, line: 278, baseType: !89, size: 1216, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_CTR", file: !4, line: 154, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_ctr_st", file: !4, line: 143, size: 1216, align: 64, elements: !91)
!91 = !{!92, !96, !97, !102, !103, !107, !111, !112, !113}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !90, file: !4, line: 144, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !25, line: 90, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !25, line: 90, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_df", scope: !90, file: !4, line: 145, baseType: !93, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !90, file: !4, line: 146, baseType: !98, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !25, line: 89, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !25, line: 89, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !90, file: !4, line: 147, baseType: !46, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !90, file: !4, line: 148, baseType: !104, size: 256, align: 8, offset: 256)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 256, align: 8, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !90, file: !4, line: 149, baseType: !108, size: 128, align: 8, offset: 512)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 16)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bltmp", scope: !90, file: !4, line: 151, baseType: !108, size: 128, align: 8, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "bltmp_pos", scope: !90, file: !4, line: 152, baseType: !46, size: 64, align: 64, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "KX", scope: !90, file: !4, line: 153, baseType: !114, size: 384, align: 8, offset: 832)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 384, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 48)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !86, file: !4, line: 279, baseType: !118, size: 2880, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_HASH", file: !4, line: 130, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_hash_st", file: !4, line: 122, size: 2880, align: 64, elements: !120)
!120 = !{!121, !126, !130, !131, !135, !136}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !119, file: !4, line: 123, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !25, line: 91, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_st", file: !25, line: 91, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !119, file: !4, line: 124, baseType: !127, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !25, line: 92, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_ctx_st", file: !25, line: 92, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "blocklen", scope: !119, file: !4, line: 125, baseType: !46, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !119, file: !4, line: 126, baseType: !132, size: 888, align: 8, offset: 192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 888, align: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 111)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !119, file: !4, line: 127, baseType: !132, size: 888, align: 8, offset: 1080)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "vtmp", scope: !119, file: !4, line: 129, baseType: !132, size: 888, align: 8, offset: 1968)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "hmac", scope: !86, file: !4, line: 280, baseType: !138, size: 1216, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_HMAC", file: !4, line: 138, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rand_drbg_hmac_st", file: !4, line: 132, size: 1216, align: 64, elements: !140)
!140 = !{!141, !142, !146, !147, !151}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !139, file: !4, line: 133, baseType: !122, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !139, file: !4, line: 134, baseType: !143, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMAC_CTX", file: !25, line: 106, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "hmac_ctx_st", file: !25, line: 106, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "blocklen", scope: !139, file: !4, line: 135, baseType: !46, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !139, file: !4, line: 136, baseType: !148, size: 512, align: 8, offset: 192)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 512, align: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !139, file: !4, line: 137, baseType: !148, size: 512, align: 8, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !26, file: !4, line: 284, baseType: !153, size: 64, align: 64, offset: 4224)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "get_entropy", scope: !26, file: !4, line: 287, baseType: !155, size: 64, align: 64, offset: 4288)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_get_entropy_fn", file: !156, line: 120, baseType: !157)
!156 = !DIFile(filename: "include/openssl/rand_drbg.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!46, !23, !160, !11, !46, !46, !11}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_entropy", scope: !26, file: !4, line: 288, baseType: !162, size: 64, align: 64, offset: 4352)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_cleanup_entropy_fn", file: !156, line: 125, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !23, !43, !46}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "get_nonce", scope: !26, file: !4, line: 289, baseType: !167, size: 64, align: 64, offset: 4416)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_get_nonce_fn", file: !156, line: 127, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!46, !23, !160, !11, !46, !46}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_nonce", scope: !26, file: !4, line: 290, baseType: !172, size: 64, align: 64, offset: 4480)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_cleanup_nonce_fn", file: !156, line: 130, baseType: !163)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "reseed", scope: !16, file: !4, line: 114, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_reseed_fn", file: !4, line: 93, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !23, !173, !46, !173, !46}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "generate", scope: !16, file: !4, line: 115, baseType: !181, size: 64, align: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_generate_fn", file: !4, line: 99, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!11, !23, !43, !46, !173, !46}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "uninstantiate", scope: !16, file: !4, line: 116, baseType: !186, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAND_DRBG_uninstantiate_fn", file: !4, line: 105, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!11, !23}
!190 = !{i32 2, !"Dwarf Version", i32 4}
!191 = !{i32 2, !"Debug Info Version", i32 3}
!192 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!193 = distinct !DISubprogram(name: "drbg_hmac_init", scope: !14, file: !14, line: 198, type: !188, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !194)
!194 = !{}
!195 = !DILocalVariable(name: "drbg", arg: 1, scope: !193, file: !14, line: 198, type: !23)
!196 = !DIExpression()
!197 = !DILocation(line: 198, column: 31, scope: !193)
!198 = !DILocalVariable(name: "md", scope: !193, file: !14, line: 200, type: !122)
!199 = !DILocation(line: 200, column: 19, scope: !193)
!200 = !DILocalVariable(name: "hmac", scope: !193, file: !14, line: 201, type: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!202 = !DILocation(line: 201, column: 21, scope: !193)
!203 = !DILocation(line: 201, column: 29, scope: !193)
!204 = !DILocation(line: 201, column: 35, scope: !193)
!205 = !DILocation(line: 201, column: 40, scope: !193)
!206 = !DILocation(line: 204, column: 42, scope: !193)
!207 = !DILocation(line: 204, column: 48, scope: !193)
!208 = !DILocation(line: 204, column: 31, scope: !193)
!209 = !DILocation(line: 204, column: 10, scope: !210)
!210 = !DILexicalBlockFile(scope: !193, file: !14, discriminator: 1)
!211 = !DILocation(line: 204, column: 8, scope: !193)
!212 = !DILocation(line: 205, column: 9, scope: !213)
!213 = distinct !DILexicalBlock(scope: !193, file: !14, line: 205, column: 9)
!214 = !DILocation(line: 205, column: 12, scope: !213)
!215 = !DILocation(line: 205, column: 9, scope: !193)
!216 = !DILocation(line: 206, column: 9, scope: !213)
!217 = !DILocation(line: 208, column: 5, scope: !193)
!218 = !DILocation(line: 208, column: 11, scope: !193)
!219 = !DILocation(line: 208, column: 16, scope: !193)
!220 = !DILocation(line: 210, column: 9, scope: !221)
!221 = distinct !DILexicalBlock(scope: !193, file: !14, line: 210, column: 9)
!222 = !DILocation(line: 210, column: 15, scope: !221)
!223 = !DILocation(line: 210, column: 19, scope: !221)
!224 = !DILocation(line: 210, column: 9, scope: !193)
!225 = !DILocation(line: 211, column: 21, scope: !226)
!226 = distinct !DILexicalBlock(scope: !221, file: !14, line: 210, column: 27)
!227 = !DILocation(line: 211, column: 9, scope: !226)
!228 = !DILocation(line: 211, column: 15, scope: !226)
!229 = !DILocation(line: 211, column: 19, scope: !226)
!230 = !DILocation(line: 212, column: 13, scope: !231)
!231 = distinct !DILexicalBlock(scope: !226, file: !14, line: 212, column: 13)
!232 = !DILocation(line: 212, column: 19, scope: !231)
!233 = !DILocation(line: 212, column: 23, scope: !231)
!234 = !DILocation(line: 212, column: 13, scope: !226)
!235 = !DILocation(line: 213, column: 13, scope: !231)
!236 = !DILocation(line: 214, column: 5, scope: !226)
!237 = !DILocation(line: 217, column: 16, scope: !193)
!238 = !DILocation(line: 217, column: 5, scope: !193)
!239 = !DILocation(line: 217, column: 11, scope: !193)
!240 = !DILocation(line: 217, column: 14, scope: !193)
!241 = !DILocation(line: 218, column: 34, scope: !193)
!242 = !DILocation(line: 218, column: 22, scope: !193)
!243 = !DILocation(line: 218, column: 5, scope: !193)
!244 = !DILocation(line: 218, column: 11, scope: !193)
!245 = !DILocation(line: 218, column: 20, scope: !193)
!246 = !DILocation(line: 220, column: 33, scope: !193)
!247 = !DILocation(line: 220, column: 39, scope: !193)
!248 = !DILocation(line: 220, column: 48, scope: !193)
!249 = !DILocation(line: 220, column: 27, scope: !193)
