; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_info.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_info.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, {}*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !161)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_info.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !129, !104, !130, !133, !134, !139, !147, !149, !150, !154, !155, !159}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ACCESS_DESCRIPTION", file: !6, line: 158, baseType: !7)
!6 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ACCESS_DESCRIPTION_st", file: !6, line: 155, size: 128, align: 64, elements: !8)
!8 = !{!9, !14}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !7, file: !6, line: 156, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !12, line: 60, baseType: !13)
!12 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !12, line: 60, flags: DIFlagFwdDecl)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !7, file: !6, line: 157, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !6, line: 153, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !6, line: 123, size: 128, align: 64, elements: !18)
!18 = !{!19, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !17, file: !6, line: 133, baseType: !20, size: 32, align: 32)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !17, file: !6, line: 152, baseType: !22, size: 64, align: 64, offset: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !17, file: !6, line: 134, size: 64, align: 64, elements: !23)
!23 = !{!24, !27, !107, !108, !109, !110, !114, !121, !122, !123, !124, !125, !126, !127, !128}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, file: !6, line: 135, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !22, file: !6, line: 136, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !6, line: 116, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !6, line: 113, size: 128, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !30, file: !6, line: 114, baseType: !10, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !30, file: !6, line: 115, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !36, line: 473, baseType: !37)
!36 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !36, line: 444, size: 128, align: 64, elements: !38)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !37, file: !36, line: 445, baseType: !20, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !36, line: 472, baseType: !41, size: 64, align: 64, offset: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !37, file: !36, line: 446, size: 64, align: 64, elements: !42)
!42 = !{!43, !44, !46, !58, !59, !62, !65, !68, !71, !74, !77, !80, !83, !86, !89, !92, !95, !98, !101, !102, !103}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !41, file: !36, line: 447, baseType: !25, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !41, file: !36, line: 448, baseType: !45, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !12, line: 56, baseType: !20)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !41, file: !36, line: 449, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !12, line: 55, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !36, line: 146, size: 192, align: 64, elements: !50)
!50 = !{!51, !52, !53, !56}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !49, file: !36, line: 147, baseType: !20, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !36, line: 148, baseType: !20, size: 32, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !49, file: !36, line: 149, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !36, line: 155, baseType: !57, size: 64, align: 64, offset: 128)
!57 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !41, file: !36, line: 450, baseType: !10, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !41, file: !36, line: 451, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !12, line: 40, baseType: !49)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !41, file: !36, line: 452, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !12, line: 41, baseType: !49)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !41, file: !36, line: 453, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !12, line: 42, baseType: !49)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !41, file: !36, line: 454, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !12, line: 43, baseType: !49)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !41, file: !36, line: 455, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !12, line: 44, baseType: !49)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !41, file: !36, line: 456, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !12, line: 45, baseType: !49)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !41, file: !36, line: 457, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !12, line: 46, baseType: !49)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !41, file: !36, line: 458, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !12, line: 47, baseType: !49)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !41, file: !36, line: 459, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !12, line: 49, baseType: !49)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !41, file: !36, line: 460, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !12, line: 48, baseType: !49)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !41, file: !36, line: 461, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !12, line: 50, baseType: !49)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !41, file: !36, line: 462, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !12, line: 52, baseType: !49)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !41, file: !36, line: 463, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !12, line: 53, baseType: !49)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !41, file: !36, line: 464, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !12, line: 54, baseType: !49)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !41, file: !36, line: 469, baseType: !47, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !41, file: !36, line: 470, baseType: !47, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !41, file: !36, line: 471, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !36, line: 213, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !36, line: 213, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !22, file: !6, line: 137, baseType: !78, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !22, file: !6, line: 138, baseType: !78, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !22, file: !6, line: 139, baseType: !34, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !22, file: !6, line: 140, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !12, line: 129, baseType: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !12, line: 129, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !22, file: !6, line: 141, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !6, line: 121, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !6, line: 118, size: 128, align: 64, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !117, file: !6, line: 119, baseType: !47, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !117, file: !6, line: 120, baseType: !47, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !22, file: !6, line: 142, baseType: !78, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !22, file: !6, line: 143, baseType: !69, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !22, file: !6, line: 144, baseType: !10, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !22, file: !6, line: 146, baseType: !69, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !22, file: !6, line: 147, baseType: !111, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !22, file: !6, line: 148, baseType: !78, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !22, file: !6, line: 150, baseType: !10, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !22, file: !6, line: 151, baseType: !34, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "AUTHORITY_INFO_ACCESS", file: !6, line: 160, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ACCESS_DESCRIPTION", file: !6, line: 160, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !137, line: 17, baseType: !138)
!137 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !137, line: 17, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !141, line: 28, baseType: !142)
!141 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 24, size: 192, align: 64, elements: !143)
!143 = !{!144, !145, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !142, file: !141, line: 25, baseType: !25, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !141, line: 26, baseType: !25, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !142, file: !141, line: 27, baseType: !25, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !141, line: 30, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !137, line: 20, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !133}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_compfunc", file: !137, line: 19, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!20, !159, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!161 = !{!162, !292, !293, !294, !295, !299}
!162 = distinct !DIGlobalVariable(name: "v3_info", scope: !0, file: !163, line: 28, type: !164, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_info)
!163 = !DIFile(filename: "crypto/x509v3/v3_info.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !6, line: 92, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !6, line: 49, size: 832, align: 64, elements: !167)
!167 = !{!168, !169, !170, !198, !203, !205, !213, !219, !226, !271, !276, !281, !289, !291}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !166, file: !6, line: 50, baseType: !20, size: 32, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !166, file: !6, line: 51, baseType: !20, size: 32, align: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !166, file: !6, line: 53, baseType: !171, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !36, line: 318, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !12, line: 62, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !176, line: 580, size: 448, align: 64, elements: !177)
!176 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!177 = !{!178, !179, !180, !194, !195, !196, !197}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !175, file: !176, line: 581, baseType: !26, size: 8, align: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !175, file: !176, line: 583, baseType: !57, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !175, file: !176, line: 584, baseType: !181, size: 64, align: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !36, line: 210, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !176, line: 468, size: 320, align: 64, elements: !185)
!185 = !{!186, !188, !189, !190, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !184, file: !176, line: 469, baseType: !187, size: 64, align: 64)
!187 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !184, file: !176, line: 470, baseType: !57, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !184, file: !176, line: 471, baseType: !187, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !184, file: !176, line: 472, baseType: !191, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !184, file: !176, line: 473, baseType: !171, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !175, file: !176, line: 586, baseType: !57, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !175, file: !176, line: 587, baseType: !159, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !175, file: !176, line: 588, baseType: !57, size: 64, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !175, file: !176, line: 589, baseType: !191, size: 64, align: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !166, file: !6, line: 55, baseType: !199, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !6, line: 28, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!133}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !166, file: !6, line: 56, baseType: !204, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !6, line: 29, baseType: !151)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !166, file: !6, line: 57, baseType: !206, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !6, line: 30, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!133, !133, !210, !57}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !166, file: !6, line: 58, baseType: !214, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !6, line: 31, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!20, !133, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !166, file: !6, line: 60, baseType: !220, size: 64, align: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !6, line: 38, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!25, !224, !133}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !166, file: !6, line: 61, baseType: !227, size: 64, align: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !6, line: 40, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!133, !224, !231, !191}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !6, line: 79, size: 448, align: 64, elements: !233)
!233 = !{!234, !235, !239, !240, !245, !249, !270}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !6, line: 82, baseType: !20, size: 32, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !232, file: !6, line: 83, baseType: !236, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !12, line: 124, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !12, line: 124, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !232, file: !6, line: 84, baseType: !236, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !232, file: !6, line: 85, baseType: !241, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !243, line: 93, baseType: !244)
!243 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !243, line: 93, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !232, file: !6, line: 86, baseType: !246, size: 64, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !12, line: 126, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !12, line: 126, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !232, file: !6, line: 87, baseType: !250, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !6, line: 76, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !6, line: 71, size: 256, align: 64, elements: !253)
!253 = !{!254, !258, !262, !266}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !252, file: !6, line: 72, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!25, !133, !191, !191}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !252, file: !6, line: 73, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!147, !133, !191}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !252, file: !6, line: 74, baseType: !263, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !133, !25}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !252, file: !6, line: 75, baseType: !267, size: 64, align: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !133, !147}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !232, file: !6, line: 88, baseType: !133, size: 64, align: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !166, file: !6, line: 63, baseType: !272, size: 64, align: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !6, line: 33, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!147, !224, !133, !147}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !166, file: !6, line: 64, baseType: !277, size: 64, align: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !6, line: 35, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!133, !224, !231, !147}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !166, file: !6, line: 66, baseType: !282, size: 64, align: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !6, line: 42, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!20, !224, !133, !286, !20}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !12, line: 79, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !12, line: 79, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !166, file: !6, line: 67, baseType: !290, size: 64, align: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !6, line: 44, baseType: !228)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !166, file: !6, line: 68, baseType: !133, size: 64, align: 64, offset: 768)
!292 = distinct !DIGlobalVariable(name: "v3_sinfo", scope: !0, file: !163, line: 38, type: !164, isLocal: false, isDefinition: true, variable: { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }* @v3_sinfo)
!293 = distinct !DIGlobalVariable(name: "ACCESS_DESCRIPTION_it", scope: !0, file: !163, line: 51, type: !173, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ACCESS_DESCRIPTION_it)
!294 = distinct !DIGlobalVariable(name: "AUTHORITY_INFO_ACCESS_it", scope: !0, file: !163, line: 57, type: !173, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @AUTHORITY_INFO_ACCESS_it)
!295 = distinct !DIGlobalVariable(name: "ACCESS_DESCRIPTION_seq_tt", scope: !0, file: !163, line: 48, type: !296, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @ACCESS_DESCRIPTION_seq_tt)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 640, align: 64, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = distinct !DIGlobalVariable(name: "AUTHORITY_INFO_ACCESS_item_tt", scope: !0, file: !163, line: 55, type: !182, isLocal: true, isDefinition: true, variable: %struct.ASN1_TEMPLATE_st* @AUTHORITY_INFO_ACCESS_item_tt)
!300 = !{i32 2, !"Dwarf Version", i32 4}
!301 = !{i32 2, !"Debug Info Version", i32 3}
!302 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!303 = distinct !DISubprogram(name: "i2v_AUTHORITY_INFO_ACCESS", scope: !163, file: !163, line: 61, type: !304, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!304 = !DISubroutineType(types: !305)
!305 = !{!147, !306, !130, !147}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!307 = !DILocalVariable(name: "method", arg: 1, scope: !303, file: !163, line: 62, type: !306)
!308 = !DIExpression()
!309 = !DILocation(line: 62, column: 24, scope: !303)
!310 = !DILocalVariable(name: "ainfo", arg: 2, scope: !303, file: !163, line: 62, type: !130)
!311 = !DILocation(line: 62, column: 55, scope: !303)
!312 = !DILocalVariable(name: "ret", arg: 3, scope: !303, file: !163, line: 63, type: !147)
!313 = !DILocation(line: 63, column: 33, scope: !303)
!314 = !DILocalVariable(name: "desc", scope: !303, file: !163, line: 65, type: !4)
!315 = !DILocation(line: 65, column: 25, scope: !303)
!316 = !DILocalVariable(name: "i", scope: !303, file: !163, line: 66, type: !20)
!317 = !DILocation(line: 66, column: 9, scope: !303)
!318 = !DILocalVariable(name: "nlen", scope: !303, file: !163, line: 66, type: !20)
!319 = !DILocation(line: 66, column: 12, scope: !303)
!320 = !DILocalVariable(name: "objtmp", scope: !303, file: !163, line: 67, type: !321)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 640, align: 8, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 80)
!324 = !DILocation(line: 67, column: 10, scope: !303)
!325 = !DILocalVariable(name: "ntmp", scope: !303, file: !163, line: 67, type: !25)
!326 = !DILocation(line: 67, column: 23, scope: !303)
!327 = !DILocalVariable(name: "vtmp", scope: !303, file: !163, line: 68, type: !139)
!328 = !DILocation(line: 68, column: 17, scope: !303)
!329 = !DILocalVariable(name: "tret", scope: !303, file: !163, line: 69, type: !147)
!330 = !DILocation(line: 69, column: 33, scope: !303)
!331 = !DILocation(line: 69, column: 40, scope: !303)
!332 = !DILocation(line: 71, column: 12, scope: !333)
