; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--conf--libcrypto-lib-conf_mod.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--conf--libcrypto-lib-conf_mod.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stack_st_CONF_MODULE = type opaque
%struct.stack_st_CONF_IMODULE = type opaque
%struct.conf_st = type { %struct.conf_method_st*, i8*, %struct.lhash_st_CONF_VALUE* }
%struct.conf_method_st = type { i8*, %struct.conf_st* (%struct.conf_method_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*)*, i32 (%struct.conf_st*, %struct.bio_st*, i64*)*, i32 (%struct.conf_st*, %struct.bio_st*)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8)*, i32 (%struct.conf_st*, i8*, i64*)* }
%struct.bio_st = type opaque
%struct.lhash_st_CONF_VALUE = type { %union.lh_CONF_VALUE_dummy }
%union.lh_CONF_VALUE_dummy = type { i8* }
%struct.stack_st_CONF_VALUE = type opaque
%struct.CONF_VALUE = type { i8*, i8*, i8* }
%struct.stack_st = type opaque
%struct.conf_module_st = type { %struct.dso_st*, i8*, i32 (%struct.conf_imodule_st*, %struct.conf_st*)*, void (%struct.conf_imodule_st*)*, i32, i8* }
%struct.dso_st = type opaque
%struct.conf_imodule_st = type { %struct.conf_module_st*, i8*, i8*, i64, i8* }
%struct.dso_meth_st = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18, globals: !136)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--conf--libcrypto-lib-conf_mod.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !20, !22, !23, !24, !25, !30, !38, !60, !129, !131, !132, !48, !42, !134}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !28, line: 17, baseType: !29)
!28 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !28, line: 17, flags: DIFlagFwdDecl)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !32, line: 28, baseType: !33)
!32 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 24, size: 192, align: 64, elements: !34)
!34 = !{!35, !36, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !33, file: !32, line: 25, baseType: !20, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !32, line: 26, baseType: !20, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !33, file: !32, line: 27, baseType: !20, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "conf_init_func", file: !32, line: 59, baseType: !40)
!40 = !DISubroutineType(types: !41)
!41 = !{!22, !42, !71}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_IMODULE", file: !32, line: 52, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_imodule_st", file: !45, line: 46, size: 320, align: 64, elements: !46)
!45 = !DIFile(filename: "crypto/conf/conf_mod.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!46 = !{!47, !66, !67, !68, !70}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pmod", scope: !44, file: !45, line: 47, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_MODULE", file: !32, line: 53, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_module_st", file: !45, line: 26, size: 384, align: 64, elements: !51)
!51 = !{!52, !57, !58, !59, !64, !65}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "dso", scope: !50, file: !45, line: 28, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSO", file: !55, line: 56, baseType: !56)
!55 = !DIFile(filename: "include/internal/dso.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "dso_st", file: !55, line: 56, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !45, line: 30, baseType: !20, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !50, file: !45, line: 32, baseType: !38, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !50, file: !45, line: 34, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "conf_finish_func", file: !32, line: 60, baseType: !62)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !42}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !50, file: !45, line: 36, baseType: !22, size: 32, align: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !50, file: !45, line: 37, baseType: !19, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !45, line: 48, baseType: !20, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !44, file: !45, line: 49, baseType: !20, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !45, line: 50, baseType: !69, size: 64, align: 64, offset: 192)
!69 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !44, file: !45, line: 51, baseType: !19, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !74, line: 144, baseType: !75)
!74 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !32, line: 103, size: 192, align: 64, elements: !76)
!76 = !{!77, !118, !119}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !75, file: !32, line: 104, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !32, line: 35, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !32, line: 37, size: 640, align: 64, elements: !81)
!81 = !{!82, !85, !90, !94, !95, !96, !105, !109, !113, !114}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !32, line: 38, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !80, file: !32, line: 39, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !78}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !80, file: !32, line: 40, baseType: !91, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!22, !89}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !80, file: !32, line: 41, baseType: !91, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !80, file: !32, line: 42, baseType: !91, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !80, file: !32, line: 43, baseType: !97, size: 64, align: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!22, !89, !100, !103}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !74, line: 79, baseType: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !74, line: 79, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !80, file: !32, line: 44, baseType: !106, size: 64, align: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!22, !71, !100}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !80, file: !32, line: 45, baseType: !110, size: 64, align: 64, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!22, !71, !21}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !80, file: !32, line: 46, baseType: !110, size: 64, align: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !80, file: !32, line: 47, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!22, !89, !83, !103}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !75, file: !32, line: 105, baseType: !19, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !75, file: !32, line: 106, baseType: !120, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !32, line: 31, size: 64, align: 64, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !121, file: !32, line: 31, baseType: !124, size: 64, align: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "lh_CONF_VALUE_dummy", file: !32, line: 31, size: 64, align: 64, elements: !125)
!125 = !{!126, !127, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !124, file: !32, line: 31, baseType: !19, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !124, file: !32, line: 31, baseType: !69, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !124, file: !32, line: 31, baseType: !22, size: 32, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_IMODULE", file: !32, line: 56, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_MODULE", file: !32, line: 55, flags: DIFlagFwdDecl)
!136 = !{!137, !138}
!137 = distinct !DIGlobalVariable(name: "supported_modules", scope: !0, file: !45, line: 54, type: !134, isLocal: true, isDefinition: true, variable: %struct.stack_st_CONF_MODULE** @supported_modules)
!138 = distinct !DIGlobalVariable(name: "initialized_modules", scope: !0, file: !45, line: 55, type: !129, isLocal: true, isDefinition: true, variable: %struct.stack_st_CONF_IMODULE** @initialized_modules)
!139 = !{i32 2, !"Dwarf Version", i32 4}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!142 = distinct !DISubprogram(name: "CONF_modules_load", scope: !45, file: !45, line: 72, type: !143, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{!22, !71, !83, !69}
!145 = !{}
!146 = !DILocalVariable(name: "cnf", arg: 1, scope: !142, file: !45, line: 72, type: !71)
!147 = !DIExpression()
!148 = !DILocation(line: 72, column: 35, scope: !142)
!149 = !DILocalVariable(name: "appname", arg: 2, scope: !142, file: !45, line: 72, type: !83)
!150 = !DILocation(line: 72, column: 52, scope: !142)
!151 = !DILocalVariable(name: "flags", arg: 3, scope: !142, file: !45, line: 73, type: !69)
!152 = !DILocation(line: 73, column: 37, scope: !142)
!153 = !DILocalVariable(name: "values", scope: !142, file: !45, line: 75, type: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !32, line: 30, flags: DIFlagFwdDecl)
!156 = !DILocation(line: 75, column: 33, scope: !142)
!157 = !DILocalVariable(name: "vl", scope: !142, file: !45, line: 76, type: !30)
!158 = !DILocation(line: 76, column: 17, scope: !142)
!159 = !DILocalVariable(name: "vsection", scope: !142, file: !45, line: 77, type: !20)
!160 = !DILocation(line: 77, column: 11, scope: !142)
!161 = !DILocalVariable(name: "ret", scope: !142, file: !45, line: 79, type: !22)
!162 = !DILocation(line: 79, column: 9, scope: !142)
!163 = !DILocalVariable(name: "i", scope: !142, file: !45, line: 79, type: !22)
!164 = !DILocation(line: 79, column: 14, scope: !142)
!165 = !DILocation(line: 81, column: 10, scope: !166)
