; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_lib.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_lib.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stack_st_X509V3_EXT_METHOD = type opaque
%struct.v3_ext_method = type { i32, i32, %struct.ASN1_ITEM_st*, i8* ()*, void (i8*)*, i8* (i8*, i8**, i64)*, i32 (i8*, i8**)*, i8* (%struct.v3_ext_method*, i8*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, %struct.stack_st_CONF_VALUE* (%struct.v3_ext_method*, i8*, %struct.stack_st_CONF_VALUE*)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, %struct.stack_st_CONF_VALUE*)*, i32 (%struct.v3_ext_method*, i8*, %struct.bio_st*, i32)*, i8* (%struct.v3_ext_method*, %struct.v3_ext_ctx*, i8*)*, i8* }
%struct.ASN1_ITEM_st = type opaque
%struct.stack_st_CONF_VALUE = type opaque
%struct.v3_ext_ctx = type { i32, %struct.x509_st*, %struct.x509_st*, %struct.X509_req_st*, %struct.X509_crl_st*, %struct.X509V3_CONF_METHOD_st*, i8* }
%struct.x509_st = type opaque
%struct.X509_req_st = type opaque
%struct.X509_crl_st = type opaque
%struct.X509V3_CONF_METHOD_st = type { i8* (i8*, i8*, i8*)*, %struct.stack_st_CONF_VALUE* (i8*, i8*)*, void (i8*, i8*)*, void (i8*, %struct.stack_st_CONF_VALUE*)* }
%struct.bio_st = type opaque
%struct.stack_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !151)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--x509v3--libcrypto-lib-v3_lib.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !5, !8, !16, !14, !19, !142, !143, !145, !146, !149}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509V3_EXT_METHOD", file: !7, line: 94, flags: DIFlagFwdDecl)
!7 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_compfunc", file: !9, line: 19, baseType: !10)
!9 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !14}
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !9, line: 17, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !9, line: 17, flags: DIFlagFwdDecl)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_METHOD", file: !7, line: 92, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_method", file: !7, line: 49, size: 832, align: 64, elements: !24)
!24 = !{!25, !26, !27, !35, !40, !45, !55, !62, !71, !121, !126, !131, !139, !141}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ext_nid", scope: !23, file: !7, line: 50, baseType: !13, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !23, file: !7, line: 51, baseType: !13, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !23, file: !7, line: 53, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !30, line: 318, baseType: !31)
!30 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !33, line: 62, baseType: !34)
!33 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !33, line: 62, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ext_new", scope: !23, file: !7, line: 55, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_NEW", file: !7, line: 28, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!4}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ext_free", scope: !23, file: !7, line: 56, baseType: !41, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_FREE", file: !7, line: 29, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !4}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "d2i", scope: !23, file: !7, line: 57, baseType: !46, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_D2I", file: !7, line: 30, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!4, !4, !50, !54}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "i2d", scope: !23, file: !7, line: 58, baseType: !56, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2D", file: !7, line: 31, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!13, !4, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "i2s", scope: !23, file: !7, line: 60, baseType: !63, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2S", file: !7, line: 38, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !69, !4}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "s2i", scope: !23, file: !7, line: 61, baseType: !72, size: 64, align: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_S2I", file: !7, line: 40, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!4, !69, !76, !103}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v3_ext_ctx", file: !7, line: 79, size: 448, align: 64, elements: !78)
!78 = !{!79, !80, !84, !85, !90, !94, !120}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !77, file: !7, line: 82, baseType: !13, size: 32, align: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_cert", scope: !77, file: !7, line: 83, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !33, line: 124, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !33, line: 124, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "subject_cert", scope: !77, file: !7, line: 84, baseType: !81, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "subject_req", scope: !77, file: !7, line: 85, baseType: !86, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !88, line: 93, baseType: !89)
!88 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !88, line: 93, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !77, file: !7, line: 86, baseType: !91, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !33, line: 126, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !33, line: 126, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "db_meth", scope: !77, file: !7, line: 87, baseType: !95, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_CONF_METHOD", file: !7, line: 76, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509V3_CONF_METHOD_st", file: !7, line: 71, size: 256, align: 64, elements: !98)
!98 = !{!99, !105, !112, !116}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "get_string", scope: !97, file: !7, line: 72, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!67, !4, !103, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "get_section", scope: !97, file: !7, line: 73, baseType: !106, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !4, !103}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_CONF_VALUE", file: !111, line: 30, flags: DIFlagFwdDecl)
!111 = !DIFile(filename: "include/openssl/conf.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "free_string", scope: !97, file: !7, line: 74, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !4, !67}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "free_section", scope: !97, file: !7, line: 75, baseType: !117, size: 64, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !4, !109}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !77, file: !7, line: 88, baseType: !4, size: 64, align: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i2v", scope: !23, file: !7, line: 63, baseType: !122, size: 64, align: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2V", file: !7, line: 33, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!109, !69, !4, !109}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v2i", scope: !23, file: !7, line: 64, baseType: !127, size: 64, align: 64, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_V2I", file: !7, line: 35, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!4, !69, !76, !109}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i2r", scope: !23, file: !7, line: 66, baseType: !132, size: 64, align: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_I2R", file: !7, line: 42, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!13, !69, !4, !136, !13}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !33, line: 79, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !33, line: 79, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "r2i", scope: !23, file: !7, line: 67, baseType: !140, size: 64, align: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509V3_EXT_R2I", file: !7, line: 44, baseType: !73)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "usr_data", scope: !23, file: !7, line: 68, baseType: !4, size: 64, align: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !9, line: 20, baseType: !42)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_EXTENSION", file: !88, line: 81, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_extension_st", file: !88, line: 81, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !88, line: 83, flags: DIFlagFwdDecl)
!151 = !{!152, !154}
!152 = distinct !DIGlobalVariable(name: "ext_list", scope: !0, file: !153, line: 19, type: !5, isLocal: true, isDefinition: true, variable: %struct.stack_st_X509V3_EXT_METHOD** @ext_list)
!153 = !DIFile(filename: "crypto/x509v3/v3_lib.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!154 = distinct !DIGlobalVariable(name: "standard_exts", scope: !0, file: !155, line: 15, type: !156, isLocal: true, isDefinition: true, variable: [47 x %struct.v3_ext_method*]* @standard_exts)
!155 = !DIFile(filename: "crypto/x509v3/standard_exts.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 3008, align: 64, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 47)
!159 = !{i32 2, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!162 = distinct !DISubprogram(name: "X509V3_EXT_add", scope: !153, file: !153, line: 25, type: !163, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!163 = !DISubroutineType(types: !164)
!164 = !{!13, !142}
!165 = !DILocalVariable(name: "ext", arg: 1, scope: !162, file: !153, line: 25, type: !142)
!166 = !DIExpression()
!167 = !DILocation(line: 25, column: 39, scope: !162)
!168 = !DILocation(line: 27, column: 9, scope: !169)
!169 = distinct !DILexicalBlock(scope: !162, file: !153, line: 27, column: 9)
!170 = !DILocation(line: 27, column: 18, scope: !169)
!171 = !DILocation(line: 28, column: 8, scope: !169)
!172 = !DILocation(line: 28, column: 23, scope: !173)
!173 = !DILexicalBlockFile(scope: !169, file: !153, discriminator: 1)
!174 = !DILocation(line: 28, column: 21, scope: !173)
!175 = !DILocation(line: 28, column: 58, scope: !173)
!176 = !DILocation(line: 27, column: 9, scope: !177)
!177 = !DILexicalBlockFile(scope: !162, file: !153, discriminator: 1)
!178 = !DILocation(line: 29, column: 9, scope: !179)
!179 = distinct !DILexicalBlock(scope: !169, file: !153, line: 28, column: 67)
!180 = !DILocation(line: 30, column: 9, scope: !179)
!181 = !DILocation(line: 32, column: 36, scope: !182)
!182 = distinct !DILexicalBlock(scope: !162, file: !153, line: 32, column: 9)
!183 = !DILocation(line: 32, column: 46, scope: !182)
!184 = !DILocation(line: 32, column: 10, scope: !182)
!185 = !DILocation(line: 32, column: 9, scope: !162)
!186 = !DILocation(line: 33, column: 9, scope: !187)
!187 = distinct !DILexicalBlock(scope: !182, file: !153, line: 32, column: 52)
!188 = !DILocation(line: 34, column: 9, scope: !187)
!189 = !DILocation(line: 36, column: 5, scope: !162)
!190 = !DILocation(line: 37, column: 1, scope: !162)
!191 = distinct !DISubprogram(name: "sk_X509V3_EXT_METHOD_new", scope: !7, file: !7, line: 94, type: !192, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!192 = !DISubroutineType(types: !193)
!193 = !{!5, !194}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_X509V3_EXT_METHOD_compfunc", file: !7, line: 94, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!13, !198, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!200 = !DILocalVariable(name: "compare", arg: 1, scope: !191, file: !7, line: 94, type: !194)
!201 = !DILocation(line: 94, column: 826, scope: !191)
!202 = !DILocation(line: 94, column: 917, scope: !191)
!203 = !DILocation(line: 94, column: 896, scope: !191)
!204 = !DILocation(line: 94, column: 881, scope: !191)
!205 = !DILocation(line: 94, column: 844, scope: !191)
!206 = !DILocation(line: 94, column: 837, scope: !191)
!207 = distinct !DISubprogram(name: "ext_cmp", scope: !153, file: !153, line: 39, type: !196, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!208 = !DILocalVariable(name: "a", arg: 1, scope: !207, file: !153, line: 39, type: !198)
!209 = !DILocation(line: 39, column: 52, scope: !207)
!210 = !DILocalVariable(name: "b", arg: 2, scope: !207, file: !153, line: 40, type: !198)
!211 = !DILocation(line: 40, column: 52, scope: !207)
!212 = !DILocation(line: 42, column: 15, scope: !207)
!213 = !DILocation(line: 42, column: 14, scope: !207)
!214 = !DILocation(line: 42, column: 19, scope: !207)
!215 = !DILocation(line: 42, column: 31, scope: !207)
!216 = !DILocation(line: 42, column: 30, scope: !207)
!217 = !DILocation(line: 42, column: 35, scope: !207)
!218 = !DILocation(line: 42, column: 27, scope: !207)
!219 = !DILocation(line: 42, column: 5, scope: !207)
!220 = distinct !DISubprogram(name: "sk_X509V3_EXT_METHOD_push", scope: !7, file: !7, line: 94, type: !221, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!221 = !DISubroutineType(types: !222)
!222 = !{!13, !5, !142}
!223 = !DILocalVariable(name: "sk", arg: 1, scope: !220, file: !7, line: 94, type: !5)
!224 = !DILocation(line: 94, column: 2394, scope: !220)
!225 = !DILocalVariable(name: "ptr", arg: 2, scope: !220, file: !7, line: 94, type: !142)
!226 = !DILocation(line: 94, column: 2417, scope: !220)
!227 = !DILocation(line: 94, column: 2464, scope: !220)
!228 = !DILocation(line: 94, column: 2447, scope: !220)
!229 = !DILocation(line: 94, column: 2482, scope: !220)
!230 = !DILocation(line: 94, column: 2468, scope: !220)
!231 = !DILocation(line: 94, column: 2431, scope: !220)
!232 = !DILocation(line: 94, column: 2424, scope: !220)
!233 = distinct !DISubprogram(name: "X509V3_EXT_get_nid", scope: !153, file: !153, line: 52, type: !234, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!234 = !DISubroutineType(types: !235)
!235 = !{!20, !13}
!236 = !DILocalVariable(name: "nid", arg: 1, scope: !233, file: !153, line: 52, type: !13)
!237 = !DILocation(line: 52, column: 49, scope: !233)
!238 = !DILocalVariable(name: "tmp", scope: !233, file: !153, line: 54, type: !22)
!239 = !DILocation(line: 54, column: 23, scope: !233)
!240 = !DILocalVariable(name: "t", scope: !233, file: !153, line: 55, type: !20)
!241 = !DILocation(line: 55, column: 30, scope: !233)
!242 = !DILocalVariable(name: "ret", scope: !233, file: !153, line: 55, type: !198)
!243 = !DILocation(line: 55, column: 48, scope: !233)
!244 = !DILocalVariable(name: "idx", scope: !233, file: !153, line: 56, type: !13)
!245 = !DILocation(line: 56, column: 9, scope: !233)
!246 = !DILocation(line: 58, column: 9, scope: !247)
!247 = distinct !DILexicalBlock(scope: !233, file: !153, line: 58, column: 9)
!248 = !DILocation(line: 58, column: 13, scope: !247)
!249 = !DILocation(line: 58, column: 9, scope: !233)
!250 = !DILocation(line: 59, column: 9, scope: !247)
!251 = !DILocation(line: 60, column: 19, scope: !233)
!252 = !DILocation(line: 60, column: 9, scope: !233)
!253 = !DILocation(line: 60, column: 17, scope: !233)
!254 = !DILocation(line: 61, column: 11, scope: !233)
!255 = !DILocation(line: 61, column: 9, scope: !233)
!256 = !DILocation(line: 62, column: 9, scope: !257)
!257 = distinct !DILexicalBlock(scope: !233, file: !153, line: 62, column: 9)
!258 = !DILocation(line: 62, column: 9, scope: !233)
!259 = !DILocation(line: 63, column: 17, scope: !257)
!260 = !DILocation(line: 63, column: 16, scope: !257)
!261 = !DILocation(line: 63, column: 9, scope: !257)
!262 = !DILocation(line: 64, column: 10, scope: !263)
!263 = distinct !DILexicalBlock(scope: !233, file: !153, line: 64, column: 9)
!264 = !DILocation(line: 64, column: 9, scope: !233)
!265 = !DILocation(line: 65, column: 9, scope: !263)
!266 = !DILocation(line: 66, column: 37, scope: !233)
!267 = !DILocation(line: 66, column: 11, scope: !233)
!268 = !DILocation(line: 66, column: 9, scope: !233)
!269 = !DILocation(line: 67, column: 39, scope: !233)
!270 = !DILocation(line: 67, column: 49, scope: !233)
!271 = !DILocation(line: 67, column: 12, scope: !233)
!272 = !DILocation(line: 67, column: 5, scope: !233)
!273 = !DILocation(line: 68, column: 1, scope: !233)
!274 = distinct !DISubprogram(name: "OBJ_bsearch_ext", scope: !153, file: !153, line: 47, type: !275, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!275 = !DISubroutineType(types: !276)
!276 = !{!19, !19, !198, !13}
!277 = !DILocalVariable(name: "key", arg: 1, scope: !274, file: !153, line: 47, type: !19)
!278 = !DILocation(line: 47, column: 251, scope: !274)
!279 = !DILocalVariable(name: "base", arg: 2, scope: !274, file: !153, line: 47, type: !198)
!280 = !DILocation(line: 47, column: 289, scope: !274)
!281 = !DILocalVariable(name: "num", arg: 3, scope: !274, file: !153, line: 47, type: !13)
!282 = !DILocation(line: 47, column: 299, scope: !274)
!283 = !DILocation(line: 47, column: 355, scope: !274)
!284 = !DILocation(line: 47, column: 360, scope: !274)
!285 = !DILocation(line: 47, column: 366, scope: !274)
!286 = !DILocation(line: 47, column: 342, scope: !274)
!287 = !DILocation(line: 47, column: 313, scope: !274)
!288 = !DILocation(line: 47, column: 306, scope: !274)
!289 = distinct !DISubprogram(name: "sk_X509V3_EXT_METHOD_find", scope: !7, file: !7, line: 94, type: !221, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!290 = !DILocalVariable(name: "sk", arg: 1, scope: !289, file: !7, line: 94, type: !5)
!291 = !DILocation(line: 94, column: 3875, scope: !289)
!292 = !DILocalVariable(name: "ptr", arg: 2, scope: !289, file: !7, line: 94, type: !142)
!293 = !DILocation(line: 94, column: 3898, scope: !289)
!294 = !DILocation(line: 94, column: 3945, scope: !289)
!295 = !DILocation(line: 94, column: 3928, scope: !289)
!296 = !DILocation(line: 94, column: 3963, scope: !289)
!297 = !DILocation(line: 94, column: 3949, scope: !289)
!298 = !DILocation(line: 94, column: 3912, scope: !289)
!299 = !DILocation(line: 94, column: 3905, scope: !289)
!300 = distinct !DISubprogram(name: "sk_X509V3_EXT_METHOD_value", scope: !7, file: !7, line: 94, type: !301, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!301 = !DISubroutineType(types: !302)
!302 = !{!142, !303, !13}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!305 = !DILocalVariable(name: "sk", arg: 1, scope: !300, file: !7, line: 94, type: !303)
!306 = !DILocation(line: 94, column: 603, scope: !300)
!307 = !DILocalVariable(name: "idx", arg: 2, scope: !300, file: !7, line: 94, type: !13)
!308 = !DILocation(line: 94, column: 611, scope: !300)
!309 = !DILocation(line: 94, column: 686, scope: !300)
!310 = !DILocation(line: 94, column: 663, scope: !300)
!311 = !DILocation(line: 94, column: 690, scope: !300)
!312 = !DILocation(line: 94, column: 646, scope: !300)
!313 = !DILocation(line: 94, column: 625, scope: !300)
!314 = !DILocation(line: 94, column: 618, scope: !300)
!315 = distinct !DISubprogram(name: "X509V3_EXT_get", scope: !153, file: !153, line: 70, type: !316, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!316 = !DISubroutineType(types: !317)
!317 = !{!20, !146}
!318 = !DILocalVariable(name: "ext", arg: 1, scope: !315, file: !153, line: 70, type: !146)
!319 = !DILocation(line: 70, column: 57, scope: !315)
!320 = !DILocalVariable(name: "nid", scope: !315, file: !153, line: 72, type: !13)
!321 = !DILocation(line: 72, column: 9, scope: !315)
!322 = !DILocation(line: 73, column: 54, scope: !323)
!323 = distinct !DILexicalBlock(scope: !315, file: !153, line: 73, column: 9)
!324 = !DILocation(line: 73, column: 28, scope: !323)
!325 = !DILocation(line: 73, column: 16, scope: !326)
!326 = !DILexicalBlockFile(scope: !323, file: !153, discriminator: 1)
!327 = !DILocation(line: 73, column: 14, scope: !323)
!328 = !DILocation(line: 73, column: 61, scope: !323)
!329 = !DILocation(line: 73, column: 9, scope: !315)
!330 = !DILocation(line: 74, column: 9, scope: !323)
!331 = !DILocation(line: 75, column: 31, scope: !315)
!332 = !DILocation(line: 75, column: 12, scope: !315)
!333 = !DILocation(line: 75, column: 5, scope: !315)
!334 = !DILocation(line: 76, column: 1, scope: !315)
!335 = distinct !DISubprogram(name: "X509V3_EXT_add_list", scope: !153, file: !153, line: 78, type: !163, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!336 = !DILocalVariable(name: "extlist", arg: 1, scope: !335, file: !153, line: 78, type: !142)
!337 = !DILocation(line: 78, column: 44, scope: !335)
!338 = !DILocation(line: 80, column: 5, scope: !335)
!339 = !DILocation(line: 80, column: 12, scope: !340)
!340 = !DILexicalBlockFile(scope: !341, file: !153, discriminator: 1)
!341 = distinct !DILexicalBlock(scope: !342, file: !153, line: 80, column: 5)
!342 = distinct !DILexicalBlock(scope: !335, file: !153, line: 80, column: 5)
!343 = !DILocation(line: 80, column: 21, scope: !340)
!344 = !DILocation(line: 80, column: 29, scope: !340)
!345 = !DILocation(line: 80, column: 5, scope: !340)
!346 = !DILocation(line: 81, column: 29, scope: !347)
!347 = distinct !DILexicalBlock(scope: !341, file: !153, line: 81, column: 13)
!348 = !DILocation(line: 81, column: 14, scope: !347)
!349 = !DILocation(line: 81, column: 13, scope: !341)
!350 = !DILocation(line: 82, column: 13, scope: !347)
!351 = !DILocation(line: 81, column: 36, scope: !352)
!352 = !DILexicalBlockFile(scope: !347, file: !153, discriminator: 1)
!353 = !DILocation(line: 80, column: 43, scope: !354)
!354 = !DILexicalBlockFile(scope: !341, file: !153, discriminator: 2)
!355 = !DILocation(line: 80, column: 5, scope: !354)
!356 = distinct !{!356, !338}
!357 = !DILocation(line: 83, column: 5, scope: !335)
!358 = !DILocation(line: 84, column: 1, scope: !335)
!359 = distinct !DISubprogram(name: "X509V3_EXT_add_alias", scope: !153, file: !153, line: 86, type: !360, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!360 = !DISubroutineType(types: !361)
!361 = !{!13, !13, !13}
!362 = !DILocalVariable(name: "nid_to", arg: 1, scope: !359, file: !153, line: 86, type: !13)
!363 = !DILocation(line: 86, column: 30, scope: !359)
!364 = !DILocalVariable(name: "nid_from", arg: 2, scope: !359, file: !153, line: 86, type: !13)
!365 = !DILocation(line: 86, column: 42, scope: !359)
!366 = !DILocalVariable(name: "ext", scope: !359, file: !153, line: 88, type: !20)
!367 = !DILocation(line: 88, column: 30, scope: !359)
!368 = !DILocalVariable(name: "tmpext", scope: !359, file: !153, line: 89, type: !142)
!369 = !DILocation(line: 89, column: 24, scope: !359)
!370 = !DILocation(line: 91, column: 35, scope: !371)
!371 = distinct !DILexicalBlock(scope: !359, file: !153, line: 91, column: 9)
!372 = !DILocation(line: 91, column: 16, scope: !371)
!373 = !DILocation(line: 91, column: 14, scope: !371)
!374 = !DILocation(line: 91, column: 46, scope: !371)
!375 = !DILocation(line: 91, column: 9, scope: !359)
!376 = !DILocation(line: 92, column: 9, scope: !377)
!377 = distinct !DILexicalBlock(scope: !371, file: !153, line: 91, column: 54)
!378 = !DILocation(line: 93, column: 9, scope: !377)
!379 = !DILocation(line: 95, column: 19, scope: !380)
!380 = distinct !DILexicalBlock(scope: !359, file: !153, line: 95, column: 9)
!381 = !DILocation(line: 95, column: 17, scope: !380)
!382 = !DILocation(line: 95, column: 81, scope: !380)
!383 = !DILocation(line: 95, column: 9, scope: !359)
!384 = !DILocation(line: 96, column: 9, scope: !385)
!385 = distinct !DILexicalBlock(scope: !380, file: !153, line: 95, column: 60)
!386 = !DILocation(line: 97, column: 9, scope: !385)
!387 = !DILocation(line: 99, column: 6, scope: !359)
!388 = !DILocation(line: 99, column: 16, scope: !359)
!389 = !DILocation(line: 99, column: 15, scope: !359)
!390 = !DILocation(line: 100, column: 23, scope: !359)
!391 = !DILocation(line: 100, column: 5, scope: !359)
!392 = !DILocation(line: 100, column: 13, scope: !359)
!393 = !DILocation(line: 100, column: 21, scope: !359)
!394 = !DILocation(line: 101, column: 5, scope: !359)
!395 = !DILocation(line: 101, column: 13, scope: !359)
!396 = !DILocation(line: 101, column: 23, scope: !359)
!397 = !DILocation(line: 102, column: 27, scope: !359)
!398 = !DILocation(line: 102, column: 12, scope: !359)
!399 = !DILocation(line: 102, column: 5, scope: !359)
!400 = !DILocation(line: 103, column: 1, scope: !359)
!401 = distinct !DISubprogram(name: "X509V3_EXT_cleanup", scope: !153, file: !153, line: 105, type: !402, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!402 = !DISubroutineType(types: !403)
!403 = !{null}
!404 = !DILocation(line: 107, column: 35, scope: !401)
!405 = !DILocation(line: 107, column: 5, scope: !401)
!406 = !DILocation(line: 108, column: 14, scope: !401)
!407 = !DILocation(line: 109, column: 1, scope: !401)
!408 = distinct !DISubprogram(name: "sk_X509V3_EXT_METHOD_pop_free", scope: !7, file: !7, line: 94, type: !409, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !5, !411}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_X509V3_EXT_METHOD_freefunc", file: !7, line: 94, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !142}
!415 = !DILocalVariable(name: "sk", arg: 1, scope: !408, file: !7, line: 94, type: !5)
!416 = !DILocation(line: 94, column: 3187, scope: !408)
!417 = !DILocalVariable(name: "freefunc", arg: 2, scope: !408, file: !7, line: 94, type: !411)
!418 = !DILocation(line: 94, column: 3221, scope: !408)
!419 = !DILocation(line: 94, column: 3270, scope: !408)
!420 = !DILocation(line: 94, column: 3253, scope: !408)
!421 = !DILocation(line: 94, column: 3295, scope: !408)
!422 = !DILocation(line: 94, column: 3274, scope: !408)
!423 = !DILocation(line: 94, column: 3233, scope: !408)
!424 = !DILocation(line: 94, column: 3306, scope: !408)
!425 = distinct !DISubprogram(name: "ext_list_free", scope: !153, file: !153, line: 111, type: !413, isLocal: true, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!426 = !DILocalVariable(name: "ext", arg: 1, scope: !425, file: !153, line: 111, type: !142)
!427 = !DILocation(line: 111, column: 46, scope: !425)
!428 = !DILocation(line: 113, column: 9, scope: !429)
!429 = distinct !DILexicalBlock(scope: !425, file: !153, line: 113, column: 9)
!430 = !DILocation(line: 113, column: 14, scope: !429)
!431 = !DILocation(line: 113, column: 24, scope: !429)
!432 = !DILocation(line: 113, column: 9, scope: !425)
!433 = !DILocation(line: 114, column: 21, scope: !429)
!434 = !DILocation(line: 114, column: 9, scope: !429)
!435 = !DILocation(line: 115, column: 1, scope: !425)
!436 = distinct !DISubprogram(name: "X509V3_add_standard_extensions", scope: !153, file: !153, line: 122, type: !437, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!437 = !DISubroutineType(types: !438)
!438 = !{!13}
!439 = !DILocation(line: 124, column: 5, scope: !436)
!440 = distinct !DISubprogram(name: "X509V3_EXT_d2i", scope: !153, file: !153, line: 129, type: !441, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!441 = !DISubroutineType(types: !442)
!442 = !{!4, !146}
!443 = !DILocalVariable(name: "ext", arg: 1, scope: !440, file: !153, line: 129, type: !146)
!444 = !DILocation(line: 129, column: 38, scope: !440)
!445 = !DILocalVariable(name: "method", scope: !440, file: !153, line: 131, type: !20)
!446 = !DILocation(line: 131, column: 30, scope: !440)
!447 = !DILocalVariable(name: "p", scope: !440, file: !153, line: 132, type: !51)
!448 = !DILocation(line: 132, column: 26, scope: !440)
!449 = !DILocalVariable(name: "extvalue", scope: !440, file: !153, line: 133, type: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !33, line: 55, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !30, line: 146, size: 192, align: 64, elements: !453)
!453 = !{!454, !455, !456, !457}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !452, file: !30, line: 147, baseType: !13, size: 32, align: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !30, line: 148, baseType: !13, size: 32, align: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !30, line: 149, baseType: !61, size: 64, align: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !452, file: !30, line: 155, baseType: !54, size: 64, align: 64, offset: 128)
!458 = !DILocation(line: 133, column: 18, scope: !440)
!459 = !DILocalVariable(name: "extlen", scope: !440, file: !153, line: 134, type: !13)
!460 = !DILocation(line: 134, column: 9, scope: !440)
!461 = !DILocation(line: 136, column: 34, scope: !462)
!462 = distinct !DILexicalBlock(scope: !440, file: !153, line: 136, column: 9)
!463 = !DILocation(line: 136, column: 19, scope: !462)
!464 = !DILocation(line: 136, column: 17, scope: !462)
!465 = !DILocation(line: 136, column: 40, scope: !462)
!466 = !DILocation(line: 136, column: 9, scope: !440)
!467 = !DILocation(line: 137, column: 9, scope: !462)
!468 = !DILocation(line: 138, column: 40, scope: !440)
!469 = !DILocation(line: 138, column: 16, scope: !440)
!470 = !DILocation(line: 138, column: 14, scope: !440)
!471 = !DILocation(line: 139, column: 31, scope: !440)
!472 = !DILocation(line: 139, column: 9, scope: !440)
!473 = !DILocation(line: 139, column: 7, scope: !440)
!474 = !DILocation(line: 140, column: 33, scope: !440)
!475 = !DILocation(line: 140, column: 14, scope: !440)
!476 = !DILocation(line: 140, column: 12, scope: !440)
!477 = !DILocation(line: 141, column: 9, scope: !478)
!478 = distinct !DILexicalBlock(scope: !440, file: !153, line: 141, column: 9)
!479 = !DILocation(line: 141, column: 17, scope: !478)
!480 = !DILocation(line: 141, column: 9, scope: !440)
!481 = !DILocation(line: 142, column: 39, scope: !478)
!482 = !DILocation(line: 142, column: 48, scope: !478)
!483 = !DILocation(line: 142, column: 56, scope: !478)
!484 = !DILocation(line: 142, column: 16, scope: !478)
!485 = !DILocation(line: 142, column: 9, scope: !478)
!486 = !DILocation(line: 143, column: 12, scope: !440)
!487 = !DILocation(line: 143, column: 20, scope: !440)
!488 = !DILocation(line: 143, column: 33, scope: !440)
!489 = !DILocation(line: 143, column: 5, scope: !440)
!490 = !DILocation(line: 144, column: 1, scope: !440)
!491 = distinct !DISubprogram(name: "X509V3_get_d2i", scope: !153, file: !153, line: 162, type: !492, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!492 = !DISubroutineType(types: !493)
!493 = !{!4, !494, !13, !496, !496}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!497 = !DILocalVariable(name: "x", arg: 1, scope: !491, file: !153, line: 162, type: !494)
!498 = !DILocation(line: 162, column: 60, scope: !491)
!499 = !DILocalVariable(name: "nid", arg: 2, scope: !491, file: !153, line: 162, type: !13)
!500 = !DILocation(line: 162, column: 67, scope: !491)
!501 = !DILocalVariable(name: "crit", arg: 3, scope: !491, file: !153, line: 162, type: !496)
!502 = !DILocation(line: 162, column: 77, scope: !491)
!503 = !DILocalVariable(name: "idx", arg: 4, scope: !491, file: !153, line: 163, type: !496)
!504 = !DILocation(line: 163, column: 27, scope: !491)
!505 = !DILocalVariable(name: "lastpos", scope: !491, file: !153, line: 165, type: !13)
!506 = !DILocation(line: 165, column: 9, scope: !491)
!507 = !DILocalVariable(name: "i", scope: !491, file: !153, line: 165, type: !13)
!508 = !DILocation(line: 165, column: 18, scope: !491)
!509 = !DILocalVariable(name: "ex", scope: !491, file: !153, line: 166, type: !146)
!510 = !DILocation(line: 166, column: 21, scope: !491)
!511 = !DILocalVariable(name: "found_ex", scope: !491, file: !153, line: 166, type: !146)
!512 = !DILocation(line: 166, column: 26, scope: !491)
!513 = !DILocation(line: 168, column: 10, scope: !514)
!514 = distinct !DILexicalBlock(scope: !491, file: !153, line: 168, column: 9)
!515 = !DILocation(line: 168, column: 9, scope: !491)
!516 = !DILocation(line: 169, column: 13, scope: !517)
