; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--modes--libcrypto-lib-ocb128.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--modes--libcrypto-lib-ocb128.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ocb128_context = type { void (i8*, i8*, i8*)*, void (i8*, i8*, i8*)*, i8*, i8*, void (i8*, i8*, i64, i8*, i64, i8*, [16 x i8]*, i8*)*, i64, i64, %union.OCB_BLOCK, %union.OCB_BLOCK, %union.OCB_BLOCK*, %struct.anon }
%union.OCB_BLOCK = type { [2 x i64] }
%struct.anon = type { i64, i64, %union.OCB_BLOCK, %union.OCB_BLOCK, %union.OCB_BLOCK, %union.OCB_BLOCK }

@.str = private unnamed_addr constant [22 x i8] c"crypto/modes/ocb128.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.ocb128_context* @CRYPTO_ocb128_new(i8* %keyenc, i8* %keydec, void (i8*, i8*, i8*)* %encrypt, void (i8*, i8*, i8*)* %decrypt, void (i8*, i8*, i64, i8*, i64, i8*, [16 x i8]*, i8*)* %stream) #0 !dbg !18 {
entry:
  %retval = alloca %struct.ocb128_context*, align 8
  %keyenc.addr = alloca i8*, align 8
  %keydec.addr = alloca i8*, align 8
  %encrypt.addr = alloca void (i8*, i8*, i8*)*, align 8
  %decrypt.addr = alloca void (i8*, i8*, i8*)*, align 8
  %stream.addr = alloca void (i8*, i8*, i64, i8*, i64, i8*, [16 x i8]*, i8*)*, align 8
  %octx = alloca %struct.ocb128_context*, align 8
  %ret = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--modes--libcrypto-lib-ocb128.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !5, !8, !14}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 216, baseType: !7)
!6 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!7 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, align: 8, elements: !12)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !{!13}
!13 = !DISubrange(count: 16)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!15 = !{i32 2, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!18 = distinct !DISubprogram(name: "CRYPTO_ocb128_new", scope: !19, file: !19, line: 130, type: !20, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!19 = !DIFile(filename: "crypto/modes/ocb128.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !4, !4, !29, !29, !40}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCB128_CONTEXT", file: !24, line: 174, baseType: !25)
!24 = !DIFile(filename: "include/openssl/modes.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocb128_context", file: !26, line: 167, size: 1408, align: 64, elements: !27)
!26 = !DIFile(filename: "crypto/modes/modes_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!27 = !{!28, !36, !37, !38, !39, !44, !45, !46, !58, !59, !61}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !25, file: !26, line: 169, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "block128_f", file: !24, line: 19, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33, !14, !34}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt", scope: !25, file: !26, line: 170, baseType: !29, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "keyenc", scope: !25, file: !26, line: 171, baseType: !4, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "keydec", scope: !25, file: !26, line: 172, baseType: !4, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !25, file: !26, line: 173, baseType: !40, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ocb128_f", file: !24, line: 176, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !33, !14, !5, !34, !5, !14, !8, !14}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "l_index", scope: !25, file: !26, line: 175, baseType: !5, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "max_l_index", scope: !25, file: !26, line: 176, baseType: !5, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "l_star", scope: !25, file: !26, line: 177, baseType: !47, size: 128, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCB_BLOCK", file: !26, line: 156, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !26, line: 153, size: 128, align: 64, elements: !49)
!49 = !{!50, !56}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !48, file: !26, line: 154, baseType: !51, size: 128, align: 64)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, align: 64, elements: !54)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !26, line: 22, baseType: !53)
!53 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!54 = !{!55}
!55 = !DISubrange(count: 2)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !48, file: !26, line: 155, baseType: !57, size: 128, align: 8)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 128, align: 8, elements: !12)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "l_dollar", scope: !25, file: !26, line: 178, baseType: !47, size: 128, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !25, file: !26, line: 179, baseType: !60, size: 64, align: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sess", scope: !25, file: !26, line: 188, baseType: !62, size: 640, align: 64, offset: 768)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !26, line: 181, size: 640, align: 64, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_hashed", scope: !62, file: !26, line: 182, baseType: !52, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_processed", scope: !62, file: !26, line: 183, baseType: !52, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "offset_aad", scope: !62, file: !26, line: 184, baseType: !47, size: 128, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !62, file: !26, line: 185, baseType: !47, size: 128, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !62, file: !26, line: 186, baseType: !47, size: 128, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !62, file: !26, line: 187, baseType: !47, size: 128, align: 64, offset: 512)
!70 = !DILocalVariable(name: "keyenc", arg: 1, scope: !18, file: !19, line: 130, type: !4)
!71 = !DIExpression()
!72 = !DILocation(line: 130, column: 41, scope: !18)
!73 = !DILocalVariable(name: "keydec", arg: 2, scope: !18, file: !19, line: 130, type: !4)
!74 = !DILocation(line: 130, column: 55, scope: !18)
!75 = !DILocalVariable(name: "encrypt", arg: 3, scope: !18, file: !19, line: 131, type: !29)
!76 = !DILocation(line: 131, column: 46, scope: !18)
!77 = !DILocalVariable(name: "decrypt", arg: 4, scope: !18, file: !19, line: 131, type: !29)
!78 = !DILocation(line: 131, column: 66, scope: !18)
!79 = !DILocalVariable(name: "stream", arg: 5, scope: !18, file: !19, line: 132, type: !40)
!80 = !DILocation(line: 132, column: 44, scope: !18)
!81 = !DILocalVariable(name: "octx", scope: !18, file: !19, line: 134, type: !22)
!82 = !DILocation(line: 134, column: 21, scope: !18)
!83 = !DILocalVariable(name: "ret", scope: !18, file: !19, line: 135, type: !84)
!84 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!85 = !DILocation(line: 135, column: 9, scope: !18)
!86 = !DILocation(line: 137, column: 17, scope: !87)
!87 = distinct !DILexicalBlock(scope: !18, file: !19, line: 137, column: 9)
!88 = !DILocation(line: 137, column: 15, scope: !87)
!89 = !DILocation(line: 137, column: 77, scope: !87)
!90 = !DILocation(line: 137, column: 9, scope: !18)
!91 = !DILocation(line: 138, column: 34, scope: !92)
!92 = distinct !DILexicalBlock(scope: !87, file: !19, line: 137, column: 56)
!93 = !DILocation(line: 138, column: 40, scope: !92)
!94 = !DILocation(line: 138, column: 48, scope: !92)
!95 = !DILocation(line: 138, column: 56, scope: !92)
!96 = !DILocation(line: 138, column: 65, scope: !92)
!97 = !DILocation(line: 139, column: 34, scope: !92)
!98 = !DILocation(line: 138, column: 15, scope: !92)
!99 = !DILocation(line: 138, column: 13, scope: !92)
!100 = !DILocation(line: 140, column: 13, scope: !101)
!101 = distinct !DILexicalBlock(scope: !92, file: !19, line: 140, column: 13)
!102 = !DILocation(line: 140, column: 13, scope: !92)
!103 = !DILocation(line: 141, column: 20, scope: !101)
!104 = !DILocation(line: 141, column: 13, scope: !101)
!105 = !DILocation(line: 142, column: 21, scope: !92)
!106 = !DILocation(line: 142, column: 9, scope: !92)
!107 = !DILocation(line: 143, column: 5, scope: !92)
!108 = !DILocation(line: 145, column: 5, scope: !18)
!109 = !DILocation(line: 146, column: 1, scope: !18)
!110 = distinct !DISubprogram(name: "CRYPTO_ocb128_init", scope: !19, file: !19, line: 151, type: !111, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!111 = !DISubroutineType(types: !112)
!112 = !{!84, !22, !4, !4, !29, !29, !40}
!113 = !DILocalVariable(name: "ctx", arg: 1, scope: !110, file: !19, line: 151, type: !22)
!114 = !DILocation(line: 151, column: 40, scope: !110)
!115 = !DILocalVariable(name: "keyenc", arg: 2, scope: !110, file: !19, line: 151, type: !4)
!116 = !DILocation(line: 151, column: 51, scope: !110)
!117 = !DILocalVariable(name: "keydec", arg: 3, scope: !110, file: !19, line: 151, type: !4)
!118 = !DILocation(line: 151, column: 65, scope: !110)
!119 = !DILocalVariable(name: "encrypt", arg: 4, scope: !110, file: !19, line: 152, type: !29)
!120 = !DILocation(line: 152, column: 35, scope: !110)
!121 = !DILocalVariable(name: "decrypt", arg: 5, scope: !110, file: !19, line: 152, type: !29)
!122 = !DILocation(line: 152, column: 55, scope: !110)
!123 = !DILocalVariable(name: "stream", arg: 6, scope: !110, file: !19, line: 153, type: !40)
!124 = !DILocation(line: 153, column: 33, scope: !110)
!125 = !DILocation(line: 155, column: 12, scope: !110)
!126 = !DILocation(line: 155, column: 5, scope: !110)
!127 = !DILocation(line: 156, column: 5, scope: !110)
!128 = !DILocation(line: 156, column: 10, scope: !110)
