; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ripemd--libcrypto-lib-rmd_dgst.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ripemd--libcrypto-lib-rmd_dgst.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RIPEMD160state_st = type { i32, i32, i32, i32, i32, i32, i32, [16 x i32], i32 }

; Function Attrs: nounwind uwtable
define i32 @RIPEMD160_Update(%struct.RIPEMD160state_st* %c, i8* %data_, i64 %len) #0 !dbg !11 {
entry:
  %retval = alloca i32, align 4
  %c.addr = alloca %struct.RIPEMD160state_st*, align 8
  %data_.addr = alloca i8*, align 8
  %len.addr = alloca i64, align 8
  %data = alloca i8*, align 8
  %p = alloca i8*, align 8
  %l = alloca i32, align 4
  %n = alloca i64, align 8
  store %struct.RIPEMD160state_st* %c, %struct.RIPEMD160state_st** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.RIPEMD160state_st** %c.addr, metadata !37, metadata !38), !dbg !39
  store i8* %data_, i8** %data_.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %data_.addr, metadata !40, metadata !38), !dbg !41
  store i64 %len, i64* %len.addr, align 8
  call void @llvm.dbg.declare(metadata i64* %len.addr, metadata !42, metadata !38), !dbg !43
  call void @llvm.dbg.declare(metadata i8** %data, metadata !44, metadata !38), !dbg !47
  %0 = load i8*, i8** %data_.addr, align 8, !dbg !48

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ripemd--libcrypto-lib-rmd_dgst.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!11 = distinct !DISubprogram(name: "RIPEMD160_Update", scope: !12, file: !12, line: 128, type: !13, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!12 = !DIFile(filename: "crypto/include/internal/md32_common.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16, !33, !35}
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "RIPEMD160_CTX", file: !18, line: 33, baseType: !19)
!18 = !DIFile(filename: "include/openssl/ripemd.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RIPEMD160state_st", file: !18, line: 28, size: 768, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !32}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !19, file: !18, line: 29, baseType: !4, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !19, file: !18, line: 29, baseType: !4, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !19, file: !18, line: 29, baseType: !4, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !19, file: !18, line: 29, baseType: !4, size: 32, align: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !19, file: !18, line: 29, baseType: !4, size: 32, align: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Nl", scope: !19, file: !18, line: 30, baseType: !4, size: 32, align: 32, offset: 160)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Nh", scope: !19, file: !18, line: 30, baseType: !4, size: 32, align: 32, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !18, line: 31, baseType: !29, size: 512, align: 32, offset: 224)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, align: 32, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 16)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !19, file: !18, line: 32, baseType: !4, size: 32, align: 32, offset: 736)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 216, baseType: !7)
!36 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!37 = !DILocalVariable(name: "c", arg: 1, scope: !11, file: !12, line: 128, type: !16)
!38 = !DIExpression()
!39 = !DILocation(line: 128, column: 37, scope: !11)
!40 = !DILocalVariable(name: "data_", arg: 2, scope: !11, file: !12, line: 128, type: !33)
!41 = !DILocation(line: 128, column: 52, scope: !11)
!42 = !DILocalVariable(name: "len", arg: 3, scope: !11, file: !12, line: 128, type: !35)
!43 = !DILocation(line: 128, column: 66, scope: !11)
!44 = !DILocalVariable(name: "data", scope: !11, file: !12, line: 130, type: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!47 = !DILocation(line: 130, column: 26, scope: !11)
!48 = !DILocation(line: 130, column: 33, scope: !11)
!49 = !DILocalVariable(name: "p", scope: !11, file: !12, line: 131, type: !5)
!50 = !DILocation(line: 131, column: 20, scope: !11)
!51 = !DILocalVariable(name: "l", scope: !11, file: !12, line: 132, type: !4)
!52 = !DILocation(line: 132, column: 18, scope: !11)
!53 = !DILocalVariable(name: "n", scope: !11, file: !12, line: 133, type: !35)
!54 = !DILocation(line: 133, column: 12, scope: !11)
!55 = !DILocation(line: 135, column: 9, scope: !56)
!56 = distinct !DILexicalBlock(scope: !11, file: !12, line: 135, column: 9)
!57 = !DILocation(line: 135, column: 13, scope: !56)
!58 = !DILocation(line: 135, column: 9, scope: !11)
!59 = !DILocation(line: 136, column: 9, scope: !56)
!60 = !DILocation(line: 138, column: 10, scope: !11)
!61 = !DILocation(line: 138, column: 13, scope: !11)
!62 = !DILocation(line: 138, column: 35, scope: !11)
!63 = !DILocation(line: 138, column: 20, scope: !11)
!64 = !DILocation(line: 138, column: 40, scope: !11)
!65 = !DILocation(line: 138, column: 16, scope: !11)
!66 = !DILocation(line: 138, column: 9, scope: !11)
!67 = !DILocation(line: 138, column: 47, scope: !11)
!68 = !DILocation(line: 138, column: 7, scope: !11)
!69 = !DILocation(line: 139, column: 9, scope: !70)
!70 = distinct !DILexicalBlock(scope: !11, file: !12, line: 139, column: 9)
!71 = !DILocation(line: 139, column: 13, scope: !70)
!72 = !DILocation(line: 139, column: 16, scope: !70)
!73 = !DILocation(line: 139, column: 11, scope: !70)
!74 = !DILocation(line: 139, column: 9, scope: !11)
!75 = !DILocation(line: 140, column: 9, scope: !70)
!76 = !DILocation(line: 140, column: 12, scope: !70)
!77 = !DILocation(line: 140, column: 14, scope: !70)
!78 = !DILocation(line: 141, column: 30, scope: !11)
!79 = !DILocation(line: 141, column: 34, scope: !11)
!80 = !DILocation(line: 141, column: 14, scope: !11)
!81 = !DILocation(line: 141, column: 5, scope: !11)
!82 = !DILocation(line: 141, column: 8, scope: !11)
!83 = !DILocation(line: 141, column: 11, scope: !11)
!84 = !DILocation(line: 143, column: 13, scope: !11)
!85 = !DILocation(line: 143, column: 5, scope: !11)
!86 = !DILocation(line: 143, column: 8, scope: !11)
!87 = !DILocation(line: 143, column: 11, scope: !11)
!88 = !DILocation(line: 145, column: 9, scope: !11)
!89 = !DILocation(line: 145, column: 12, scope: !11)
!90 = !DILocation(line: 145, column: 7, scope: !11)
!91 = !DILocation(line: 146, column: 9, scope: !92)
!92 = distinct !DILexicalBlock(scope: !11, file: !12, line: 146, column: 9)
!93 = !DILocation(line: 146, column: 11, scope: !92)
!94 = !DILocation(line: 146, column: 9, scope: !11)
!95 = !DILocation(line: 147, column: 30, scope: !96)
!96 = distinct !DILexicalBlock(scope: !92, file: !12, line: 146, column: 17)
