; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--async--libcrypto-lib-async.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--async--libcrypto-lib-async.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.async_ctx_st = type { %struct.async_fibre_st, %struct.async_job_st*, i32 }
%struct.async_fibre_st = type { %struct.ucontext, [1 x %struct.__jmp_buf_tag], i32 }
%struct.ucontext = type { i64, %struct.ucontext*, %struct.sigaltstack, %struct.mcontext_t, %struct.__sigset_t, %struct._libc_fpstate }
%struct.sigaltstack = type { i8*, i32, i64 }
%struct.mcontext_t = type { [23 x i64], %struct._libc_fpstate*, [8 x i64] }
%struct.__sigset_t = type { [16 x i64] }
%struct._libc_fpstate = type { i16, i16, i16, i16, i64, i64, i32, i32, [8 x %struct._libc_fpxreg], [16 x %struct._libc_xmmreg], [24 x i32] }
%struct._libc_fpxreg = type { [4 x i16], i16, [3 x i16] }
%struct._libc_xmmreg = type { [4 x i32] }
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.async_job_st = type { %struct.async_fibre_st, i32 (i8*)*, i8*, i32, i32, %struct.async_wait_ctx_st* }
%struct.async_wait_ctx_st = type { %struct.fd_lookup_st*, i64, i64, i32 (i8*)*, i8*, i32 }
%struct.fd_lookup_st = type { i8*, i32, i8*, void (%struct.async_wait_ctx_st*, i8*, i32, i8*)*, i32, i32, %struct.fd_lookup_st* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !178)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--async--libcrypto-lib-async.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !29, !161, !120, !170, !166, !174, !143}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "async_ctx", file: !6, line: 26, baseType: !7)
!6 = !DIFile(filename: "crypto/async/async_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "async_ctx_st", file: !6, line: 33, size: 9280, align: 64, elements: !8)
!8 = !{!9, !119, !160}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "dispatcher", scope: !7, file: !6, line: 34, baseType: !10, size: 9152, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "async_fibre", file: !11, line: 35, baseType: !12)
!11 = !DIFile(filename: "crypto/async/arch/async_posix.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "async_fibre_st", file: !11, line: 31, size: 9152, align: 64, elements: !13)
!13 = !{!14, !103, !118}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "fibre", scope: !12, file: !11, line: 32, baseType: !15, size: 7488, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucontext_t", file: !16, line: 141, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/ucontext.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ucontext", file: !16, line: 133, size: 7488, align: 64, elements: !18)
!18 = !{!19, !21, !23, !35, !95, !102}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "uc_flags", scope: !17, file: !16, line: 135, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "uc_link", scope: !17, file: !16, line: 136, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "uc_stack", scope: !17, file: !16, line: 137, baseType: !24, size: 192, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_t", file: !25, line: 54, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigstack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaltstack", file: !25, line: 49, size: 192, align: 64, elements: !27)
!27 = !{!28, !30, !32}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ss_sp", scope: !26, file: !25, line: 51, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ss_flags", scope: !26, file: !25, line: 52, baseType: !31, size: 32, align: 32, offset: 64)
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ss_size", scope: !26, file: !25, line: 53, baseType: !33, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 216, baseType: !20)
!34 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!35 = !DIDerivedType(tag: DW_TAG_member, name: "uc_mcontext", scope: !17, file: !16, line: 138, baseType: !36, size: 2048, align: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcontext_t", file: !16, line: 130, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 124, size: 2048, align: 64, elements: !38)
!38 = !{!39, !46, !92}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "gregs", scope: !37, file: !16, line: 126, baseType: !40, size: 1472, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "gregset_t", file: !16, line: 37, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1472, align: 64, elements: !44)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "greg_t", file: !16, line: 31, baseType: !43)
!43 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!44 = !{!45}
!45 = !DISubrange(count: 23)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fpregs", scope: !37, file: !16, line: 128, baseType: !47, size: 64, align: 64, offset: 1472)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpregset_t", file: !16, line: 121, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_libc_fpstate", file: !16, line: 104, size: 4096, align: 64, elements: !50)
!50 = !{!51, !55, !56, !57, !58, !60, !61, !64, !65, !80, !88}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !49, file: !16, line: 107, baseType: !52, size: 16, align: 16)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !53, line: 39, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!54 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "swd", scope: !49, file: !16, line: 108, baseType: !52, size: 16, align: 16, offset: 16)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ftw", scope: !49, file: !16, line: 109, baseType: !52, size: 16, align: 16, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "fop", scope: !49, file: !16, line: 110, baseType: !52, size: 16, align: 16, offset: 48)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "rip", scope: !49, file: !16, line: 111, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !53, line: 44, baseType: !20)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "rdp", scope: !49, file: !16, line: 112, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mxcsr", scope: !49, file: !16, line: 113, baseType: !62, size: 32, align: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !53, line: 41, baseType: !63)
!63 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mxcr_mask", scope: !49, file: !16, line: 114, baseType: !62, size: 32, align: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_st", scope: !49, file: !16, line: 115, baseType: !66, size: 1024, align: 16, offset: 256)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 1024, align: 16, elements: !78)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_libc_fpxreg", file: !16, line: 92, size: 128, align: 16, elements: !68)
!68 = !{!69, !73, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "significand", scope: !67, file: !16, line: 94, baseType: !70, size: 64, align: 16)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, align: 16, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 4)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !67, file: !16, line: 95, baseType: !54, size: 16, align: 16, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !67, file: !16, line: 96, baseType: !75, size: 48, align: 16, offset: 80)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 48, align: 16, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 3)
!78 = !{!79}
!79 = !DISubrange(count: 8)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_xmm", scope: !49, file: !16, line: 116, baseType: !81, size: 2048, align: 32, offset: 1280)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 2048, align: 32, elements: !86)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_libc_xmmreg", file: !16, line: 99, size: 128, align: 32, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !82, file: !16, line: 101, baseType: !85, size: 128, align: 32)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, align: 32, elements: !71)
!86 = !{!87}
!87 = !DISubrange(count: 16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !49, file: !16, line: 117, baseType: !89, size: 768, align: 32, offset: 3328)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 768, align: 32, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 24)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved1", scope: !37, file: !16, line: 129, baseType: !93, size: 512, align: 64, offset: 1536)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 512, align: 64, elements: !78)
!94 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "uc_sigmask", scope: !17, file: !16, line: 139, baseType: !96, size: 1024, align: 64, offset: 2368)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !97, line: 30, baseType: !98)
!97 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 27, size: 1024, align: 64, elements: !99)
!99 = !{!100}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !98, file: !97, line: 29, baseType: !101, size: 1024, align: 64)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, align: 64, elements: !86)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__fpregs_mem", scope: !17, file: !16, line: 140, baseType: !49, size: 4096, align: 64, offset: 3392)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !12, file: !11, line: 33, baseType: !104, size: 1600, align: 64, offset: 7488)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !105, line: 48, baseType: !106)
!105 = !DIFile(filename: "/usr/include/setjmp.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 1600, align: 64, elements: !116)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !105, line: 34, size: 1600, align: 64, elements: !108)
!108 = !{!109, !114, !115}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !107, file: !105, line: 40, baseType: !110, size: 512, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !111, line: 31, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 512, align: 64, elements: !78)
!113 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !107, file: !105, line: 41, baseType: !31, size: 32, align: 32, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !107, file: !105, line: 42, baseType: !96, size: 1024, align: 64, offset: 576)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "env_init", scope: !12, file: !11, line: 34, baseType: !31, size: 32, align: 32, offset: 9088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "currjob", scope: !7, file: !6, line: 35, baseType: !120, size: 64, align: 64, offset: 9152)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASYNC_JOB", file: !122, line: 32, baseType: !123)
!122 = !DIFile(filename: "include/openssl/async.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "async_job_st", file: !6, line: 39, size: 9408, align: 64, elements: !124)
!124 = !{!125, !126, !130, !131, !132, !133}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fibrectx", scope: !123, file: !6, line: 40, baseType: !10, size: 9152, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !123, file: !6, line: 41, baseType: !127, size: 64, align: 64, offset: 9152)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!31, !29}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "funcargs", scope: !123, file: !6, line: 42, baseType: !29, size: 64, align: 64, offset: 9216)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !123, file: !6, line: 43, baseType: !31, size: 32, align: 32, offset: 9280)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !123, file: !6, line: 44, baseType: !31, size: 32, align: 32, offset: 9312)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "waitctx", scope: !123, file: !6, line: 45, baseType: !134, size: 64, align: 64, offset: 9344)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASYNC_WAIT_CTX", file: !122, line: 33, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "async_wait_ctx_st", file: !6, line: 58, size: 384, align: 64, elements: !137)
!137 = !{!138, !154, !155, !156, !158, !159}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !136, file: !6, line: 59, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fd_lookup_st", file: !6, line: 48, size: 384, align: 64, elements: !141)
!141 = !{!142, !145, !146, !147, !151, !152, !153}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !140, file: !6, line: 49, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !140, file: !6, line: 50, baseType: !31, size: 32, align: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !140, file: !6, line: 51, baseType: !29, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !140, file: !6, line: 52, baseType: !148, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !134, !143, !31, !29}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !140, file: !6, line: 53, baseType: !31, size: 32, align: 32, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !140, file: !6, line: 54, baseType: !31, size: 32, align: 32, offset: 288)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !6, line: 55, baseType: !139, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "numadd", scope: !136, file: !6, line: 60, baseType: !33, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "numdel", scope: !136, file: !6, line: 61, baseType: !33, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !136, file: !6, line: 62, baseType: !157, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASYNC_callback_fn", file: !122, line: 34, baseType: !127)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "callback_arg", scope: !136, file: !6, line: 63, baseType: !29, size: 64, align: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !136, file: !6, line: 64, baseType: !31, size: 32, align: 32, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !7, file: !6, line: 36, baseType: !63, size: 32, align: 32, offset: 9216)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "async_pool", file: !6, line: 27, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "async_pool_st", file: !6, line: 69, size: 192, align: 64, elements: !164)
!164 = !{!165, !168, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !163, file: !6, line: 70, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASYNC_JOB", file: !6, line: 67, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "curr_size", scope: !163, file: !6, line: 71, baseType: !33, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !163, file: !6, line: 72, baseType: !33, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !172, line: 17, baseType: !173)
!172 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !172, line: 17, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_compfunc", file: !172, line: 19, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!31, !143, !143}
!178 = !{!179, !185}
!179 = distinct !DIGlobalVariable(name: "ctxkey", scope: !0, file: !180, line: 30, type: !181, isLocal: true, isDefinition: true, variable: i32* @ctxkey)
!180 = !DIFile(filename: "crypto/async/async.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_THREAD_LOCAL", file: !182, line: 430, baseType: !183)
!182 = !DIFile(filename: "include/openssl/crypto.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !184, line: 164, baseType: !63)
!184 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!185 = distinct !DIGlobalVariable(name: "poolkey", scope: !0, file: !180, line: 31, type: !181, isLocal: true, isDefinition: true, variable: i32* @poolkey)
!186 = !{i32 2, !"Dwarf Version", i32 4}
!187 = !{i32 2, !"Debug Info Version", i32 3}
!188 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!189 = distinct !DISubprogram(name: "async_get_ctx", scope: !180, file: !180, line: 59, type: !190, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!190 = !DISubroutineType(types: !191)
!191 = !{!4}
!192 = !DILocation(line: 61, column: 25, scope: !189)
!193 = !DILocation(line: 61, column: 12, scope: !189)
!194 = !DILocation(line: 61, column: 5, scope: !189)
!195 = distinct !DISubprogram(name: "async_start_func", scope: !180, file: !180, line: 144, type: !196, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!196 = !DISubroutineType(types: !197)
!197 = !{null}
!198 = !DILocalVariable(name: "job", scope: !195, file: !180, line: 146, type: !120)
!199 = !DIExpression()
!200 = !DILocation(line: 146, column: 16, scope: !195)
!201 = !DILocalVariable(name: "ctx", scope: !195, file: !180, line: 147, type: !4)
!202 = !DILocation(line: 147, column: 16, scope: !195)
!203 = !DILocation(line: 147, column: 22, scope: !195)
!204 = !DILocation(line: 149, column: 5, scope: !195)
!205 = !DILocation(line: 151, column: 15, scope: !206)
!206 = distinct !DILexicalBlock(scope: !195, file: !180, line: 149, column: 15)
!207 = !DILocation(line: 151, column: 20, scope: !206)
!208 = !DILocation(line: 151, column: 13, scope: !206)
!209 = !DILocation(line: 152, column: 20, scope: !206)
!210 = !DILocation(line: 152, column: 25, scope: !206)
!211 = !DILocation(line: 152, column: 30, scope: !206)
!212 = !DILocation(line: 152, column: 35, scope: !206)
!213 = !DILocation(line: 152, column: 9, scope: !206)
!214 = !DILocation(line: 152, column: 14, scope: !206)
!215 = !DILocation(line: 152, column: 18, scope: !206)
!216 = !DILocation(line: 155, column: 9, scope: !206)
!217 = !DILocation(line: 155, column: 14, scope: !206)
!218 = !DILocation(line: 155, column: 21, scope: !206)
!219 = !DILocation(line: 156, column: 39, scope: !220)
!220 = distinct !DILexicalBlock(scope: !206, file: !180, line: 156, column: 13)
