; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--pem--libcrypto-lib-pem_pk8.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--pem--libcrypto-lib-pem_pk8.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bio_st = type opaque
%struct.evp_pkey_st = type opaque
%struct.evp_cipher_st = type opaque
%struct.X509_sig_st = type opaque
%struct.pkcs8_priv_key_info_st = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [21 x i8] c"crypto/pem/pem_pk8.c\00", align 1
@.str.1 = private unnamed_addr constant [22 x i8] c"ENCRYPTED PRIVATE KEY\00", align 1
@.str.2 = private unnamed_addr constant [12 x i8] c"PRIVATE KEY\00", align 1

; Function Attrs: nounwind uwtable
define i32 @PEM_write_bio_PKCS8PrivateKey_nid(%struct.bio_st* %bp, %struct.evp_pkey_st* %x, i32 %nid, i8* %kstr, i32 %klen, i32 (i8*, i32, i32, i8*)* %cb, i8* %u) #0 !dbg !26 {
entry:
  %bp.addr = alloca %struct.bio_st*, align 8
  %x.addr = alloca %struct.evp_pkey_st*, align 8
  %nid.addr = alloca i32, align 4
  %kstr.addr = alloca i8*, align 8
  %klen.addr = alloca i32, align 4

!293 = !DILocation(line: 112, column: 55, scope: !286)
!294 = !DILocalVariable(name: "cb", arg: 3, scope: !286, file: !27, line: 112, type: !39)
!295 = !DILocation(line: 112, column: 75, scope: !286)
!296 = !DILocalVariable(name: "u", arg: 4, scope: !286, file: !27, line: 113, type: !4)
!297 = !DILocation(line: 113, column: 41, scope: !286)
!298 = !DILocalVariable(name: "p8inf", scope: !286, file: !27, line: 115, type: !100)
!299 = !DILocation(line: 115, column: 26, scope: !286)
!300 = !DILocalVariable(name: "p8", scope: !286, file: !27, line: 116, type: !94)
!301 = !DILocation(line: 116, column: 15, scope: !286)
!302 = !DILocalVariable(name: "klen", scope: !286, file: !27, line: 117, type: !20)
!303 = !DILocation(line: 117, column: 9, scope: !286)
!304 = !DILocalVariable(name: "ret", scope: !286, file: !27, line: 118, type: !34)
!305 = !DILocation(line: 118, column: 15, scope: !286)
!306 = !DILocalVariable(name: "psbuf", scope: !286, file: !27, line: 119, type: !105)
!307 = !DILocation(line: 119, column: 10, scope: !286)
!308 = !DILocation(line: 120, column: 24, scope: !286)
!309 = !DILocation(line: 120, column: 10, scope: !286)
!310 = !DILocation(line: 120, column: 8, scope: !286)
!311 = !DILocation(line: 121, column: 10, scope: !312)
!312 = distinct !DILexicalBlock(scope: !286, file: !27, line: 121, column: 9)
!313 = !DILocation(line: 121, column: 9, scope: !286)
!314 = !DILocation(line: 122, column: 9, scope: !312)
!315 = !DILocation(line: 123, column: 9, scope: !316)
!316 = distinct !DILexicalBlock(scope: !286, file: !27, line: 123, column: 9)
!317 = !DILocation(line: 123, column: 9, scope: !286)
!318 = !DILocation(line: 124, column: 16, scope: !316)
!319 = !DILocation(line: 124, column: 19, scope: !316)
!320 = !DILocation(line: 124, column: 35, scope: !316)
!321 = !DILocation(line: 124, column: 14, scope: !316)
!322 = !DILocation(line: 124, column: 9, scope: !316)
!323 = !DILocation(line: 126, column: 33, scope: !316)
!324 = !DILocation(line: 126, column: 49, scope: !316)
!325 = !DILocation(line: 126, column: 16, scope: !316)
!326 = !DILocation(line: 126, column: 14, scope: !316)
!327 = !DILocation(line: 127, column: 9, scope: !328)
!328 = distinct !DILexicalBlock(scope: !286, file: !27, line: 127, column: 9)
!329 = !DILocation(line: 127, column: 14, scope: !328)
!330 = !DILocation(line: 127, column: 9, scope: !286)
!331 = !DILocation(line: 128, column: 9, scope: !332)
!332 = distinct !DILexicalBlock(scope: !328, file: !27, line: 127, column: 19)
!333 = !DILocation(line: 129, column: 23, scope: !332)
!334 = !DILocation(line: 129, column: 9, scope: !332)
!335 = !DILocation(line: 130, column: 9, scope: !332)
!336 = !DILocation(line: 132, column: 27, scope: !286)
!337 = !DILocation(line: 132, column: 31, scope: !286)
!338 = !DILocation(line: 132, column: 38, scope: !286)
!339 = !DILocation(line: 132, column: 13, scope: !286)
!340 = !DILocation(line: 132, column: 11, scope: !286)
!341 = !DILocation(line: 133, column: 19, scope: !286)
!342 = !DILocation(line: 133, column: 5, scope: !286)
!343 = !DILocation(line: 134, column: 21, scope: !286)
!344 = !DILocation(line: 134, column: 28, scope: !286)
!345 = !DILocation(line: 134, column: 5, scope: !286)
!346 = !DILocation(line: 135, column: 10, scope: !347)
!347 = distinct !DILexicalBlock(scope: !286, file: !27, line: 135, column: 9)
!348 = !DILocation(line: 135, column: 9, scope: !286)
!349 = !DILocation(line: 136, column: 9, scope: !347)
!350 = !DILocation(line: 137, column: 26, scope: !286)
!351 = !DILocation(line: 137, column: 11, scope: !286)
!352 = !DILocation(line: 137, column: 9, scope: !286)
!353 = !DILocation(line: 138, column: 30, scope: !286)
!354 = !DILocation(line: 138, column: 5, scope: !286)
!355 = !DILocation(line: 139, column: 10, scope: !356)
!356 = distinct !DILexicalBlock(scope: !286, file: !27, line: 139, column: 9)
!357 = !DILocation(line: 139, column: 9, scope: !286)
!358 = !DILocation(line: 140, column: 9, scope: !356)
!359 = !DILocation(line: 141, column: 9, scope: !360)
!360 = distinct !DILexicalBlock(scope: !286, file: !27, line: 141, column: 9)
!361 = !DILocation(line: 141, column: 9, scope: !286)
!362 = !DILocation(line: 142, column: 24, scope: !363)
!363 = distinct !DILexicalBlock(scope: !360, file: !27, line: 141, column: 12)
!364 = !DILocation(line: 142, column: 23, scope: !363)
!365 = !DILocation(line: 142, column: 9, scope: !363)
!366 = !DILocation(line: 143, column: 14, scope: !363)
!367 = !DILocation(line: 143, column: 10, scope: !363)
!368 = !DILocation(line: 143, column: 12, scope: !363)
!369 = !DILocation(line: 144, column: 5, scope: !363)
!370 = !DILocation(line: 145, column: 12, scope: !286)
!371 = !DILocation(line: 145, column: 5, scope: !286)
!372 = !DILocation(line: 146, column: 1, scope: !286)
!373 = distinct !DISubprogram(name: "i2d_PKCS8PrivateKey_fp", scope: !27, file: !27, line: 150, type: !374, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!374 = !DISubroutineType(types: !375)
!375 = !{!20, !376, !34, !71, !37, !20, !39, !4}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !378, line: 48, baseType: !379)
!378 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !380, line: 241, size: 1728, align: 64, elements: !381)
!380 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !402, !403, !404, !405, !408, !410, !412, !416, !419, !421, !422, !423, !424, !425, !429, !430}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !379, file: !380, line: 242, baseType: !20, size: 32, align: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !379, file: !380, line: 247, baseType: !37, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !379, file: !380, line: 248, baseType: !37, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !379, file: !380, line: 249, baseType: !37, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !379, file: !380, line: 250, baseType: !37, size: 64, align: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !379, file: !380, line: 251, baseType: !37, size: 64, align: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !379, file: !380, line: 252, baseType: !37, size: 64, align: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !379, file: !380, line: 253, baseType: !37, size: 64, align: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !379, file: !380, line: 254, baseType: !37, size: 64, align: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !379, file: !380, line: 256, baseType: !37, size: 64, align: 64, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !379, file: !380, line: 257, baseType: !37, size: 64, align: 64, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !379, file: !380, line: 258, baseType: !37, size: 64, align: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !379, file: !380, line: 260, baseType: !395, size: 64, align: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !380, line: 156, size: 192, align: 64, elements: !397)
!397 = !{!398, !399, !401}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !396, file: !380, line: 157, baseType: !395, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !396, file: !380, line: 158, baseType: !400, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !396, file: !380, line: 162, baseType: !20, size: 32, align: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !379, file: !380, line: 262, baseType: !400, size: 64, align: 64, offset: 832)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !379, file: !380, line: 264, baseType: !20, size: 32, align: 32, offset: 896)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !379, file: !380, line: 268, baseType: !20, size: 32, align: 32, offset: 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !379, file: !380, line: 270, baseType: !406, size: 64, align: 64, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !407, line: 131, baseType: !15)
!407 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !379, file: !380, line: 274, baseType: !409, size: 16, align: 16, offset: 1024)
!409 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !379, file: !380, line: 275, baseType: !411, size: 8, align: 8, offset: 1040)
!411 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !379, file: !380, line: 276, baseType: !413, size: 8, align: 8, offset: 1048)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 1)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !379, file: !380, line: 280, baseType: !417, size: 64, align: 64, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !380, line: 150, baseType: null)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !379, file: !380, line: 289, baseType: !420, size: 64, align: 64, offset: 1152)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !407, line: 132, baseType: !15)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !379, file: !380, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !379, file: !380, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !379, file: !380, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !379, file: !380, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !379, file: !380, line: 302, baseType: !426, size: 64, align: 64, offset: 1472)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !427, line: 216, baseType: !428)
!427 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!428 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !379, file: !380, line: 303, baseType: !20, size: 32, align: 32, offset: 1536)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !379, file: !380, line: 305, baseType: !431, size: 160, align: 8, offset: 1568)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 20)
!434 = !DILocalVariable(name: "fp", arg: 1, scope: !373, file: !27, line: 150, type: !376)
!435 = !DILocation(line: 150, column: 34, scope: !373)
!436 = !DILocalVariable(name: "x", arg: 2, scope: !373, file: !27, line: 150, type: !34)
!437 = !DILocation(line: 150, column: 48, scope: !373)
!438 = !DILocalVariable(name: "enc", arg: 3, scope: !373, file: !27, line: 150, type: !71)
!439 = !DILocation(line: 150, column: 69, scope: !373)
!440 = !DILocalVariable(name: "kstr", arg: 4, scope: !373, file: !27, line: 151, type: !37)
!441 = !DILocation(line: 151, column: 34, scope: !373)
!442 = !DILocalVariable(name: "klen", arg: 5, scope: !373, file: !27, line: 151, type: !20)
!443 = !DILocation(line: 151, column: 44, scope: !373)
!444 = !DILocalVariable(name: "cb", arg: 6, scope: !373, file: !27, line: 151, type: !39)
!445 = !DILocation(line: 151, column: 67, scope: !373)
!446 = !DILocalVariable(name: "u", arg: 7, scope: !373, file: !27, line: 151, type: !4)
!447 = !DILocation(line: 151, column: 77, scope: !373)
!448 = !DILocation(line: 153, column: 26, scope: !373)
!449 = !DILocation(line: 153, column: 30, scope: !373)
!450 = !DILocation(line: 153, column: 40, scope: !373)
!451 = !DILocation(line: 153, column: 45, scope: !373)
!452 = !DILocation(line: 153, column: 51, scope: !373)
!453 = !DILocation(line: 153, column: 57, scope: !373)
!454 = !DILocation(line: 153, column: 61, scope: !373)
!455 = !DILocation(line: 153, column: 12, scope: !373)
!456 = !DILocation(line: 153, column: 5, scope: !373)
!457 = distinct !DISubprogram(name: "do_pk8pkey_fp", scope: !27, file: !27, line: 177, type: !458, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!458 = !DISubroutineType(types: !459)
!459 = !{!20, !376, !34, !20, !20, !71, !37, !20, !39, !4}
!460 = !DILocalVariable(name: "fp", arg: 1, scope: !457, file: !27, line: 177, type: !376)
!461 = !DILocation(line: 177, column: 32, scope: !457)
!462 = !DILocalVariable(name: "x", arg: 2, scope: !457, file: !27, line: 177, type: !34)
!463 = !DILocation(line: 177, column: 46, scope: !457)
!464 = !DILocalVariable(name: "isder", arg: 3, scope: !457, file: !27, line: 177, type: !20)
!465 = !DILocation(line: 177, column: 53, scope: !457)
!466 = !DILocalVariable(name: "nid", arg: 4, scope: !457, file: !27, line: 177, type: !20)
!467 = !DILocation(line: 177, column: 64, scope: !457)
!468 = !DILocalVariable(name: "enc", arg: 5, scope: !457, file: !27, line: 178, type: !71)
!469 = !DILocation(line: 178, column: 44, scope: !457)
!470 = !DILocalVariable(name: "kstr", arg: 6, scope: !457, file: !27, line: 178, type: !37)
!471 = !DILocation(line: 178, column: 55, scope: !457)
!472 = !DILocalVariable(name: "klen", arg: 7, scope: !457, file: !27, line: 178, type: !20)
!473 = !DILocation(line: 178, column: 65, scope: !457)
!474 = !DILocalVariable(name: "cb", arg: 8, scope: !457, file: !27, line: 179, type: !39)
!475 = !DILocation(line: 179, column: 43, scope: !457)
!476 = !DILocalVariable(name: "u", arg: 9, scope: !457, file: !27, line: 179, type: !4)
!477 = !DILocation(line: 179, column: 53, scope: !457)
!478 = !DILocalVariable(name: "bp", scope: !457, file: !27, line: 181, type: !30)
!479 = !DILocation(line: 181, column: 10, scope: !457)
!480 = !DILocalVariable(name: "ret", scope: !457, file: !27, line: 182, type: !20)
!481 = !DILocation(line: 182, column: 9, scope: !457)
!482 = !DILocation(line: 184, column: 26, scope: !483)
!483 = distinct !DILexicalBlock(scope: !457, file: !27, line: 184, column: 9)
!484 = !DILocation(line: 184, column: 15, scope: !483)
!485 = !DILocation(line: 184, column: 13, scope: !483)
!486 = !DILocation(line: 184, column: 37, scope: !483)
