; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ocsp--libcrypto-lib-ocsp_cl.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ocsp--libcrypto-lib-ocsp_cl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type opaque
%struct.ocsp_one_request_st = type { %struct.ocsp_cert_id_st*, %struct.stack_st_X509_EXTENSION* }
%struct.stack_st_X509_EXTENSION = type opaque
%struct.ocsp_request_st = type { %struct.ocsp_req_info_st, %struct.ocsp_signature_st* }
%struct.ocsp_req_info_st = type { %struct.asn1_string_st*, %struct.GENERAL_NAME_st*, %struct.stack_st_OCSP_ONEREQ*, %struct.stack_st_X509_EXTENSION* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.GENERAL_NAME_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.stack_st_OCSP_ONEREQ = type opaque
%struct.ocsp_signature_st = type { %struct.X509_algor_st, %struct.asn1_string_st*, %struct.stack_st_X509* }
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_object_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.stack_st_X509 = type opaque
%struct.ocsp_cert_id_st = type { %struct.X509_algor_st, %struct.asn1_string_st, %struct.asn1_string_st, %struct.asn1_string_st }
%struct.stack_st = type opaque
%struct.X509_name_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ocsp--libcrypto-lib-ocsp_cl.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !5, !9, !11, !14, !16, !20}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !7, line: 17, baseType: !8)
!7 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !7, line: 17, flags: DIFlagFwdDecl)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !13, line: 99, flags: DIFlagFwdDecl)
!13 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !18, line: 124, baseType: !19)
!18 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !18, line: 124, flags: DIFlagFwdDecl)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_SINGLERESP", file: !22, line: 104, baseType: !23)
!22 = !DIFile(filename: "include/openssl/ocsp.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_single_response_st", file: !24, line: 140, size: 320, align: 64, elements: !25)
!24 = !DIFile(filename: "crypto/ocsp/ocsp_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!25 = !{!26, !119, !139, !140, !141}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "certId", scope: !23, file: !24, line: 141, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_CERTID", file: !22, line: 71, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_cert_id_st", file: !24, line: 16, size: 704, align: 64, elements: !30)
!30 = !{!31, !116, !117, !118}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "hashAlgorithm", scope: !29, file: !24, line: 17, baseType: !32, size: 128, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !18, line: 125, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !13, line: 59, size: 128, align: 64, elements: !34)
!34 = !{!35, !39}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !33, file: !13, line: 60, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !18, line: 60, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !18, line: 60, flags: DIFlagFwdDecl)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !33, file: !13, line: 61, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !42, line: 473, baseType: !43)
!42 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !42, line: 444, size: 128, align: 64, elements: !44)
!44 = !{!45, !47}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !42, line: 445, baseType: !46, size: 32, align: 32)
!46 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !43, file: !42, line: 472, baseType: !48, size: 64, align: 64, offset: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !43, file: !42, line: 446, size: 64, align: 64, elements: !49)
!49 = !{!50, !53, !55, !67, !68, !71, !74, !77, !80, !83, !86, !89, !92, !95, !98, !101, !104, !107, !110, !111, !112}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !48, file: !42, line: 447, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !48, file: !42, line: 448, baseType: !54, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !18, line: 56, baseType: !46)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !48, file: !42, line: 449, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !18, line: 55, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !42, line: 146, size: 192, align: 64, elements: !59)
!59 = !{!60, !61, !62, !65}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !58, file: !42, line: 147, baseType: !46, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !42, line: 148, baseType: !46, size: 32, align: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !42, line: 149, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !42, line: 155, baseType: !66, size: 64, align: 64, offset: 128)
!66 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !48, file: !42, line: 450, baseType: !36, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !48, file: !42, line: 451, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !18, line: 40, baseType: !58)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !48, file: !42, line: 452, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !18, line: 41, baseType: !58)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !48, file: !42, line: 453, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !18, line: 42, baseType: !58)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !48, file: !42, line: 454, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !18, line: 43, baseType: !58)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !48, file: !42, line: 455, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !18, line: 44, baseType: !58)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !48, file: !42, line: 456, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !18, line: 45, baseType: !58)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !48, file: !42, line: 457, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !18, line: 46, baseType: !58)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !48, file: !42, line: 458, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !18, line: 47, baseType: !58)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !48, file: !42, line: 459, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !18, line: 49, baseType: !58)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !48, file: !42, line: 460, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !18, line: 48, baseType: !58)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !48, file: !42, line: 461, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !18, line: 50, baseType: !58)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !48, file: !42, line: 462, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !18, line: 52, baseType: !58)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !48, file: !42, line: 463, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !18, line: 53, baseType: !58)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !48, file: !42, line: 464, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !18, line: 54, baseType: !58)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !48, file: !42, line: 469, baseType: !56, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !48, file: !42, line: 470, baseType: !56, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !48, file: !42, line: 471, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !42, line: 213, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !42, line: 213, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "issuerNameHash", scope: !29, file: !24, line: 18, baseType: !79, size: 192, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "issuerKeyHash", scope: !29, file: !24, line: 19, baseType: !79, size: 192, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !29, file: !24, line: 20, baseType: !70, size: 192, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "certStatus", scope: !23, file: !24, line: 142, baseType: !120, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_CERTSTATUS", file: !22, line: 103, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_cert_status_st", file: !24, line: 124, size: 128, align: 64, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !122, file: !24, line: 125, baseType: !46, size: 32, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !122, file: !24, line: 130, baseType: !126, size: 64, align: 64, offset: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !122, file: !24, line: 126, size: 64, align: 64, elements: !127)
!127 = !{!128, !131, !138}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "good", scope: !126, file: !24, line: 127, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_NULL", file: !18, line: 57, baseType: !46)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "revoked", scope: !126, file: !24, line: 128, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_REVOKEDINFO", file: !22, line: 97, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_revoked_info_st", file: !24, line: 114, size: 128, align: 64, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "revocationTime", scope: !134, file: !24, line: 115, baseType: !102, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "revocationReason", scope: !134, file: !24, line: 116, baseType: !72, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "unknown", scope: !126, file: !24, line: 129, baseType: !129, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "thisUpdate", scope: !23, file: !24, line: 143, baseType: !102, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nextUpdate", scope: !23, file: !24, line: 144, baseType: !102, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "singleExtensions", scope: !23, file: !24, line: 145, baseType: !142, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !13, line: 83, flags: DIFlagFwdDecl)
!144 = !{i32 2, !"Dwarf Version", i32 4}
!145 = !{i32 2, !"Debug Info Version", i32 3}
!146 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!147 = distinct !DISubprogram(name: "OCSP_request_add0_id", scope: !148, file: !148, line: 31, type: !149, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!148 = !DIFile(filename: "crypto/ocsp/ocsp_cl.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !157, !27}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_ONEREQ", file: !22, line: 75, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_one_request_st", file: !24, line: 27, size: 128, align: 64, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reqCert", scope: !153, file: !24, line: 28, baseType: !27, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "singleRequestExtensions", scope: !153, file: !24, line: 29, baseType: !142, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_REQUEST", file: !22, line: 81, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_request_st", file: !24, line: 60, size: 320, align: 64, elements: !160)
!160 = !{!161, !210}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tbsRequest", scope: !159, file: !24, line: 61, baseType: !162, size: 256, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_REQINFO", file: !22, line: 79, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_req_info_st", file: !24, line: 38, size: 256, align: 64, elements: !164)
!164 = !{!165, !166, !206, !209}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !163, file: !24, line: 39, baseType: !69, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "requestorName", scope: !163, file: !24, line: 40, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !169, line: 153, baseType: !170)
!169 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !169, line: 123, size: 128, align: 64, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 133, baseType: !46, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !170, file: !169, line: 152, baseType: !174, size: 64, align: 64, offset: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 134, size: 64, align: 64, elements: !175)
!175 = !{!176, !177, !184, !185, !186, !187, !191, !198, !199, !200, !201, !202, !203, !204, !205}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !174, file: !169, line: 135, baseType: !51, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !174, file: !169, line: 136, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !169, line: 116, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !169, line: 113, size: 128, align: 64, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !180, file: !169, line: 114, baseType: !36, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !180, file: !169, line: 115, baseType: !40, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !174, file: !169, line: 137, baseType: !87, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !174, file: !169, line: 138, baseType: !87, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !174, file: !169, line: 139, baseType: !40, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !174, file: !169, line: 140, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !18, line: 129, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !18, line: 129, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !174, file: !169, line: 141, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !169, line: 121, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !169, line: 118, size: 128, align: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !194, file: !169, line: 119, baseType: !56, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !194, file: !169, line: 120, baseType: !56, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !174, file: !169, line: 142, baseType: !87, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !174, file: !169, line: 143, baseType: !78, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !174, file: !169, line: 144, baseType: !36, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !174, file: !169, line: 146, baseType: !78, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !174, file: !169, line: 147, baseType: !188, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !174, file: !169, line: 148, baseType: !87, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !174, file: !169, line: 150, baseType: !36, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !174, file: !169, line: 151, baseType: !40, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "requestList", scope: !163, file: !24, line: 41, baseType: !207, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_OCSP_ONEREQ", file: !22, line: 77, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "requestExtensions", scope: !163, file: !24, line: 42, baseType: !142, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "optionalSignature", scope: !159, file: !24, line: 62, baseType: !211, size: 64, align: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_SIGNATURE", file: !22, line: 80, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_signature_st", file: !24, line: 50, size: 256, align: 64, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "signatureAlgorithm", scope: !213, file: !24, line: 51, baseType: !32, size: 128, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !213, file: !24, line: 52, baseType: !75, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !213, file: !24, line: 53, baseType: !11, size: 64, align: 64, offset: 192)
!218 = !DILocalVariable(name: "req", arg: 1, scope: !147, file: !148, line: 31, type: !157)
!219 = !DIExpression()
!220 = !DILocation(line: 31, column: 49, scope: !147)
!221 = !DILocalVariable(name: "cid", arg: 2, scope: !147, file: !148, line: 31, type: !27)
!222 = !DILocation(line: 31, column: 67, scope: !147)
!223 = !DILocalVariable(name: "one", scope: !147, file: !148, line: 33, type: !151)
!224 = !DILocation(line: 33, column: 18, scope: !147)
!225 = !DILocation(line: 35, column: 16, scope: !226)
!226 = distinct !DILexicalBlock(scope: !147, file: !148, line: 35, column: 9)
!227 = !DILocation(line: 35, column: 14, scope: !226)
!228 = !DILocation(line: 35, column: 35, scope: !226)
!229 = !DILocation(line: 35, column: 9, scope: !147)
!230 = !DILocation(line: 36, column: 9, scope: !226)
!231 = !DILocation(line: 37, column: 22, scope: !147)
!232 = !DILocation(line: 37, column: 27, scope: !147)
!233 = !DILocation(line: 37, column: 5, scope: !147)
!234 = !DILocation(line: 38, column: 20, scope: !147)
!235 = !DILocation(line: 38, column: 5, scope: !147)
!236 = !DILocation(line: 38, column: 10, scope: !147)
!237 = !DILocation(line: 38, column: 18, scope: !147)
!238 = !DILocation(line: 39, column: 9, scope: !239)
!239 = distinct !DILexicalBlock(scope: !147, file: !148, line: 39, column: 9)
!240 = !DILocation(line: 39, column: 13, scope: !239)
!241 = !DILocation(line: 39, column: 37, scope: !242)
!242 = !DILexicalBlockFile(scope: !239, file: !148, discriminator: 1)
!243 = !DILocation(line: 39, column: 42, scope: !242)
!244 = !DILocation(line: 39, column: 53, scope: !242)
!245 = !DILocation(line: 39, column: 66, scope: !242)
!246 = !DILocation(line: 39, column: 17, scope: !242)
!247 = !DILocation(line: 39, column: 9, scope: !242)
!248 = !DILocation(line: 40, column: 9, scope: !249)
!249 = distinct !DILexicalBlock(scope: !239, file: !148, line: 39, column: 72)
!250 = !DILocation(line: 40, column: 14, scope: !249)
!251 = !DILocation(line: 40, column: 22, scope: !249)
!252 = !DILocation(line: 41, column: 9, scope: !249)
!253 = !DILocation(line: 43, column: 12, scope: !147)
!254 = !DILocation(line: 43, column: 5, scope: !147)
!255 = !DILocation(line: 45, column: 22, scope: !147)
!256 = !DILocation(line: 45, column: 5, scope: !147)
!257 = !DILocation(line: 46, column: 5, scope: !147)
!258 = !DILocation(line: 47, column: 1, scope: !147)
!259 = distinct !DISubprogram(name: "sk_OCSP_ONEREQ_push", scope: !22, file: !22, line: 77, type: !260, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!260 = !DISubroutineType(types: !261)
!261 = !{!46, !207, !151}
!262 = !DILocalVariable(name: "sk", arg: 1, scope: !259, file: !22, line: 77, type: !207)
!263 = !DILocation(line: 77, column: 2136, scope: !259)
!264 = !DILocalVariable(name: "ptr", arg: 2, scope: !259, file: !22, line: 77, type: !151)
!265 = !DILocation(line: 77, column: 2153, scope: !259)
!266 = !DILocation(line: 77, column: 2200, scope: !259)
!267 = !DILocation(line: 77, column: 2183, scope: !259)
!268 = !DILocation(line: 77, column: 2218, scope: !259)
!269 = !DILocation(line: 77, column: 2204, scope: !259)
!270 = !DILocation(line: 77, column: 2167, scope: !259)
!271 = !DILocation(line: 77, column: 2160, scope: !259)
!272 = distinct !DISubprogram(name: "OCSP_request_set1_name", scope: !148, file: !148, line: 51, type: !273, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!273 = !DISubroutineType(types: !274)
!274 = !{!46, !157, !188}
!275 = !DILocalVariable(name: "req", arg: 1, scope: !272, file: !148, line: 51, type: !157)
!276 = !DILocation(line: 51, column: 42, scope: !272)
!277 = !DILocalVariable(name: "nm", arg: 2, scope: !272, file: !148, line: 51, type: !188)
!278 = !DILocation(line: 51, column: 58, scope: !272)
!279 = !DILocalVariable(name: "gen", scope: !272, file: !148, line: 53, type: !167)
!280 = !DILocation(line: 53, column: 19, scope: !272)
!281 = !DILocation(line: 55, column: 11, scope: !272)
!282 = !DILocation(line: 55, column: 9, scope: !272)
!283 = !DILocation(line: 56, column: 9, scope: !284)
!284 = distinct !DILexicalBlock(scope: !272, file: !148, line: 56, column: 9)
!285 = !DILocation(line: 56, column: 13, scope: !284)
!286 = !DILocation(line: 56, column: 9, scope: !272)
!287 = !DILocation(line: 57, column: 9, scope: !284)
!288 = !DILocation(line: 58, column: 25, scope: !289)
!289 = distinct !DILexicalBlock(scope: !272, file: !148, line: 58, column: 9)
!290 = !DILocation(line: 58, column: 30, scope: !289)
!291 = !DILocation(line: 58, column: 32, scope: !289)
!292 = !DILocation(line: 58, column: 47, scope: !289)
!293 = !DILocation(line: 58, column: 10, scope: !289)
!294 = !DILocation(line: 58, column: 9, scope: !272)
!295 = !DILocation(line: 59, column: 27, scope: !296)
!296 = distinct !DILexicalBlock(scope: !289, file: !148, line: 58, column: 52)
!297 = !DILocation(line: 59, column: 9, scope: !296)
!298 = !DILocation(line: 60, column: 9, scope: !296)
!299 = !DILocation(line: 62, column: 5, scope: !272)
!300 = !DILocation(line: 62, column: 10, scope: !272)
!301 = !DILocation(line: 62, column: 15, scope: !272)
!302 = !DILocation(line: 63, column: 23, scope: !272)
!303 = !DILocation(line: 63, column: 28, scope: !272)
!304 = !DILocation(line: 63, column: 39, scope: !272)
!305 = !DILocation(line: 63, column: 5, scope: !272)
!306 = !DILocation(line: 64, column: 37, scope: !272)
!307 = !DILocation(line: 64, column: 5, scope: !272)
!308 = !DILocation(line: 64, column: 10, scope: !272)
!309 = !DILocation(line: 64, column: 21, scope: !272)
!310 = !DILocation(line: 64, column: 35, scope: !272)
!311 = !DILocation(line: 65, column: 5, scope: !272)
!312 = !DILocation(line: 66, column: 1, scope: !272)
!313 = distinct !DISubprogram(name: "OCSP_request_add1_cert", scope: !148, file: !148, line: 70, type: !314, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!314 = !DISubroutineType(types: !315)
!315 = !{!46, !157, !16}
!316 = !DILocalVariable(name: "req", arg: 1, scope: !313, file: !148, line: 70, type: !157)
!317 = !DILocation(line: 70, column: 42, scope: !313)
!318 = !DILocalVariable(name: "cert", arg: 2, scope: !313, file: !148, line: 70, type: !16)
!319 = !DILocation(line: 70, column: 53, scope: !313)
!320 = !DILocalVariable(name: "sig", scope: !313, file: !148, line: 72, type: !211)
!321 = !DILocation(line: 72, column: 21, scope: !313)
!322 = !DILocation(line: 73, column: 9, scope: !323)
!323 = distinct !DILexicalBlock(scope: !313, file: !148, line: 73, column: 9)
!324 = !DILocation(line: 73, column: 14, scope: !323)
!325 = !DILocation(line: 73, column: 32, scope: !323)
!326 = !DILocation(line: 73, column: 9, scope: !313)
!327 = !DILocation(line: 74, column: 34, scope: !323)
!328 = !DILocation(line: 74, column: 9, scope: !323)
!329 = !DILocation(line: 74, column: 14, scope: !323)
!330 = !DILocation(line: 74, column: 32, scope: !323)
!331 = !DILocation(line: 75, column: 11, scope: !313)
!332 = !DILocation(line: 75, column: 16, scope: !313)
!333 = !DILocation(line: 75, column: 9, scope: !313)
!334 = !DILocation(line: 76, column: 9, scope: !335)
!335 = distinct !DILexicalBlock(scope: !313, file: !148, line: 76, column: 9)
!336 = !DILocation(line: 76, column: 13, scope: !335)
!337 = !DILocation(line: 76, column: 9, scope: !313)
!338 = !DILocation(line: 77, column: 9, scope: !335)
!339 = !DILocation(line: 78, column: 9, scope: !340)
!340 = distinct !DILexicalBlock(scope: !313, file: !148, line: 78, column: 9)
!341 = !DILocation(line: 78, column: 14, scope: !340)
!342 = !DILocation(line: 78, column: 9, scope: !313)
!343 = !DILocation(line: 79, column: 9, scope: !340)
!344 = !DILocation(line: 80, column: 9, scope: !345)
!345 = distinct !DILexicalBlock(scope: !313, file: !148, line: 80, column: 9)
!346 = !DILocation(line: 80, column: 14, scope: !345)
!347 = !DILocation(line: 80, column: 20, scope: !345)
!348 = !DILocation(line: 81, column: 8, scope: !345)
!349 = !DILocation(line: 81, column: 25, scope: !350)
!350 = !DILexicalBlockFile(scope: !345, file: !148, discriminator: 1)
!351 = !DILocation(line: 81, column: 12, scope: !350)
!352 = !DILocation(line: 81, column: 17, scope: !350)
!353 = !DILocation(line: 81, column: 23, scope: !350)
!354 = !DILocation(line: 81, column: 45, scope: !350)
!355 = !DILocation(line: 80, column: 9, scope: !356)
!356 = !DILexicalBlockFile(scope: !313, file: !148, discriminator: 1)
!357 = !DILocation(line: 82, column: 9, scope: !345)
!358 = !DILocation(line: 84, column: 23, scope: !359)
!359 = distinct !DILexicalBlock(scope: !313, file: !148, line: 84, column: 9)
!360 = !DILocation(line: 84, column: 28, scope: !359)
!361 = !DILocation(line: 84, column: 35, scope: !359)
!362 = !DILocation(line: 84, column: 10, scope: !359)
!363 = !DILocation(line: 84, column: 9, scope: !313)
!364 = !DILocation(line: 85, column: 9, scope: !359)
!365 = !DILocation(line: 86, column: 17, scope: !313)
!366 = !DILocation(line: 86, column: 5, scope: !313)
!367 = !DILocation(line: 87, column: 5, scope: !313)
!368 = !DILocation(line: 88, column: 1, scope: !313)
!369 = distinct !DISubprogram(name: "sk_X509_new_null", scope: !13, file: !13, line: 99, type: !370, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!370 = !DISubroutineType(types: !371)
!371 = !{!11}
!372 = !DILocation(line: 99, column: 798, scope: !369)
!373 = !DILocation(line: 99, column: 774, scope: !369)
!374 = !DILocation(line: 99, column: 767, scope: !369)
!375 = distinct !DISubprogram(name: "sk_X509_push", scope: !13, file: !13, line: 99, type: !376, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!376 = !DISubroutineType(types: !377)
!377 = !{!46, !11, !16}
!378 = !DILocalVariable(name: "sk", arg: 1, scope: !375, file: !13, line: 99, type: !11)
!379 = !DILocation(line: 99, column: 1835, scope: !375)
!380 = !DILocalVariable(name: "ptr", arg: 2, scope: !375, file: !13, line: 99, type: !16)
!381 = !DILocation(line: 99, column: 1845, scope: !375)
!382 = !DILocation(line: 99, column: 1892, scope: !375)
!383 = !DILocation(line: 99, column: 1875, scope: !375)
!384 = !DILocation(line: 99, column: 1910, scope: !375)
!385 = !DILocation(line: 99, column: 1896, scope: !375)
!386 = !DILocation(line: 99, column: 1859, scope: !375)
!387 = !DILocation(line: 99, column: 1852, scope: !375)
!388 = distinct !DISubprogram(name: "OCSP_request_sign", scope: !148, file: !148, line: 96, type: !389, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!389 = !DISubroutineType(types: !390)
!390 = !{!46, !157, !16, !391, !394, !11, !398}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !18, line: 95, baseType: !393)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !18, line: 95, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !18, line: 91, baseType: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_md_st", file: !18, line: 91, flags: DIFlagFwdDecl)
!398 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!399 = !DILocalVariable(name: "req", arg: 1, scope: !388, file: !148, line: 96, type: !157)
!400 = !DILocation(line: 96, column: 37, scope: !388)
!401 = !DILocalVariable(name: "signer", arg: 2, scope: !388, file: !148, line: 97, type: !16)
!402 = !DILocation(line: 97, column: 29, scope: !388)
!403 = !DILocalVariable(name: "key", arg: 3, scope: !388, file: !148, line: 98, type: !391)
!404 = !DILocation(line: 98, column: 33, scope: !388)
!405 = !DILocalVariable(name: "dgst", arg: 4, scope: !388, file: !148, line: 99, type: !394)
!406 = !DILocation(line: 99, column: 37, scope: !388)
!407 = !DILocalVariable(name: "certs", arg: 5, scope: !388, file: !148, line: 100, type: !11)
!408 = !DILocation(line: 100, column: 45, scope: !388)
!409 = !DILocalVariable(name: "flags", arg: 6, scope: !388, file: !148, line: 100, type: !398)
!410 = !DILocation(line: 100, column: 66, scope: !388)
!411 = !DILocalVariable(name: "i", scope: !388, file: !148, line: 102, type: !46)
!412 = !DILocation(line: 102, column: 9, scope: !388)
!413 = !DILocalVariable(name: "x", scope: !388, file: !148, line: 103, type: !16)
!414 = !DILocation(line: 103, column: 11, scope: !388)
!415 = !DILocation(line: 105, column: 33, scope: !416)
!416 = distinct !DILexicalBlock(scope: !388, file: !148, line: 105, column: 9)
!417 = !DILocation(line: 105, column: 60, scope: !416)
!418 = !DILocation(line: 105, column: 38, scope: !416)
!419 = !DILocation(line: 105, column: 10, scope: !420)
!420 = !DILexicalBlockFile(scope: !416, file: !148, discriminator: 1)
!421 = !DILocation(line: 105, column: 10, scope: !416)
!422 = !DILocation(line: 105, column: 9, scope: !388)
!423 = !DILocation(line: 106, column: 9, scope: !416)
!424 = !DILocation(line: 108, column: 35, scope: !425)
!425 = distinct !DILexicalBlock(scope: !388, file: !148, line: 108, column: 9)
!426 = !DILocation(line: 108, column: 10, scope: !425)
!427 = !DILocation(line: 108, column: 15, scope: !425)
!428 = !DILocation(line: 108, column: 33, scope: !425)
!429 = !DILocation(line: 108, column: 57, scope: !425)
!430 = !DILocation(line: 108, column: 9, scope: !388)
!431 = !DILocation(line: 109, column: 9, scope: !425)
!432 = !DILocation(line: 110, column: 9, scope: !433)
!433 = distinct !DILexicalBlock(scope: !388, file: !148, line: 110, column: 9)
!434 = !DILocation(line: 110, column: 9, scope: !388)
!435 = !DILocation(line: 111, column: 37, scope: !436)
!436 = distinct !DILexicalBlock(scope: !437, file: !148, line: 111, column: 13)
!437 = distinct !DILexicalBlock(scope: !433, file: !148, line: 110, column: 14)
!438 = !DILocation(line: 111, column: 45, scope: !436)
!439 = !DILocation(line: 111, column: 14, scope: !436)
!440 = !DILocation(line: 111, column: 13, scope: !437)
!441 = !DILocation(line: 112, column: 13, scope: !442)
!442 = distinct !DILexicalBlock(scope: !436, file: !148, line: 111, column: 51)
!443 = !DILocation(line: 114, column: 13, scope: !442)
!444 = !DILocation(line: 116, column: 53, scope: !445)
!445 = distinct !DILexicalBlock(scope: !437, file: !148, line: 116, column: 13)
!446 = !DILocation(line: 116, column: 59, scope: !445)
!447 = !DILocation(line: 116, column: 78, scope: !445)
!448 = !DILocation(line: 116, column: 16, scope: !445)
!449 = !DILocation(line: 116, column: 22, scope: !445)
!450 = !DILocation(line: 116, column: 41, scope: !445)
!451 = !DILocation(line: 116, column: 51, scope: !445)
!452 = !DILocation(line: 116, column: 70, scope: !445)
!453 = !DILocation(line: 116, column: 74, scope: !445)
!454 = !DILocation(line: 116, column: 14, scope: !445)
!455 = !DILocation(line: 116, column: 13, scope: !437)
!456 = !DILocation(line: 117, column: 13, scope: !445)
!457 = !DILocation(line: 118, column: 5, scope: !437)
!458 = !DILocation(line: 120, column: 11, scope: !459)
!459 = distinct !DILexicalBlock(scope: !388, file: !148, line: 120, column: 9)
!460 = !DILocation(line: 120, column: 17, scope: !459)
!461 = !DILocation(line: 120, column: 9, scope: !388)
!462 = !DILocation(line: 121, column: 37, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !148, line: 121, column: 13)
!464 = distinct !DILexicalBlock(scope: !459, file: !148, line: 120, column: 25)
!465 = !DILocation(line: 121, column: 42, scope: !463)
!466 = !DILocation(line: 121, column: 14, scope: !463)
!467 = !DILocation(line: 121, column: 13, scope: !464)
!468 = !DILocation(line: 122, column: 13, scope: !463)
!469 = !DILocation(line: 123, column: 16, scope: !470)
!470 = distinct !DILexicalBlock(scope: !464, file: !148, line: 123, column: 9)
!471 = !DILocation(line: 123, column: 14, scope: !470)
!472 = !DILocation(line: 123, column: 21, scope: !473)
!473 = !DILexicalBlockFile(scope: !474, file: !148, discriminator: 1)
!474 = distinct !DILexicalBlock(scope: !470, file: !148, line: 123, column: 9)
!475 = !DILocation(line: 123, column: 37, scope: !473)
!476 = !DILocation(line: 123, column: 25, scope: !473)
!477 = !DILocation(line: 123, column: 23, scope: !473)
!478 = !DILocation(line: 123, column: 9, scope: !473)
!479 = !DILocation(line: 124, column: 31, scope: !480)
!480 = distinct !DILexicalBlock(scope: !474, file: !148, line: 123, column: 50)
!481 = !DILocation(line: 124, column: 38, scope: !480)
!482 = !DILocation(line: 124, column: 17, scope: !480)
!483 = !DILocation(line: 124, column: 15, scope: !480)
!484 = !DILocation(line: 125, column: 41, scope: !485)
!485 = distinct !DILexicalBlock(scope: !480, file: !148, line: 125, column: 17)
!486 = !DILocation(line: 125, column: 46, scope: !485)
!487 = !DILocation(line: 125, column: 18, scope: !485)
!488 = !DILocation(line: 125, column: 17, scope: !480)
!489 = !DILocation(line: 126, column: 17, scope: !485)
!490 = !DILocation(line: 127, column: 9, scope: !480)
!491 = !DILocation(line: 123, column: 46, scope: !492)
!492 = !DILexicalBlockFile(scope: !474, file: !148, discriminator: 2)
!493 = !DILocation(line: 123, column: 9, scope: !492)
!494 = distinct !{!494, !495}
!495 = !DILocation(line: 123, column: 9, scope: !464)
!496 = !DILocation(line: 128, column: 5, scope: !464)
!497 = !DILocation(line: 130, column: 5, scope: !388)
!498 = !DILocation(line: 132, column: 25, scope: !388)
!499 = !DILocation(line: 132, column: 30, scope: !388)
!500 = !DILocation(line: 132, column: 5, scope: !388)
!501 = !DILocation(line: 133, column: 5, scope: !388)
!502 = !DILocation(line: 133, column: 10, scope: !388)
!503 = !DILocation(line: 133, column: 28, scope: !388)
!504 = !DILocation(line: 134, column: 5, scope: !388)
!505 = !DILocation(line: 135, column: 1, scope: !388)
!506 = distinct !DISubprogram(name: "sk_X509_num", scope: !13, file: !13, line: 99, type: !507, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!507 = !DISubroutineType(types: !508)
!508 = !{!46, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!511 = !DILocalVariable(name: "sk", arg: 1, scope: !506, file: !13, line: 99, type: !509)
!512 = !DILocation(line: 99, column: 277, scope: !506)
!513 = !DILocation(line: 99, column: 328, scope: !506)
!514 = !DILocation(line: 99, column: 305, scope: !506)
!515 = !DILocation(line: 99, column: 290, scope: !506)
!516 = !DILocation(line: 99, column: 283, scope: !506)
!517 = distinct !DISubprogram(name: "sk_X509_value", scope: !13, file: !13, line: 99, type: !518, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!518 = !DISubroutineType(types: !519)
!519 = !{!16, !509, !46}
!520 = !DILocalVariable(name: "sk", arg: 1, scope: !517, file: !13, line: 99, type: !509)
!521 = !DILocation(line: 99, column: 421, scope: !517)
!522 = !DILocalVariable(name: "idx", arg: 2, scope: !517, file: !13, line: 99, type: !46)
!523 = !DILocation(line: 99, column: 429, scope: !517)
!524 = !DILocation(line: 99, column: 491, scope: !517)
!525 = !DILocation(line: 99, column: 468, scope: !517)
!526 = !DILocation(line: 99, column: 495, scope: !517)
!527 = !DILocation(line: 99, column: 451, scope: !517)
!528 = !DILocation(line: 99, column: 443, scope: !517)
!529 = !DILocation(line: 99, column: 436, scope: !517)
!530 = distinct !DISubprogram(name: "OCSP_response_status", scope: !148, file: !148, line: 139, type: !531, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!531 = !DISubroutineType(types: !532)
!532 = !{!46, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPONSE", file: !18, line: 170, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_response_st", file: !24, line: 89, size: 128, align: 64, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "responseStatus", scope: !535, file: !24, line: 90, baseType: !72, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "responseBytes", scope: !535, file: !24, line: 91, baseType: !539, size: 64, align: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPBYTES", file: !22, line: 90, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_resp_bytes_st", file: !24, line: 80, size: 128, align: 64, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "responseType", scope: !541, file: !24, line: 81, baseType: !36, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !541, file: !24, line: 82, baseType: !78, size: 64, align: 64, offset: 64)
!545 = !DILocalVariable(name: "resp", arg: 1, scope: !530, file: !148, line: 139, type: !533)
!546 = !DILocation(line: 139, column: 41, scope: !530)
!547 = !DILocation(line: 141, column: 32, scope: !530)
!548 = !DILocation(line: 141, column: 38, scope: !530)
!549 = !DILocation(line: 141, column: 12, scope: !530)
!550 = !DILocation(line: 141, column: 5, scope: !530)
!551 = distinct !DISubprogram(name: "OCSP_response_get1_basic", scope: !148, file: !148, line: 149, type: !552, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !533}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_BASICRESP", file: !22, line: 110, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_basic_response_st", file: !24, line: 189, size: 640, align: 64, elements: !557)
!557 = !{!558, !578, !579, !580}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tbsResponseData", scope: !556, file: !24, line: 190, baseType: !559, size: 384, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPDATA", file: !22, line: 108, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_response_data_st", file: !24, line: 155, size: 384, align: 64, elements: !561)
!561 = !{!562, !563, !573, !574, !577}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !560, file: !24, line: 156, baseType: !69, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "responderId", scope: !560, file: !24, line: 157, baseType: !564, size: 128, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPID", file: !18, line: 171, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_responder_id_st", file: !24, line: 98, size: 128, align: 64, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !565, file: !24, line: 99, baseType: !46, size: 32, align: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !565, file: !24, line: 103, baseType: !569, size: 64, align: 64, offset: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !24, line: 100, size: 64, align: 64, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "byName", scope: !569, file: !24, line: 101, baseType: !188, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "byKey", scope: !569, file: !24, line: 102, baseType: !78, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "producedAt", scope: !560, file: !24, line: 158, baseType: !102, size: 64, align: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "responses", scope: !560, file: !24, line: 159, baseType: !575, size: 64, align: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_OCSP_SINGLERESP", file: !22, line: 106, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "responseExtensions", scope: !560, file: !24, line: 160, baseType: !142, size: 64, align: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "signatureAlgorithm", scope: !556, file: !24, line: 191, baseType: !32, size: 128, align: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !556, file: !24, line: 192, baseType: !75, size: 64, align: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !556, file: !24, line: 193, baseType: !11, size: 64, align: 64, offset: 576)
!581 = !DILocalVariable(name: "resp", arg: 1, scope: !551, file: !148, line: 149, type: !533)
!582 = !DILocation(line: 149, column: 57, scope: !551)
!583 = !DILocalVariable(name: "rb", scope: !551, file: !148, line: 151, type: !539)
!584 = !DILocation(line: 151, column: 21, scope: !551)
!585 = !DILocation(line: 152, column: 10, scope: !551)
!586 = !DILocation(line: 152, column: 16, scope: !551)
!587 = !DILocation(line: 152, column: 8, scope: !551)
!588 = !DILocation(line: 153, column: 10, scope: !589)
!589 = distinct !DILexicalBlock(scope: !551, file: !148, line: 153, column: 9)
!590 = !DILocation(line: 153, column: 9, scope: !551)
!591 = !DILocation(line: 154, column: 9, scope: !592)
!592 = distinct !DILexicalBlock(scope: !589, file: !148, line: 153, column: 14)
!593 = !DILocation(line: 155, column: 9, scope: !592)
!594 = !DILocation(line: 157, column: 21, scope: !595)
!595 = distinct !DILexicalBlock(scope: !551, file: !148, line: 157, column: 9)
!596 = !DILocation(line: 157, column: 25, scope: !595)
!597 = !DILocation(line: 157, column: 9, scope: !595)
!598 = !DILocation(line: 157, column: 39, scope: !595)
!599 = !DILocation(line: 157, column: 9, scope: !551)
!600 = !DILocation(line: 158, column: 9, scope: !601)
!601 = distinct !DILexicalBlock(scope: !595, file: !148, line: 157, column: 47)
!602 = !DILocation(line: 159, column: 9, scope: !601)
!603 = !DILocation(line: 162, column: 29, scope: !551)
!604 = !DILocation(line: 162, column: 33, scope: !551)
!605 = !DILocation(line: 162, column: 12, scope: !551)
!606 = !DILocation(line: 162, column: 5, scope: !551)
!607 = !DILocation(line: 163, column: 1, scope: !551)
!608 = distinct !DISubprogram(name: "OCSP_resp_get0_signature", scope: !148, file: !148, line: 165, type: !609, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!609 = !DISubroutineType(types: !610)
!610 = !{!611, !613}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!615 = !DILocalVariable(name: "bs", arg: 1, scope: !608, file: !148, line: 165, type: !613)
!616 = !DILocation(line: 165, column: 73, scope: !608)
!617 = !DILocation(line: 167, column: 12, scope: !608)
!618 = !DILocation(line: 167, column: 16, scope: !608)
!619 = !DILocation(line: 167, column: 5, scope: !608)
!620 = distinct !DISubprogram(name: "OCSP_resp_get0_tbs_sigalg", scope: !148, file: !148, line: 170, type: !621, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!621 = !DISubroutineType(types: !622)
!622 = !{!623, !613}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!625 = !DILocalVariable(name: "bs", arg: 1, scope: !620, file: !148, line: 170, type: !613)
!626 = !DILocation(line: 170, column: 67, scope: !620)
!627 = !DILocation(line: 172, column: 13, scope: !620)
!628 = !DILocation(line: 172, column: 17, scope: !620)
!629 = !DILocation(line: 172, column: 5, scope: !620)
!630 = distinct !DISubprogram(name: "OCSP_resp_get0_respdata", scope: !148, file: !148, line: 175, type: !631, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!631 = !DISubroutineType(types: !632)
!632 = !{!633, !613}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!635 = !DILocalVariable(name: "bs", arg: 1, scope: !630, file: !148, line: 175, type: !613)
!636 = !DILocation(line: 175, column: 68, scope: !630)
