; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ess--libcrypto-lib-ess_asn1.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ess--libcrypto-lib-ess_asn1.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.ESS_issuer_serial = type { %struct.stack_st_GENERAL_NAME*, %struct.asn1_string_st* }
%struct.stack_st_GENERAL_NAME = type opaque
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.ASN1_VALUE_st = type opaque
%struct.ESS_cert_id = type { %struct.asn1_string_st*, %struct.ESS_issuer_serial* }
%struct.ESS_signing_cert = type { %struct.stack_st_ESS_CERT_ID*, %struct.stack_st_POLICYINFO* }
%struct.stack_st_ESS_CERT_ID = type opaque
%struct.stack_st_POLICYINFO = type opaque
%struct.ESS_cert_id_v2_st = type { %struct.X509_algor_st*, %struct.asn1_string_st*, %struct.ESS_issuer_serial* }
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_object_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.ESS_signing_cert_v2_st = type { %struct.stack_st_ESS_CERT_ID_V2*, %struct.stack_st_POLICYINFO* }
%struct.stack_st_ESS_CERT_ID_V2 = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !134)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ess--libcrypto-lib-ess_asn1.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !29, !30, !33, !41, !51, !126}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_ISSUER_SERIAL", file: !6, line: 22, baseType: !7)
!6 = !DIFile(filename: "include/openssl/ess.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_issuer_serial", file: !8, line: 25, size: 128, align: 64, elements: !9)
!8 = !DIFile(filename: "crypto/include/internal/ess_int.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!9 = !{!10, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !7, file: !8, line: 26, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAME", file: !13, line: 166, flags: DIFlagFwdDecl)
!13 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!14 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !7, file: !8, line: 27, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !17, line: 40, baseType: !18)
!17 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !19, line: 146, size: 192, align: 64, elements: !20)
!19 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!20 = !{!21, !23, !24, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !18, file: !19, line: 147, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !19, line: 148, baseType: !22, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !18, file: !19, line: 149, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !18, file: !19, line: 155, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !19, line: 213, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !19, line: 213, flags: DIFlagFwdDecl)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_CERT_ID", file: !6, line: 23, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_cert_id", file: !8, line: 37, size: 128, align: 64, elements: !36)
!36 = !{!37, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !35, file: !8, line: 38, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !17, line: 43, baseType: !18)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_serial", scope: !35, file: !8, line: 39, baseType: !4, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_SIGNING_CERT", file: !6, line: 24, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_signing_cert", file: !8, line: 49, size: 128, align: 64, elements: !44)
!44 = !{!45, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cert_ids", scope: !43, file: !8, line: 50, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ESS_CERT_ID", file: !6, line: 26, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "policy_info", scope: !43, file: !8, line: 51, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_POLICYINFO", file: !13, line: 253, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_CERT_ID_V2", file: !6, line: 29, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_cert_id_v2_st", file: !8, line: 62, size: 192, align: 64, elements: !54)
!54 = !{!55, !124, !125}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hash_alg", scope: !53, file: !8, line: 63, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !17, line: 125, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !59, line: 59, size: 128, align: 64, elements: !60)
!59 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!60 = !{!61, !65}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !58, file: !59, line: 60, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !17, line: 60, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !17, line: 60, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !58, file: !59, line: 61, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !19, line: 473, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !19, line: 444, size: 128, align: 64, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !19, line: 445, baseType: !22, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !68, file: !19, line: 472, baseType: !72, size: 64, align: 64, offset: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !68, file: !19, line: 446, size: 64, align: 64, elements: !73)
!73 = !{!74, !77, !79, !82, !83, !84, !87, !90, !91, !94, !97, !100, !103, !106, !109, !112, !115, !118, !121, !122, !123}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !72, file: !19, line: 447, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !72, file: !19, line: 448, baseType: !78, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !17, line: 56, baseType: !22)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !72, file: !19, line: 449, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !17, line: 55, baseType: !18)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !72, file: !19, line: 450, baseType: !62, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !72, file: !19, line: 451, baseType: !15, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !72, file: !19, line: 452, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !17, line: 41, baseType: !18)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !72, file: !19, line: 453, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !17, line: 42, baseType: !18)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !72, file: !19, line: 454, baseType: !38, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !72, file: !19, line: 455, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !17, line: 44, baseType: !18)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !72, file: !19, line: 456, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !17, line: 45, baseType: !18)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !72, file: !19, line: 457, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !17, line: 46, baseType: !18)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !72, file: !19, line: 458, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !17, line: 47, baseType: !18)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !72, file: !19, line: 459, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !17, line: 49, baseType: !18)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !72, file: !19, line: 460, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !17, line: 48, baseType: !18)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !72, file: !19, line: 461, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !17, line: 50, baseType: !18)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !72, file: !19, line: 462, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !17, line: 52, baseType: !18)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !72, file: !19, line: 463, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !17, line: 53, baseType: !18)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !72, file: !19, line: 464, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !17, line: 54, baseType: !18)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !72, file: !19, line: 469, baseType: !80, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !72, file: !19, line: 470, baseType: !80, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !72, file: !19, line: 471, baseType: !30, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !53, file: !8, line: 64, baseType: !38, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_serial", scope: !53, file: !8, line: 65, baseType: !4, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ESS_SIGNING_CERT_V2", file: !6, line: 28, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ESS_signing_cert_v2_st", file: !8, line: 75, size: 128, align: 64, elements: !129)
!129 = !{!130, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cert_ids", scope: !128, file: !8, line: 76, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ESS_CERT_ID_V2", file: !6, line: 31, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "policy_info", scope: !128, file: !8, line: 77, baseType: !49, size: 64, align: 64, offset: 64)
!134 = !{!135, !166, !170, !171, !172, !173, !174, !175, !179, !180}
!135 = distinct !DIGlobalVariable(name: "ESS_ISSUER_SERIAL_it", scope: !0, file: !136, line: 21, type: !137, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ESS_ISSUER_SERIAL_it)
!136 = !DIFile(filename: "crypto/ess/ess_asn1.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !17, line: 62, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !140, line: 580, size: 448, align: 64, elements: !141)
!140 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!141 = !{!142, !143, !144, !160, !161, !164, !165}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !139, file: !140, line: 581, baseType: !76, size: 8, align: 8)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !139, file: !140, line: 583, baseType: !28, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !139, file: !140, line: 584, baseType: !145, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !19, line: 210, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !140, line: 468, size: 320, align: 64, elements: !149)
!149 = !{!150, !152, !153, !154, !157}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !148, file: !140, line: 469, baseType: !151, size: 64, align: 64)
!151 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !148, file: !140, line: 470, baseType: !28, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !148, file: !140, line: 471, baseType: !151, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !148, file: !140, line: 472, baseType: !155, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !148, file: !140, line: 473, baseType: !158, size: 64, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !19, line: 318, baseType: !137)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !139, file: !140, line: 586, baseType: !28, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !139, file: !140, line: 587, baseType: !162, size: 64, align: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !139, file: !140, line: 588, baseType: !28, size: 64, align: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !139, file: !140, line: 589, baseType: !155, size: 64, align: 64, offset: 384)
!166 = distinct !DIGlobalVariable(name: "ESS_ISSUER_SERIAL_seq_tt", scope: !0, file: !136, line: 18, type: !167, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @ESS_ISSUER_SERIAL_seq_tt)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 640, align: 64, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 2)
!170 = distinct !DIGlobalVariable(name: "ESS_CERT_ID_it", scope: !0, file: !136, line: 29, type: !137, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ESS_CERT_ID_it)
!171 = distinct !DIGlobalVariable(name: "ESS_CERT_ID_seq_tt", scope: !0, file: !136, line: 26, type: !167, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @ESS_CERT_ID_seq_tt)
!172 = distinct !DIGlobalVariable(name: "ESS_SIGNING_CERT_it", scope: !0, file: !136, line: 37, type: !137, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ESS_SIGNING_CERT_it)
!173 = distinct !DIGlobalVariable(name: "ESS_SIGNING_CERT_seq_tt", scope: !0, file: !136, line: 34, type: !167, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @ESS_SIGNING_CERT_seq_tt)
!174 = distinct !DIGlobalVariable(name: "ESS_CERT_ID_V2_it", scope: !0, file: !136, line: 46, type: !137, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ESS_CERT_ID_V2_it)
!175 = distinct !DIGlobalVariable(name: "ESS_CERT_ID_V2_seq_tt", scope: !0, file: !136, line: 42, type: !176, isLocal: true, isDefinition: true, variable: [3 x %struct.ASN1_TEMPLATE_st]* @ESS_CERT_ID_V2_seq_tt)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 960, align: 64, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 3)
!179 = distinct !DIGlobalVariable(name: "ESS_SIGNING_CERT_V2_it", scope: !0, file: !136, line: 54, type: !137, isLocal: true, isDefinition: true, variable: %struct.ASN1_ITEM_st* @ESS_SIGNING_CERT_V2_it)
!180 = distinct !DIGlobalVariable(name: "ESS_SIGNING_CERT_V2_seq_tt", scope: !0, file: !136, line: 51, type: !167, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @ESS_SIGNING_CERT_V2_seq_tt)
!181 = !{i32 2, !"Dwarf Version", i32 4}
!182 = !{i32 2, !"Debug Info Version", i32 3}
!183 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!184 = distinct !DISubprogram(name: "d2i_ESS_ISSUER_SERIAL", scope: !136, file: !136, line: 23, type: !185, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!185 = !DISubroutineType(types: !186)
!186 = !{!4, !187, !188, !28}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!191 = !DILocalVariable(name: "a", arg: 1, scope: !184, file: !136, line: 23, type: !187)
!192 = !DIExpression()
!193 = !DILocation(line: 23, column: 62, scope: !184)
!194 = !DILocalVariable(name: "in", arg: 2, scope: !184, file: !136, line: 23, type: !188)
!195 = !DILocation(line: 23, column: 87, scope: !184)
!196 = !DILocalVariable(name: "len", arg: 3, scope: !184, file: !136, line: 23, type: !28)
!197 = !DILocation(line: 23, column: 96, scope: !184)
!198 = !DILocation(line: 23, column: 160, scope: !184)
!199 = !DILocation(line: 23, column: 145, scope: !184)
!200 = !DILocation(line: 23, column: 163, scope: !184)
!201 = !DILocation(line: 23, column: 167, scope: !184)
!202 = !DILocation(line: 23, column: 131, scope: !184)
!203 = !DILocation(line: 23, column: 110, scope: !184)
!204 = !DILocation(line: 23, column: 103, scope: !184)
