; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ocsp--libcrypto-lib-ocsp_asn.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ocsp--libcrypto-lib-ocsp_asn.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ASN1_TEMPLATE_st = type { i64, i64, i64, i8*, %struct.ASN1_ITEM_st* }
%struct.ASN1_ITEM_st = type { i8, i64, %struct.ASN1_TEMPLATE_st*, i64, i8*, i64, i8* }
%struct.ocsp_signature_st = type { %struct.X509_algor_st, %struct.asn1_string_st*, %struct.stack_st_X509* }
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_object_st = type opaque
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.stack_st_X509 = type opaque
%struct.ASN1_VALUE_st = type opaque
%struct.ocsp_cert_id_st = type { %struct.X509_algor_st, %struct.asn1_string_st, %struct.asn1_string_st, %struct.asn1_string_st }
%struct.ocsp_one_request_st = type { %struct.ocsp_cert_id_st*, %struct.stack_st_X509_EXTENSION* }
%struct.stack_st_X509_EXTENSION = type opaque
%struct.ocsp_req_info_st = type { %struct.asn1_string_st*, %struct.GENERAL_NAME_st*, %struct.stack_st_OCSP_ONEREQ*, %struct.stack_st_X509_EXTENSION* }
%struct.GENERAL_NAME_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !257)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ocsp--libcrypto-lib-ocsp_asn.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !101, !94, !102, !110, !118, !167, !173, !179, !185, !195, !201, !214, !223, !234, !242, !249}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_SIGNATURE", file: !6, line: 80, baseType: !7)
!6 = !DIFile(filename: "include/openssl/ocsp.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_signature_st", file: !8, line: 50, size: 256, align: 64, elements: !9)
!8 = !DIFile(filename: "crypto/ocsp/ocsp_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!9 = !{!10, !97, !98}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "signatureAlgorithm", scope: !7, file: !8, line: 51, baseType: !11, size: 128, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !12, line: 125, baseType: !13)
!12 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !14, line: 59, size: 128, align: 64, elements: !15)
!14 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!15 = !{!16, !20}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !13, file: !14, line: 60, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !12, line: 60, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !12, line: 60, flags: DIFlagFwdDecl)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !13, file: !14, line: 61, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !23, line: 473, baseType: !24)
!23 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !23, line: 444, size: 128, align: 64, elements: !25)
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !24, file: !23, line: 445, baseType: !27, size: 32, align: 32)
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !24, file: !23, line: 472, baseType: !29, size: 64, align: 64, offset: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !24, file: !23, line: 446, size: 64, align: 64, elements: !30)
!30 = !{!31, !34, !36, !48, !49, !52, !55, !58, !61, !64, !67, !70, !73, !76, !79, !82, !85, !88, !91, !92, !93}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !29, file: !23, line: 447, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !29, file: !23, line: 448, baseType: !35, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !12, line: 56, baseType: !27)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !29, file: !23, line: 449, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !12, line: 55, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !23, line: 146, size: 192, align: 64, elements: !40)
!40 = !{!41, !42, !43, !46}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !39, file: !23, line: 147, baseType: !27, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !23, line: 148, baseType: !27, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !39, file: !23, line: 149, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !39, file: !23, line: 155, baseType: !47, size: 64, align: 64, offset: 128)
!47 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !29, file: !23, line: 450, baseType: !17, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !29, file: !23, line: 451, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !12, line: 40, baseType: !39)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !29, file: !23, line: 452, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !12, line: 41, baseType: !39)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !29, file: !23, line: 453, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !12, line: 42, baseType: !39)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !29, file: !23, line: 454, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !12, line: 43, baseType: !39)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !29, file: !23, line: 455, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !12, line: 44, baseType: !39)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !29, file: !23, line: 456, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !12, line: 45, baseType: !39)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !29, file: !23, line: 457, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !12, line: 46, baseType: !39)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !29, file: !23, line: 458, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !12, line: 47, baseType: !39)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !29, file: !23, line: 459, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !12, line: 49, baseType: !39)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !29, file: !23, line: 460, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !12, line: 48, baseType: !39)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !29, file: !23, line: 461, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !12, line: 50, baseType: !39)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !29, file: !23, line: 462, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !12, line: 52, baseType: !39)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !29, file: !23, line: 463, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !12, line: 53, baseType: !39)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !29, file: !23, line: 464, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !12, line: 54, baseType: !39)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !29, file: !23, line: 469, baseType: !37, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !29, file: !23, line: 470, baseType: !37, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !29, file: !23, line: 471, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !23, line: 213, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !23, line: 213, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !7, file: !8, line: 52, baseType: !56, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !7, file: !8, line: 53, baseType: !99, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !14, line: 99, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_CERTID", file: !6, line: 71, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_cert_id_st", file: !8, line: 16, size: 704, align: 64, elements: !105)
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hashAlgorithm", scope: !104, file: !8, line: 17, baseType: !11, size: 128, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "issuerNameHash", scope: !104, file: !8, line: 18, baseType: !60, size: 192, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "issuerKeyHash", scope: !104, file: !8, line: 19, baseType: !60, size: 192, align: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !104, file: !8, line: 20, baseType: !51, size: 192, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_ONEREQ", file: !6, line: 75, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_one_request_st", file: !8, line: 27, size: 128, align: 64, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "reqCert", scope: !112, file: !8, line: 28, baseType: !102, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "singleRequestExtensions", scope: !112, file: !8, line: 29, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !14, line: 83, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_REQINFO", file: !6, line: 79, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_req_info_st", file: !8, line: 38, size: 256, align: 64, elements: !121)
!121 = !{!122, !123, !163, !166}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !120, file: !8, line: 39, baseType: !50, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "requestorName", scope: !120, file: !8, line: 40, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !126, line: 153, baseType: !127)
!126 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !126, line: 123, size: 128, align: 64, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !126, line: 133, baseType: !27, size: 32, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !127, file: !126, line: 152, baseType: !131, size: 64, align: 64, offset: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !126, line: 134, size: 64, align: 64, elements: !132)
!132 = !{!133, !134, !141, !142, !143, !144, !148, !155, !156, !157, !158, !159, !160, !161, !162}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !131, file: !126, line: 135, baseType: !32, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !131, file: !126, line: 136, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !126, line: 116, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !126, line: 113, size: 128, align: 64, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !137, file: !126, line: 114, baseType: !17, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !137, file: !126, line: 115, baseType: !21, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !131, file: !126, line: 137, baseType: !68, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !131, file: !126, line: 138, baseType: !68, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !131, file: !126, line: 139, baseType: !21, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !131, file: !126, line: 140, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !12, line: 129, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !12, line: 129, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !131, file: !126, line: 141, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !126, line: 121, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !126, line: 118, size: 128, align: 64, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !151, file: !126, line: 119, baseType: !37, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !151, file: !126, line: 120, baseType: !37, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !131, file: !126, line: 142, baseType: !68, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !131, file: !126, line: 143, baseType: !59, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !131, file: !126, line: 144, baseType: !17, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !131, file: !126, line: 146, baseType: !59, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !131, file: !126, line: 147, baseType: !145, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !131, file: !126, line: 148, baseType: !68, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !131, file: !126, line: 150, baseType: !17, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !131, file: !126, line: 151, baseType: !21, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "requestList", scope: !120, file: !8, line: 41, baseType: !164, size: 64, align: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_OCSP_ONEREQ", file: !6, line: 77, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "requestExtensions", scope: !120, file: !8, line: 42, baseType: !116, size: 64, align: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_REQUEST", file: !6, line: 81, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_request_st", file: !8, line: 60, size: 320, align: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tbsRequest", scope: !169, file: !8, line: 61, baseType: !119, size: 256, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "optionalSignature", scope: !169, file: !8, line: 62, baseType: !4, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPBYTES", file: !6, line: 90, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_resp_bytes_st", file: !8, line: 80, size: 128, align: 64, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "responseType", scope: !175, file: !8, line: 81, baseType: !17, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !175, file: !8, line: 82, baseType: !59, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPONSE", file: !12, line: 170, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_response_st", file: !8, line: 89, size: 128, align: 64, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "responseStatus", scope: !181, file: !8, line: 90, baseType: !53, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "responseBytes", scope: !181, file: !8, line: 91, baseType: !173, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPID", file: !12, line: 171, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_responder_id_st", file: !8, line: 98, size: 128, align: 64, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !187, file: !8, line: 99, baseType: !27, size: 32, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !187, file: !8, line: 103, baseType: !191, size: 64, align: 64, offset: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !8, line: 100, size: 64, align: 64, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "byName", scope: !191, file: !8, line: 101, baseType: !145, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "byKey", scope: !191, file: !8, line: 102, baseType: !59, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_REVOKEDINFO", file: !6, line: 97, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_revoked_info_st", file: !8, line: 114, size: 128, align: 64, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "revocationTime", scope: !197, file: !8, line: 115, baseType: !83, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "revocationReason", scope: !197, file: !8, line: 116, baseType: !53, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_CERTSTATUS", file: !6, line: 103, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_cert_status_st", file: !8, line: 124, size: 128, align: 64, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !8, line: 125, baseType: !27, size: 32, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !203, file: !8, line: 130, baseType: !207, size: 64, align: 64, offset: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !8, line: 126, size: 64, align: 64, elements: !208)
!208 = !{!209, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "good", scope: !207, file: !8, line: 127, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_NULL", file: !12, line: 57, baseType: !27)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "revoked", scope: !207, file: !8, line: 128, baseType: !195, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "unknown", scope: !207, file: !8, line: 129, baseType: !210, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_SINGLERESP", file: !6, line: 104, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_single_response_st", file: !8, line: 140, size: 320, align: 64, elements: !217)
!217 = !{!218, !219, !220, !221, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "certId", scope: !216, file: !8, line: 141, baseType: !102, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "certStatus", scope: !216, file: !8, line: 142, baseType: !201, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "thisUpdate", scope: !216, file: !8, line: 143, baseType: !83, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nextUpdate", scope: !216, file: !8, line: 144, baseType: !83, size: 64, align: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "singleExtensions", scope: !216, file: !8, line: 145, baseType: !116, size: 64, align: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_RESPDATA", file: !6, line: 108, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_response_data_st", file: !8, line: 155, size: 384, align: 64, elements: !226)
!226 = !{!227, !228, !229, !230, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !225, file: !8, line: 156, baseType: !50, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "responderId", scope: !225, file: !8, line: 157, baseType: !186, size: 128, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "producedAt", scope: !225, file: !8, line: 158, baseType: !83, size: 64, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "responses", scope: !225, file: !8, line: 159, baseType: !231, size: 64, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_OCSP_SINGLERESP", file: !6, line: 106, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "responseExtensions", scope: !225, file: !8, line: 160, baseType: !116, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_BASICRESP", file: !6, line: 110, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_basic_response_st", file: !8, line: 189, size: 640, align: 64, elements: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tbsResponseData", scope: !236, file: !8, line: 190, baseType: !224, size: 384, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "signatureAlgorithm", scope: !236, file: !8, line: 191, baseType: !11, size: 128, align: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !236, file: !8, line: 192, baseType: !56, size: 64, align: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !236, file: !8, line: 193, baseType: !99, size: 64, align: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_CRLID", file: !6, line: 112, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_crl_id_st", file: !8, line: 202, size: 192, align: 64, elements: !245)
!245 = !{!246, !247, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "crlUrl", scope: !244, file: !8, line: 203, baseType: !68, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "crlNum", scope: !244, file: !8, line: 204, baseType: !50, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "crlTime", scope: !244, file: !8, line: 205, baseType: !83, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCSP_SERVICELOC", file: !6, line: 113, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ocsp_service_locator_st", file: !8, line: 213, size: 128, align: 64, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !251, file: !8, line: 214, baseType: !145, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "locator", scope: !251, file: !8, line: 215, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ACCESS_DESCRIPTION", file: !126, line: 160, flags: DIFlagFwdDecl)
!257 = !{!258, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !307, !311, !315, !316, !317, !318, !319, !320, !321, !322, !326, !327, !328, !329}
!258 = distinct !DIGlobalVariable(name: "OCSP_SIGNATURE_it", scope: !0, file: !259, line: 19, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_SIGNATURE_it)
!259 = !DIFile(filename: "crypto/ocsp/ocsp_asn.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM", file: !12, line: 62, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ITEM_st", file: !263, line: 580, size: 448, align: 64, elements: !264)
!263 = !DIFile(filename: "include/openssl/asn1t.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!264 = !{!265, !266, !267, !283, !284, !287, !288}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !262, file: !263, line: 581, baseType: !33, size: 8, align: 8)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "utype", scope: !262, file: !263, line: 583, baseType: !47, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "templates", scope: !262, file: !263, line: 584, baseType: !268, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TEMPLATE", file: !23, line: 210, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_TEMPLATE_st", file: !263, line: 468, size: 320, align: 64, elements: !272)
!272 = !{!273, !275, !276, !277, !280}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !271, file: !263, line: 469, baseType: !274, size: 64, align: 64)
!274 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !271, file: !263, line: 470, baseType: !47, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !271, file: !263, line: 471, baseType: !274, size: 64, align: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !271, file: !263, line: 472, baseType: !278, size: 64, align: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !271, file: !263, line: 473, baseType: !281, size: 64, align: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ITEM_EXP", file: !23, line: 318, baseType: !260)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tcount", scope: !262, file: !263, line: 586, baseType: !47, size: 64, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !262, file: !263, line: 587, baseType: !285, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !262, file: !263, line: 588, baseType: !47, size: 64, align: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !262, file: !263, line: 589, baseType: !278, size: 64, align: 64, offset: 384)
!289 = distinct !DIGlobalVariable(name: "OCSP_CERTID_it", scope: !0, file: !259, line: 28, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_CERTID_it)
!290 = distinct !DIGlobalVariable(name: "OCSP_ONEREQ_it", scope: !0, file: !259, line: 35, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_ONEREQ_it)
!291 = distinct !DIGlobalVariable(name: "OCSP_REQINFO_it", scope: !0, file: !259, line: 44, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_REQINFO_it)
!292 = distinct !DIGlobalVariable(name: "OCSP_REQUEST_it", scope: !0, file: !259, line: 51, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_REQUEST_it)
!293 = distinct !DIGlobalVariable(name: "OCSP_RESPBYTES_it", scope: !0, file: !259, line: 60, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_RESPBYTES_it)
!294 = distinct !DIGlobalVariable(name: "OCSP_RESPONSE_it", scope: !0, file: !259, line: 67, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_RESPONSE_it)
!295 = distinct !DIGlobalVariable(name: "OCSP_RESPID_it", scope: !0, file: !259, line: 74, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_RESPID_it)
!296 = distinct !DIGlobalVariable(name: "OCSP_REVOKEDINFO_it", scope: !0, file: !259, line: 81, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_REVOKEDINFO_it)
!297 = distinct !DIGlobalVariable(name: "OCSP_CERTSTATUS_it", scope: !0, file: !259, line: 89, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_CERTSTATUS_it)
!298 = distinct !DIGlobalVariable(name: "OCSP_SINGLERESP_it", scope: !0, file: !259, line: 99, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_SINGLERESP_it)
!299 = distinct !DIGlobalVariable(name: "OCSP_RESPDATA_it", scope: !0, file: !259, line: 109, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_RESPDATA_it)
!300 = distinct !DIGlobalVariable(name: "OCSP_BASICRESP_it", scope: !0, file: !259, line: 118, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_BASICRESP_it)
!301 = distinct !DIGlobalVariable(name: "OCSP_CRLID_it", scope: !0, file: !259, line: 126, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_CRLID_it)
!302 = distinct !DIGlobalVariable(name: "OCSP_SERVICELOC_it", scope: !0, file: !259, line: 133, type: !260, isLocal: false, isDefinition: true, variable: %struct.ASN1_ITEM_st* @OCSP_SERVICELOC_it)
!303 = distinct !DIGlobalVariable(name: "OCSP_SIGNATURE_seq_tt", scope: !0, file: !259, line: 15, type: !304, isLocal: true, isDefinition: true, variable: [3 x %struct.ASN1_TEMPLATE_st]* @OCSP_SIGNATURE_seq_tt)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 960, align: 64, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 3)
!307 = distinct !DIGlobalVariable(name: "OCSP_CERTID_seq_tt", scope: !0, file: !259, line: 23, type: !308, isLocal: true, isDefinition: true, variable: [4 x %struct.ASN1_TEMPLATE_st]* @OCSP_CERTID_seq_tt)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 1280, align: 64, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 4)
!311 = distinct !DIGlobalVariable(name: "OCSP_ONEREQ_seq_tt", scope: !0, file: !259, line: 32, type: !312, isLocal: true, isDefinition: true, variable: [2 x %struct.ASN1_TEMPLATE_st]* @OCSP_ONEREQ_seq_tt)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 640, align: 64, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 2)
