; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ts--libcrypto-lib-ts_req_utils.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ts--libcrypto-lib-ts_req_utils.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TS_req_st = type { %struct.asn1_string_st*, %struct.TS_msg_imprint_st*, %struct.asn1_object_st*, %struct.asn1_string_st*, i32, %struct.stack_st_X509_EXTENSION* }
%struct.TS_msg_imprint_st = type { %struct.X509_algor_st*, %struct.asn1_string_st* }
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.asn1_object_st = type opaque
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.stack_st_X509_EXTENSION = type opaque
%struct.X509_extension_st = type opaque
%struct.stack_st = type opaque

@.str = private unnamed_addr constant [25 x i8] c"crypto/ts/ts_req_utils.c\00", align 1

; Function Attrs: nounwind uwtable
define i32 @TS_REQ_set_version(%struct.TS_req_st* %a, i64 %version) #0 !dbg !16 {
entry:
  %a.addr = alloca %struct.TS_req_st*, align 8
  %version.addr = alloca i64, align 8
  store %struct.TS_req_st* %a, %struct.TS_req_st** %a.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.TS_req_st** %a.addr, metadata !127, metadata !128), !dbg !129

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ts--libcrypto-lib-ts_req_utils.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !5, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !7, line: 17, baseType: !8)
!7 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !7, line: 17, flags: DIFlagFwdDecl)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !7, line: 20, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !4}
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!16 = distinct !DISubprogram(name: "TS_REQ_set_version", scope: !17, file: !17, line: 17, type: !18, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!17 = !DIFile(filename: "crypto/ts/ts_req_utils.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !21, !40}
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_REQ", file: !23, line: 35, baseType: !24)
!23 = !DIFile(filename: "include/openssl/ts.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_req_st", file: !25, line: 42, size: 384, align: 64, elements: !26)
!25 = !DIFile(filename: "crypto/ts/ts_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!26 = !{!27, !41, !121, !122, !123, !124}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !24, file: !25, line: 43, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !30, line: 40, baseType: !31)
!30 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !32, line: 146, size: 192, align: 64, elements: !33)
!32 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!33 = !{!34, !35, !36, !39}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !31, file: !32, line: 147, baseType: !20, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !31, file: !32, line: 148, baseType: !20, size: 32, align: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !31, file: !32, line: 149, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !31, file: !32, line: 155, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "msg_imprint", scope: !24, file: !25, line: 44, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_MSG_IMPRINT", file: !23, line: 34, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_msg_imprint_st", file: !25, line: 15, size: 128, align: 64, elements: !45)
!45 = !{!46, !120}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "hash_algo", scope: !44, file: !25, line: 16, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !30, line: 125, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !50, line: 59, size: 128, align: 64, elements: !51)
!50 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!51 = !{!52, !56}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !49, file: !50, line: 60, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !30, line: 60, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !30, line: 60, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !49, file: !50, line: 61, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !32, line: 473, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !32, line: 444, size: 128, align: 64, elements: !60)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !32, line: 445, baseType: !20, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !59, file: !32, line: 472, baseType: !63, size: 64, align: 64, offset: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !32, line: 446, size: 64, align: 64, elements: !64)
!64 = !{!65, !68, !70, !73, !74, !75, !78, !81, !84, !87, !90, !93, !96, !99, !102, !105, !108, !111, !114, !115, !116}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !63, file: !32, line: 447, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !63, file: !32, line: 448, baseType: !69, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !30, line: 56, baseType: !20)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !63, file: !32, line: 449, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !30, line: 55, baseType: !31)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !63, file: !32, line: 450, baseType: !53, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !63, file: !32, line: 451, baseType: !28, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !63, file: !32, line: 452, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !30, line: 41, baseType: !31)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !63, file: !32, line: 453, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !30, line: 42, baseType: !31)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !63, file: !32, line: 454, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !30, line: 43, baseType: !31)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !63, file: !32, line: 455, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !30, line: 44, baseType: !31)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !63, file: !32, line: 456, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !30, line: 45, baseType: !31)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !63, file: !32, line: 457, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !30, line: 46, baseType: !31)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !63, file: !32, line: 458, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !30, line: 47, baseType: !31)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !63, file: !32, line: 459, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !30, line: 49, baseType: !31)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !63, file: !32, line: 460, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !30, line: 48, baseType: !31)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !63, file: !32, line: 461, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !30, line: 50, baseType: !31)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !63, file: !32, line: 462, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !30, line: 52, baseType: !31)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !63, file: !32, line: 463, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !30, line: 53, baseType: !31)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !63, file: !32, line: 464, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !30, line: 54, baseType: !31)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !63, file: !32, line: 469, baseType: !71, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !63, file: !32, line: 470, baseType: !71, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !63, file: !32, line: 471, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !32, line: 213, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !32, line: 213, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "hashed_msg", scope: !44, file: !25, line: 17, baseType: !82, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "policy_id", scope: !24, file: !25, line: 45, baseType: !53, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !24, file: !25, line: 46, baseType: !28, size: 64, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cert_req", scope: !24, file: !25, line: 47, baseType: !69, size: 32, align: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !24, file: !25, line: 48, baseType: !125, size: 64, align: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !50, line: 83, flags: DIFlagFwdDecl)
!127 = !DILocalVariable(name: "a", arg: 1, scope: !16, file: !17, line: 17, type: !21)
!128 = !DIExpression()
!129 = !DILocation(line: 17, column: 32, scope: !16)
!130 = !DILocalVariable(name: "version", arg: 2, scope: !16, file: !17, line: 17, type: !40)
!131 = !DILocation(line: 17, column: 40, scope: !16)
!132 = !DILocation(line: 19, column: 29, scope: !16)
!133 = !DILocation(line: 19, column: 32, scope: !16)
!134 = !DILocation(line: 19, column: 41, scope: !16)
!135 = !DILocation(line: 19, column: 12, scope: !16)
!136 = !DILocation(line: 19, column: 5, scope: !16)
!137 = distinct !DISubprogram(name: "TS_REQ_get_version", scope: !17, file: !17, line: 22, type: !138, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!138 = !DISubroutineType(types: !139)
!139 = !{!40, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!142 = !DILocalVariable(name: "a", arg: 1, scope: !137, file: !17, line: 22, type: !140)
!143 = !DILocation(line: 22, column: 39, scope: !137)
!144 = !DILocation(line: 24, column: 29, scope: !137)
!145 = !DILocation(line: 24, column: 32, scope: !137)
!146 = !DILocation(line: 24, column: 12, scope: !137)
!147 = !DILocation(line: 24, column: 5, scope: !137)
!148 = distinct !DISubprogram(name: "TS_REQ_set_msg_imprint", scope: !17, file: !17, line: 27, type: !149, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!149 = !DISubroutineType(types: !150)
!150 = !{!20, !21, !42}
!151 = !DILocalVariable(name: "a", arg: 1, scope: !148, file: !17, line: 27, type: !21)
!152 = !DILocation(line: 27, column: 36, scope: !148)
!153 = !DILocalVariable(name: "msg_imprint", arg: 2, scope: !148, file: !17, line: 27, type: !42)
!154 = !DILocation(line: 27, column: 55, scope: !148)
!155 = !DILocalVariable(name: "new_msg_imprint", scope: !148, file: !17, line: 29, type: !42)
!156 = !DILocation(line: 29, column: 21, scope: !148)
!157 = !DILocation(line: 31, column: 9, scope: !158)
!158 = distinct !DILexicalBlock(scope: !148, file: !17, line: 31, column: 9)
!159 = !DILocation(line: 31, column: 12, scope: !158)
!160 = !DILocation(line: 31, column: 27, scope: !158)
!161 = !DILocation(line: 31, column: 24, scope: !158)
!162 = !DILocation(line: 31, column: 9, scope: !148)
!163 = !DILocation(line: 32, column: 9, scope: !158)
!164 = !DILocation(line: 33, column: 42, scope: !148)
!165 = !DILocation(line: 33, column: 23, scope: !148)
!166 = !DILocation(line: 33, column: 21, scope: !148)
!167 = !DILocation(line: 34, column: 9, scope: !168)
!168 = distinct !DILexicalBlock(scope: !148, file: !17, line: 34, column: 9)
!169 = !DILocation(line: 34, column: 25, scope: !168)
!170 = !DILocation(line: 34, column: 9, scope: !148)
!171 = !DILocation(line: 35, column: 9, scope: !172)
!172 = distinct !DILexicalBlock(scope: !168, file: !17, line: 34, column: 33)
!173 = !DILocation(line: 36, column: 9, scope: !172)
!174 = !DILocation(line: 38, column: 25, scope: !148)
!175 = !DILocation(line: 38, column: 28, scope: !148)
!176 = !DILocation(line: 38, column: 5, scope: !148)
!177 = !DILocation(line: 39, column: 22, scope: !148)
!178 = !DILocation(line: 39, column: 5, scope: !148)
!179 = !DILocation(line: 39, column: 8, scope: !148)
!180 = !DILocation(line: 39, column: 20, scope: !148)
!181 = !DILocation(line: 40, column: 5, scope: !148)
!182 = !DILocation(line: 41, column: 1, scope: !148)
