; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ts--libcrypto-lib-ts_rsp_utils.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ts--libcrypto-lib-ts_rsp_utils.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TS_resp_st = type { %struct.TS_status_info_st*, %struct.pkcs7_st*, %struct.TS_tst_info_st* }
%struct.pkcs7_st = type { i8*, i64, i32, i32, %struct.asn1_object_st*, %union.anon }
%struct.asn1_object_st = type opaque
%union.anon = type { i8* }
%struct.TS_tst_info_st = type { %struct.asn1_string_st*, %struct.asn1_object_st*, %struct.TS_msg_imprint_st*, %struct.asn1_string_st*, %struct.asn1_string_st*, %struct.TS_accuracy_st*, i32, %struct.asn1_string_st*, %struct.GENERAL_NAME_st*, %struct.stack_st_X509_EXTENSION* }
%struct.TS_msg_imprint_st = type { %struct.X509_algor_st*, %struct.asn1_string_st* }
%struct.X509_algor_st = type { %struct.asn1_object_st*, %struct.asn1_type_st* }
%struct.asn1_type_st = type { i32, %union.anon.0 }
%union.anon.0 = type { i8* }
%struct.TS_accuracy_st = type { %struct.asn1_string_st*, %struct.asn1_string_st*, %struct.asn1_string_st* }
%struct.asn1_string_st = type { i32, i32, i8*, i64 }
%struct.GENERAL_NAME_st = type { i32, %union.anon.1 }
%union.anon.1 = type { i8* }
%struct.stack_st_X509_EXTENSION = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a/[inter]crypto--ts--libcrypto-lib-ts_rsp_utils.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!2 = !{}
!3 = !{!4, !5, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_STACK", file: !7, line: 17, baseType: !8)
!7 = !DIFile(filename: "include/openssl/stack.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !7, line: 17, flags: DIFlagFwdDecl)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPENSSL_sk_freefunc", file: !7, line: 20, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !4}
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!16 = distinct !DISubprogram(name: "TS_RESP_set_status_info", scope: !17, file: !17, line: 17, type: !18, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!17 = !DIFile(filename: "crypto/ts/ts_rsp_utils.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !21, !28}
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RESP", file: !23, line: 60, baseType: !24)
!23 = !DIFile(filename: "include/openssl/ts.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_resp_st", file: !25, line: 25, size: 192, align: 64, elements: !26)
!25 = !DIFile(filename: "crypto/ts/ts_lcl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!26 = !{!27, !52, !210}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "status_info", scope: !24, file: !25, line: 26, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_STATUS_INFO", file: !23, line: 58, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_status_info_st", file: !25, line: 95, size: 192, align: 64, elements: !31)
!31 = !{!32, !46, !49}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !30, file: !25, line: 96, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !35, line: 40, baseType: !36)
!35 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !37, line: 146, size: 192, align: 64, elements: !38)
!37 = !DIFile(filename: "include/openssl/asn1.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!38 = !{!39, !40, !41, !44}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !36, file: !37, line: 147, baseType: !20, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !37, line: 148, baseType: !20, size: 32, align: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !36, file: !37, line: 149, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !37, line: 155, baseType: !45, size: 64, align: 64, offset: 128)
!45 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !30, file: !25, line: 97, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_UTF8STRING", file: !37, line: 442, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "failure_info", scope: !30, file: !25, line: 98, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !35, line: 42, baseType: !36)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !24, file: !25, line: 27, baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7", file: !55, line: 144, baseType: !56)
!55 = !DIFile(filename: "include/openssl/pkcs7.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_st", file: !55, line: 109, size: 320, align: 64, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "asn1", scope: !56, file: !55, line: 114, baseType: !42, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !56, file: !55, line: 115, baseType: !45, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !56, file: !55, line: 119, baseType: !20, size: 32, align: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !56, file: !55, line: 120, baseType: !20, size: 32, align: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !56, file: !55, line: 121, baseType: !63, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !35, line: 60, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !35, line: 60, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !56, file: !55, line: 143, baseType: !67, size: 64, align: 64, offset: 256)
!67 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !56, file: !55, line: 127, size: 64, align: 64, elements: !68)
!68 = !{!69, !72, !75, !96, !181, !193, !202, !209}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !67, file: !55, line: 128, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !55, line: 130, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !35, line: 43, baseType: !36)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !67, file: !55, line: 132, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGNED", file: !55, line: 68, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signed_st", file: !55, line: 61, size: 384, align: 64, elements: !79)
!79 = !{!80, !81, !84, !88, !91, !94}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !78, file: !55, line: 62, baseType: !33, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !78, file: !55, line: 63, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !37, line: 119, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !78, file: !55, line: 64, baseType: !85, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !87, line: 99, flags: DIFlagFwdDecl)
!87 = !DIFile(filename: "include/openssl/x509.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!88 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !78, file: !55, line: 65, baseType: !89, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !87, line: 228, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !78, file: !55, line: 66, baseType: !92, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_SIGNER_INFO", file: !55, line: 49, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !78, file: !55, line: 67, baseType: !95, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "enveloped", scope: !67, file: !55, line: 134, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENVELOPE", file: !55, line: 85, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enveloped_st", file: !55, line: 81, size: 192, align: 64, elements: !100)
!100 = !{!101, !102, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !99, file: !55, line: 82, baseType: !33, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !99, file: !55, line: 83, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_PKCS7_RECIP_INFO", file: !55, line: 59, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !99, file: !55, line: 84, baseType: !106, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENC_CONTENT", file: !55, line: 79, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_enc_content_st", file: !55, line: 74, size: 256, align: 64, elements: !109)
!109 = !{!110, !111, !175, !176}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "content_type", scope: !108, file: !55, line: 75, baseType: !63, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !108, file: !55, line: 76, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !35, line: 125, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !87, line: 59, size: 128, align: 64, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !114, file: !87, line: 60, baseType: !63, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !114, file: !87, line: 61, baseType: !118, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !37, line: 473, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !37, line: 444, size: 128, align: 64, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !37, line: 445, baseType: !20, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !120, file: !37, line: 472, baseType: !124, size: 64, align: 64, offset: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !120, file: !37, line: 446, size: 64, align: 64, elements: !125)
!125 = !{!126, !127, !129, !132, !133, !134, !137, !138, !139, !142, !145, !148, !151, !154, !157, !160, !163, !166, !169, !170, !171}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !124, file: !37, line: 447, baseType: !70, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !124, file: !37, line: 448, baseType: !128, size: 32, align: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !35, line: 56, baseType: !20)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !124, file: !37, line: 449, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !35, line: 55, baseType: !36)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !124, file: !37, line: 450, baseType: !63, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !124, file: !37, line: 451, baseType: !33, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !124, file: !37, line: 452, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !35, line: 41, baseType: !36)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !124, file: !37, line: 453, baseType: !50, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !124, file: !37, line: 454, baseType: !73, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !124, file: !37, line: 455, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !35, line: 44, baseType: !36)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !124, file: !37, line: 456, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !35, line: 45, baseType: !36)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !124, file: !37, line: 457, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !35, line: 46, baseType: !36)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !124, file: !37, line: 458, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !35, line: 47, baseType: !36)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !124, file: !37, line: 459, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !35, line: 49, baseType: !36)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !124, file: !37, line: 460, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !35, line: 48, baseType: !36)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !124, file: !37, line: 461, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !35, line: 50, baseType: !36)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !124, file: !37, line: 462, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !35, line: 52, baseType: !36)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !124, file: !37, line: 463, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !35, line: 53, baseType: !36)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !124, file: !37, line: 464, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !35, line: 54, baseType: !36)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !124, file: !37, line: 469, baseType: !130, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !124, file: !37, line: 470, baseType: !130, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !124, file: !37, line: 471, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !37, line: 213, baseType: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !37, line: 213, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !108, file: !55, line: 77, baseType: !73, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !108, file: !55, line: 78, baseType: !177, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !35, line: 89, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !35, line: 89, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "signed_and_enveloped", scope: !67, file: !55, line: 136, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_SIGN_ENVELOPE", file: !55, line: 95, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_signedandenveloped_st", file: !55, line: 87, size: 448, align: 64, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191, !192}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !184, file: !55, line: 88, baseType: !33, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "md_algs", scope: !184, file: !55, line: 89, baseType: !82, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !184, file: !55, line: 90, baseType: !85, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !184, file: !55, line: 91, baseType: !89, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "signer_info", scope: !184, file: !55, line: 92, baseType: !92, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !184, file: !55, line: 93, baseType: !106, size: 64, align: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "recipientinfo", scope: !184, file: !55, line: 94, baseType: !103, size: 64, align: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !67, file: !55, line: 138, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_DIGEST", file: !55, line: 102, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_digest_st", file: !55, line: 97, size: 256, align: 64, elements: !197)
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !196, file: !55, line: 98, baseType: !33, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !196, file: !55, line: 99, baseType: !112, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !196, file: !55, line: 100, baseType: !95, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !196, file: !55, line: 101, baseType: !73, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "encrypted", scope: !67, file: !55, line: 140, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PKCS7_ENCRYPT", file: !55, line: 107, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkcs7_encrypted_st", file: !55, line: 104, size: 128, align: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !205, file: !55, line: 105, baseType: !33, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "enc_data", scope: !205, file: !55, line: 106, baseType: !106, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !67, file: !55, line: 142, baseType: !118, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tst_info", scope: !24, file: !25, line: 28, baseType: !211, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_TST_INFO", file: !23, line: 37, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_tst_info_st", file: !25, line: 82, size: 640, align: 64, elements: !214)
!214 = !{!215, !216, !217, !224, !225, !226, !234, !235, !236, !276}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !213, file: !25, line: 83, baseType: !33, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "policy_id", scope: !213, file: !25, line: 84, baseType: !63, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "msg_imprint", scope: !213, file: !25, line: 85, baseType: !218, size: 64, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_MSG_IMPRINT", file: !23, line: 34, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_msg_imprint_st", file: !25, line: 15, size: 128, align: 64, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "hash_algo", scope: !220, file: !25, line: 16, baseType: !112, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "hashed_msg", scope: !220, file: !25, line: 17, baseType: !73, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !213, file: !25, line: 86, baseType: !33, size: 64, align: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !213, file: !25, line: 87, baseType: !161, size: 64, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "accuracy", scope: !213, file: !25, line: 88, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_ACCURACY", file: !23, line: 36, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TS_accuracy_st", file: !25, line: 57, size: 192, align: 64, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !229, file: !25, line: 58, baseType: !33, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "millis", scope: !229, file: !25, line: 59, baseType: !33, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "micros", scope: !229, file: !25, line: 60, baseType: !33, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !213, file: !25, line: 89, baseType: !128, size: 32, align: 32, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !213, file: !25, line: 90, baseType: !33, size: 64, align: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tsa", scope: !213, file: !25, line: 91, baseType: !237, size: 64, align: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAME", file: !239, line: 153, baseType: !240)
!239 = !DIFile(filename: "include/openssl/x509v3.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[lib]libcrypto.a")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GENERAL_NAME_st", file: !239, line: 123, size: 128, align: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !239, line: 133, baseType: !20, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !240, file: !239, line: 152, baseType: !244, size: 64, align: 64, offset: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !240, file: !239, line: 134, size: 64, align: 64, elements: !245)
!245 = !{!246, !247, !254, !255, !256, !257, !261, !268, !269, !270, !271, !272, !273, !274, !275}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !244, file: !239, line: 135, baseType: !70, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "otherName", scope: !244, file: !239, line: 136, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "OTHERNAME", file: !239, line: 116, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otherName_st", file: !239, line: 113, size: 128, align: 64, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !250, file: !239, line: 114, baseType: !63, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !250, file: !239, line: 115, baseType: !118, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "rfc822Name", scope: !244, file: !239, line: 137, baseType: !146, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "dNSName", scope: !244, file: !239, line: 138, baseType: !146, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "x400Address", scope: !244, file: !239, line: 139, baseType: !118, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "directoryName", scope: !244, file: !239, line: 140, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !35, line: 129, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !35, line: 129, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ediPartyName", scope: !244, file: !239, line: 141, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDIPARTYNAME", file: !239, line: 121, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EDIPartyName_st", file: !239, line: 118, size: 128, align: 64, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nameAssigner", scope: !264, file: !239, line: 119, baseType: !130, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "partyName", scope: !264, file: !239, line: 120, baseType: !130, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "uniformResourceIdentifier", scope: !244, file: !239, line: 142, baseType: !146, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "iPAddress", scope: !244, file: !239, line: 143, baseType: !73, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "registeredID", scope: !244, file: !239, line: 144, baseType: !63, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !244, file: !239, line: 146, baseType: !73, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "dirn", scope: !244, file: !239, line: 147, baseType: !258, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ia5", scope: !244, file: !239, line: 148, baseType: !146, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !244, file: !239, line: 150, baseType: !63, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !244, file: !239, line: 151, baseType: !118, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !213, file: !25, line: 92, baseType: !277, size: 64, align: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !87, line: 83, flags: DIFlagFwdDecl)
!279 = !DILocalVariable(name: "a", arg: 1, scope: !16, file: !17, line: 17, type: !21)
!280 = !DIExpression()
!281 = !DILocation(line: 17, column: 38, scope: !16)
!282 = !DILocalVariable(name: "status_info", arg: 2, scope: !16, file: !17, line: 17, type: !28)
!283 = !DILocation(line: 17, column: 57, scope: !16)
!284 = !DILocalVariable(name: "new_status_info", scope: !16, file: !17, line: 19, type: !28)
!285 = !DILocation(line: 19, column: 21, scope: !16)
!286 = !DILocation(line: 21, column: 9, scope: !287)
!287 = distinct !DILexicalBlock(scope: !16, file: !17, line: 21, column: 9)
!288 = !DILocation(line: 21, column: 12, scope: !287)
!289 = !DILocation(line: 21, column: 27, scope: !287)
!290 = !DILocation(line: 21, column: 24, scope: !287)
!291 = !DILocation(line: 21, column: 9, scope: !16)
!292 = !DILocation(line: 22, column: 9, scope: !287)
!293 = !DILocation(line: 23, column: 42, scope: !16)
!294 = !DILocation(line: 23, column: 23, scope: !16)
!295 = !DILocation(line: 23, column: 21, scope: !16)
!296 = !DILocation(line: 24, column: 9, scope: !297)
!297 = distinct !DILexicalBlock(scope: !16, file: !17, line: 24, column: 9)
!298 = !DILocation(line: 24, column: 25, scope: !297)
!299 = !DILocation(line: 24, column: 9, scope: !16)
!300 = !DILocation(line: 25, column: 9, scope: !301)
!301 = distinct !DILexicalBlock(scope: !297, file: !17, line: 24, column: 33)
!302 = !DILocation(line: 26, column: 9, scope: !301)
!303 = !DILocation(line: 28, column: 25, scope: !16)
!304 = !DILocation(line: 28, column: 28, scope: !16)
!305 = !DILocation(line: 28, column: 5, scope: !16)
!306 = !DILocation(line: 29, column: 22, scope: !16)
!307 = !DILocation(line: 29, column: 5, scope: !16)
!308 = !DILocation(line: 29, column: 8, scope: !16)
!309 = !DILocation(line: 29, column: 20, scope: !16)
!310 = !DILocation(line: 31, column: 5, scope: !16)
!311 = !DILocation(line: 32, column: 1, scope: !16)
!312 = distinct !DISubprogram(name: "TS_RESP_get_status_info", scope: !17, file: !17, line: 34, type: !313, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!313 = !DISubroutineType(types: !314)
!314 = !{!28, !21}
!315 = !DILocalVariable(name: "a", arg: 1, scope: !312, file: !17, line: 34, type: !21)
!316 = !DILocation(line: 34, column: 50, scope: !312)
!317 = !DILocation(line: 36, column: 12, scope: !312)
!318 = !DILocation(line: 36, column: 15, scope: !312)
!319 = !DILocation(line: 36, column: 5, scope: !312)
!320 = distinct !DISubprogram(name: "TS_RESP_set_tst_info", scope: !17, file: !17, line: 40, type: !321, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !21, !53, !211}
!323 = !DILocalVariable(name: "a", arg: 1, scope: !320, file: !17, line: 40, type: !21)
!324 = !DILocation(line: 40, column: 36, scope: !320)
!325 = !DILocalVariable(name: "p7", arg: 2, scope: !320, file: !17, line: 40, type: !53)
!326 = !DILocation(line: 40, column: 46, scope: !320)
!327 = !DILocalVariable(name: "tst_info", arg: 3, scope: !320, file: !17, line: 40, type: !211)
!328 = !DILocation(line: 40, column: 63, scope: !320)
!329 = !DILocation(line: 42, column: 16, scope: !320)
!330 = !DILocation(line: 42, column: 19, scope: !320)
!331 = !DILocation(line: 42, column: 5, scope: !320)
!332 = !DILocation(line: 43, column: 16, scope: !320)
!333 = !DILocation(line: 43, column: 5, scope: !320)
!334 = !DILocation(line: 43, column: 8, scope: !320)
!335 = !DILocation(line: 43, column: 14, scope: !320)
!336 = !DILocation(line: 44, column: 22, scope: !320)
