; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--wpackettest/[inter]test--wpackettest-bin-wpackettest.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--wpackettest/[inter]test--wpackettest-bin-wpackettest.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.buf_mem_st = type { i64, i8*, i64, i64 }
%struct.wpacket_st = type { %struct.buf_mem_st*, i8*, i64, i64, i64, %struct.wpacket_sub* }
%struct.wpacket_sub = type { %struct.wpacket_sub*, i64, i64, i64, i32 }

@.str = private unnamed_addr constant [19 x i8] c"test/wpackettest.c\00", align 1
@.str.1 = private unnamed_addr constant [20 x i8] c"buf = BUF_MEM_new()\00", align 1
@buf = internal global %struct.buf_mem_st* null, align 8
@.str.2 = private unnamed_addr constant [18 x i8] c"test_WPACKET_init\00", align 1
@.str.3 = private unnamed_addr constant [26 x i8] c"test_WPACKET_set_max_size\00", align 1
@.str.4 = private unnamed_addr constant [30 x i8] c"test_WPACKET_start_sub_packet\00", align 1
@.str.5 = private unnamed_addr constant [23 x i8] c"test_WPACKET_set_flags\00", align 1
@.str.6 = private unnamed_addr constant [28 x i8] c"test_WPACKET_allocate_bytes\00", align 1
@.str.7 = private unnamed_addr constant [20 x i8] c"test_WPACKET_memcpy\00", align 1
@.str.8 = private unnamed_addr constant [24 x i8] c"WPACKET_init(&pkt, buf)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--wpackettest/[inter]test--wpackettest-bin-wpackettest.o.i", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--wpackettest")
!2 = !{}
!3 = !{!4, !21, !27, !31, !35, !39, !40, !44, !45, !46, !47}
!4 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !5, line: 25, type: !6, isLocal: true, isDefinition: true, variable: %struct.buf_mem_st** @buf)
!5 = !DIFile(filename: "test/wpackettest.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--wpackettest")
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !8, line: 87, baseType: !9)
!8 = !DIFile(filename: "include/openssl/ossl_typ.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--wpackettest")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !10, line: 38, size: 256, align: 64, elements: !11)
!10 = !DIFile(filename: "include/openssl/buffer.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--wpackettest")
!11 = !{!12, !16, !19, !20}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !9, file: !10, line: 39, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 216, baseType: !15)
!14 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--wpackettest")
!15 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !9, file: !10, line: 40, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !9, file: !10, line: 41, baseType: !13, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !9, file: !10, line: 42, baseType: !15, size: 64, align: 64, offset: 192)
!21 = distinct !DIGlobalVariable(name: "simple1", scope: !0, file: !5, line: 15, type: !22, isLocal: true, isDefinition: true, variable: [1 x i8]* @simple1)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, align: 8, elements: !25)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!25 = !{!26}
!26 = !DISubrange(count: 1)
!27 = distinct !DIGlobalVariable(name: "simple2", scope: !0, file: !5, line: 16, type: !28, isLocal: true, isDefinition: true, variable: [2 x i8]* @simple2)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16, align: 8, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 2)
!31 = distinct !DIGlobalVariable(name: "simple3", scope: !0, file: !5, line: 17, type: !32, isLocal: true, isDefinition: true, variable: [5 x i8]* @simple3)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 40, align: 8, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 5)
!35 = distinct !DIGlobalVariable(name: "fixed", scope: !0, file: !5, line: 23, type: !36, isLocal: true, isDefinition: true, variable: [3 x i8]* @fixed)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 24, align: 8, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 3)
!39 = distinct !DIGlobalVariable(name: "alloc", scope: !0, file: !5, line: 21, type: !36, isLocal: true, isDefinition: true, variable: [3 x i8]* @alloc)
!40 = distinct !DIGlobalVariable(name: "nestedsub", scope: !0, file: !5, line: 18, type: !41, isLocal: true, isDefinition: true, variable: [4 x i8]* @nestedsub)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, align: 8, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 4)
!44 = distinct !DIGlobalVariable(name: "seqsub", scope: !0, file: !5, line: 19, type: !41, isLocal: true, isDefinition: true, variable: [4 x i8]* @seqsub)
!45 = distinct !DIGlobalVariable(name: "empty", scope: !0, file: !5, line: 20, type: !22, isLocal: true, isDefinition: true, variable: [1 x i8]* @empty)
!46 = distinct !DIGlobalVariable(name: "submem", scope: !0, file: !5, line: 22, type: !41, isLocal: true, isDefinition: true, variable: [4 x i8]* @submem)
!47 = distinct !DIGlobalVariable(name: "bytes", scope: !48, file: !5, line: 332, type: !28, isLocal: true, isDefinition: true, variable: [2 x i8]* @test_WPACKET_memcpy.bytes)
!48 = distinct !DISubprogram(name: "test_WPACKET_memcpy", scope: !5, file: !5, line: 328, type: !49, isLocal: true, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!49 = !DISubroutineType(types: !50)
!50 = !{!51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!55 = distinct !DISubprogram(name: "setup_tests", scope: !5, file: !5, line: 352, type: !49, isLocal: false, isDefinition: true, scopeLine: 353, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!56 = !DILocation(line: 354, column: 75, scope: !57)
!57 = distinct !DILexicalBlock(scope: !55, file: !5, line: 354, column: 9)
!58 = !DILocation(line: 354, column: 73, scope: !57)
!59 = !DILocation(line: 354, column: 69, scope: !57)
!60 = !DILocation(line: 354, column: 10, scope: !61)
!61 = !DILexicalBlockFile(scope: !57, file: !5, discriminator: 1)
!62 = !DILocation(line: 354, column: 10, scope: !57)
!63 = !DILocation(line: 354, column: 9, scope: !55)
!64 = !DILocation(line: 355, column: 13, scope: !57)
!65 = !DILocation(line: 357, column: 5, scope: !55)
!66 = !DILocation(line: 358, column: 5, scope: !55)
!67 = !DILocation(line: 359, column: 5, scope: !55)
!68 = !DILocation(line: 360, column: 5, scope: !55)
!69 = !DILocation(line: 361, column: 5, scope: !55)
!70 = !DILocation(line: 362, column: 5, scope: !55)
!71 = !DILocation(line: 363, column: 5, scope: !55)
!72 = !DILocation(line: 364, column: 1, scope: !55)
!73 = distinct !DISubprogram(name: "test_WPACKET_init", scope: !5, file: !5, line: 33, type: !49, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!74 = !DILocalVariable(name: "pkt", scope: !73, file: !5, line: 35, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "WPACKET", file: !76, line: 619, baseType: !77)
!76 = !DIFile(filename: "test/../ssl/packet_locl.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--wpackettest")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wpacket_st", file: !76, line: 620, size: 384, align: 64, elements: !78)
!78 = !{!79, !80, !82, !83, !84, !85}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !77, file: !76, line: 622, baseType: !6, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "staticbuf", scope: !77, file: !76, line: 625, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !77, file: !76, line: 631, baseType: !13, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !77, file: !76, line: 634, baseType: !13, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !77, file: !76, line: 637, baseType: !13, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !77, file: !76, line: 640, baseType: !86, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "WPACKET_SUB", file: !76, line: 598, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wpacket_sub", file: !76, line: 599, size: 320, align: 64, elements: !89)
!89 = !{!90, !91, !92, !93, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !88, file: !76, line: 601, baseType: !86, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len", scope: !88, file: !76, line: 607, baseType: !13, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "lenbytes", scope: !88, file: !76, line: 610, baseType: !13, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pwritten", scope: !88, file: !76, line: 613, baseType: !13, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !88, file: !76, line: 616, baseType: !95, size: 32, align: 32, offset: 256)
!95 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!96 = !DIExpression()
!97 = !DILocation(line: 35, column: 13, scope: !73)
!98 = !DILocalVariable(name: "i", scope: !73, file: !5, line: 36, type: !51)
!99 = !DILocation(line: 36, column: 9, scope: !73)
!100 = !DILocalVariable(name: "written", scope: !73, file: !5, line: 37, type: !13)
!101 = !DILocation(line: 37, column: 12, scope: !73)
!102 = !DILocalVariable(name: "sbuf", scope: !73, file: !5, line: 38, type: !103)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, align: 8, elements: !37)
!104 = !DILocation(line: 38, column: 19, scope: !73)
!105 = !DILocation(line: 40, column: 93, scope: !106)
!106 = distinct !DILexicalBlock(scope: !73, file: !5, line: 40, column: 9)
!107 = !DILocation(line: 40, column: 74, scope: !106)
!108 = !DILocation(line: 40, column: 99, scope: !106)
!109 = !DILocation(line: 40, column: 10, scope: !110)
!110 = !DILexicalBlockFile(scope: !106, file: !5, discriminator: 2)
!111 = !DILocation(line: 40, column: 10, scope: !106)
!112 = !DILocation(line: 41, column: 13, scope: !106)
!113 = !DILocation(line: 41, column: 90, scope: !114)
!114 = !DILexicalBlockFile(scope: !106, file: !5, discriminator: 1)
!115 = !DILocation(line: 41, column: 130, scope: !114)
!116 = !DILocation(line: 41, column: 17, scope: !117)
!117 = !DILexicalBlockFile(scope: !114, file: !5, discriminator: 2)
!118 = !DILocation(line: 41, column: 17, scope: !114)
!119 = !DILocation(line: 43, column: 13, scope: !106)
!120 = !DILocation(line: 43, column: 78, scope: !114)
!121 = !DILocation(line: 43, column: 99, scope: !114)
!122 = !DILocation(line: 43, column: 17, scope: !117)
!123 = !DILocation(line: 43, column: 17, scope: !114)
!124 = !DILocation(line: 45, column: 13, scope: !106)
!125 = !DILocation(line: 45, column: 78, scope: !114)
!126 = !DILocation(line: 45, column: 100, scope: !114)
!127 = !DILocation(line: 45, column: 17, scope: !117)
!128 = !DILocation(line: 45, column: 17, scope: !114)
!129 = !DILocation(line: 50, column: 13, scope: !106)
!130 = !DILocation(line: 50, column: 78, scope: !114)
!131 = !DILocation(line: 50, column: 99, scope: !114)
!132 = !DILocation(line: 50, column: 17, scope: !117)
!133 = !DILocation(line: 50, column: 17, scope: !114)
!134 = !DILocation(line: 51, column: 13, scope: !106)
!135 = !DILocation(line: 51, column: 79, scope: !114)
!136 = !DILocation(line: 51, column: 101, scope: !114)
!137 = !DILocation(line: 51, column: 17, scope: !117)
!138 = !DILocation(line: 51, column: 17, scope: !114)
!139 = !DILocation(line: 52, column: 13, scope: !106)
!140 = !DILocation(line: 52, column: 99, scope: !114)
!141 = !DILocation(line: 52, column: 142, scope: !114)
!142 = !DILocation(line: 52, column: 17, scope: !117)
!143 = !DILocation(line: 52, column: 17, scope: !114)
!144 = !DILocation(line: 53, column: 13, scope: !106)
!145 = !DILocation(line: 53, column: 79, scope: !114)
!146 = !DILocation(line: 53, column: 84, scope: !114)
!147 = !DILocation(line: 53, column: 90, scope: !114)
!148 = !DILocation(line: 53, column: 17, scope: !114)
!149 = !DILocation(line: 40, column: 9, scope: !150)
!150 = !DILexicalBlockFile(scope: !73, file: !5, discriminator: 1)
!151 = !DILocation(line: 54, column: 16, scope: !106)
!152 = !DILocation(line: 54, column: 9, scope: !106)
!153 = !DILocation(line: 57, column: 104, scope: !154)
!154 = distinct !DILexicalBlock(scope: !73, file: !5, line: 57, column: 9)
!155 = !DILocation(line: 57, column: 81, scope: !154)
!156 = !DILocation(line: 57, column: 113, scope: !154)
!157 = !DILocation(line: 57, column: 10, scope: !158)
!158 = !DILexicalBlockFile(scope: !154, file: !5, discriminator: 2)
!159 = !DILocation(line: 57, column: 10, scope: !154)
!160 = !DILocation(line: 58, column: 13, scope: !154)
!161 = !DILocation(line: 58, column: 90, scope: !162)
