; ModuleID = '/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ct_test/[inter]test--ct_test-bin-ct_test.o.i'
source_filename = "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ct_test/[inter]test--ct_test-bin-ct_test.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ct_test_fixture = type { i8*, i64, %struct.ctlog_store_st*, i8*, i8*, i8*, i32, i32, i8*, i64, %struct.stack_st_SCT*, i8*, i8*, i32 }
%struct.ctlog_store_st = type opaque
%struct.stack_st_SCT = type opaque
%struct.sct_st = type opaque
%struct.ct_policy_eval_ctx_st = type opaque
%struct.ctlog_st = type opaque
%struct.x509_st = type opaque
%struct.X509_extension_st = type opaque
%struct.bio_st = type opaque
%struct.bio_method_st = type opaque
%struct.stack_st = type opaque

@.str = private unnamed_addr constant [7 x i8] c"CT_DIR\00", align 1
@ct_dir = internal global i8* null, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"ct\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"CERTS_DIR\00", align 1
@certs_dir = internal global i8* null, align 8
@.str.3 = private unnamed_addr constant [6 x i8] c"certs\00", align 1
@.str.4 = private unnamed_addr constant [28 x i8] c"test_no_scts_in_certificate\00", align 1
@.str.5 = private unnamed_addr constant [28 x i8] c"test_one_sct_in_certificate\00", align 1
@.str.6 = private unnamed_addr constant [34 x i8] c"test_multiple_scts_in_certificate\00", align 1

!44 = distinct !DIGlobalVariable(name: "ct_dir", scope: !0, file: !45, line: 28, type: !21, isLocal: true, isDefinition: true, variable: i8** @ct_dir)
!45 = !DIFile(filename: "test/ct_test.c", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ct_test")
!46 = distinct !DIGlobalVariable(name: "certs_dir", scope: !0, file: !45, line: 27, type: !21, isLocal: true, isDefinition: true, variable: i8** @certs_dir)
!47 = distinct !DIGlobalVariable(name: "tls_sct_list", scope: !48, file: !45, line: 439, type: !52, isLocal: true, isDefinition: true, variable: [123 x i8]* @test_decode_tls_sct.tls_sct_list)
!48 = distinct !DISubprogram(name: "test_decode_tls_sct", scope: !45, file: !45, line: 437, type: !49, isLocal: true, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!49 = !DISubroutineType(types: !50)
!50 = !{!42}
!51 = !{}
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 984, align: 8, elements: !55)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!55 = !{!56}
!56 = !DISubrange(count: 123)
!57 = distinct !DIGlobalVariable(name: "log_id", scope: !58, file: !45, line: 470, type: !59, isLocal: true, isDefinition: true, variable: [45 x i8]* @test_encode_tls_sct.log_id)
!58 = distinct !DISubprogram(name: "test_encode_tls_sct", scope: !45, file: !45, line: 468, type: !49, isLocal: true, isDefinition: true, scopeLine: 469, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 360, align: 8, elements: !61)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!61 = !{!62}
!62 = !DISubrange(count: 45)
!63 = distinct !DIGlobalVariable(name: "extensions", scope: !58, file: !45, line: 472, type: !64, isLocal: true, isDefinition: true, variable: [1 x i8]* @test_encode_tls_sct.extensions)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8, align: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 1)
!67 = distinct !DIGlobalVariable(name: "signature", scope: !58, file: !45, line: 473, type: !68, isLocal: true, isDefinition: true, variable: [101 x i8]* @test_encode_tls_sct.signature)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 808, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 101)
!71 = distinct !DIGlobalVariable(name: "notb64", scope: !72, file: !45, line: 520, type: !73, isLocal: true, isDefinition: true, variable: [5 x i8]* @test_ctlog_from_base64.notb64)
!72 = distinct !DISubprogram(name: "test_ctlog_from_base64", scope: !45, file: !45, line: 517, type: !49, isLocal: true, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 40, align: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 5)
!76 = distinct !DIGlobalVariable(name: "pad", scope: !72, file: !45, line: 521, type: !73, isLocal: true, isDefinition: true, variable: [5 x i8]* @test_ctlog_from_base64.pad)
!77 = distinct !DIGlobalVariable(name: "name", scope: !72, file: !45, line: 522, type: !73, isLocal: true, isDefinition: true, variable: [5 x i8]* @test_ctlog_from_base64.name)
!78 = !{i32 2, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!81 = distinct !DISubprogram(name: "setup_tests", scope: !45, file: !45, line: 532, type: !49, isLocal: false, isDefinition: true, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!82 = !DILocation(line: 535, column: 19, scope: !83)
!83 = distinct !DILexicalBlock(scope: !81, file: !45, line: 535, column: 9)
!84 = !DILocation(line: 535, column: 17, scope: !83)
!85 = !DILocation(line: 535, column: 37, scope: !83)
!86 = !DILocation(line: 535, column: 9, scope: !81)
!87 = !DILocation(line: 536, column: 16, scope: !83)
!88 = !DILocation(line: 536, column: 9, scope: !83)
!89 = !DILocation(line: 537, column: 22, scope: !90)
!90 = distinct !DILexicalBlock(scope: !81, file: !45, line: 537, column: 9)
!91 = !DILocation(line: 537, column: 20, scope: !90)
!92 = !DILocation(line: 537, column: 43, scope: !90)
!93 = !DILocation(line: 537, column: 9, scope: !81)
!94 = !DILocation(line: 538, column: 19, scope: !90)
!95 = !DILocation(line: 538, column: 9, scope: !90)
!96 = !DILocation(line: 540, column: 5, scope: !81)
!97 = !DILocation(line: 541, column: 5, scope: !81)
!98 = !DILocation(line: 542, column: 5, scope: !81)
!99 = !DILocation(line: 543, column: 5, scope: !81)
!100 = !DILocation(line: 544, column: 5, scope: !81)
!101 = !DILocation(line: 545, column: 5, scope: !81)
!102 = !DILocation(line: 546, column: 5, scope: !81)
!103 = !DILocation(line: 547, column: 5, scope: !81)
!104 = !DILocation(line: 548, column: 5, scope: !81)
!105 = !DILocation(line: 549, column: 5, scope: !81)
!106 = !DILocation(line: 553, column: 5, scope: !81)
!107 = distinct !DISubprogram(name: "test_no_scts_in_certificate", scope: !45, file: !45, line: 350, type: !49, isLocal: true, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!108 = !DILocalVariable(name: "fixture", scope: !107, file: !45, line: 352, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "CT_TEST_FIXTURE", file: !45, line: 57, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ct_test_fixture", file: !45, line: 30, size: 832, align: 64, elements: !112)
!112 = !{!113, !115, !119, !123, !124, !125, !126, !127, !128, !130, !133, !134, !135, !136}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "test_case_name", scope: !111, file: !45, line: 31, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "epoch_time_in_ms", scope: !111, file: !45, line: 33, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !117, line: 55, baseType: !118)
!117 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ct_test")
!118 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ctlog_store", scope: !111, file: !45, line: 35, baseType: !120, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTLOG_STORE", file: !30, line: 176, baseType: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctlog_store_st", file: !30, line: 176, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "certs_dir", scope: !111, file: !45, line: 37, baseType: !114, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "certificate_file", scope: !111, file: !45, line: 38, baseType: !21, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "issuer_file", scope: !111, file: !45, line: 39, baseType: !21, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "expected_sct_count", scope: !111, file: !45, line: 41, baseType: !42, size: 32, align: 32, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "expected_valid_sct_count", scope: !111, file: !45, line: 43, baseType: !42, size: 32, align: 32, offset: 416)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tls_sct_list", scope: !111, file: !45, line: 45, baseType: !129, size: 64, align: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tls_sct_list_len", scope: !111, file: !45, line: 46, baseType: !131, size: 64, align: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !132, line: 216, baseType: !118)
!132 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/openssl_bcmake_outputs/[task]test--ct_test")
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sct_list", scope: !111, file: !45, line: 47, baseType: !32, size: 64, align: 64, offset: 576)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sct_dir", scope: !111, file: !45, line: 53, baseType: !114, size: 64, align: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "sct_text_file", scope: !111, file: !45, line: 54, baseType: !114, size: 64, align: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "test_validity", scope: !111, file: !45, line: 56, baseType: !42, size: 32, align: 32, offset: 768)
!137 = !DIExpression()
!138 = !DILocation(line: 352, column: 22, scope: !107)
!139 = !DILocation(line: 352, column: 32, scope: !107)
!140 = !DILocalVariable(name: "result", scope: !107, file: !45, line: 352, type: !42)
!141 = !DILocation(line: 352, column: 54, scope: !107)
!142 = !DILocation(line: 353, column: 9, scope: !143)
!143 = distinct !DILexicalBlock(scope: !107, file: !45, line: 353, column: 9)
!144 = !DILocation(line: 353, column: 17, scope: !143)
!145 = !DILocation(line: 353, column: 9, scope: !107)
!146 = !DILocation(line: 354, column: 9, scope: !143)
!147 = !DILocation(line: 355, column: 26, scope: !107)
!148 = !DILocation(line: 355, column: 5, scope: !107)
!149 = !DILocation(line: 355, column: 14, scope: !107)
!150 = !DILocation(line: 355, column: 24, scope: !107)
!151 = !DILocation(line: 356, column: 5, scope: !107)
!152 = !DILocation(line: 356, column: 14, scope: !107)
!153 = !DILocation(line: 356, column: 31, scope: !107)
!154 = !DILocation(line: 357, column: 5, scope: !107)
!155 = !DILocation(line: 357, column: 14, scope: !107)
!156 = !DILocation(line: 357, column: 26, scope: !107)
!157 = !DILocation(line: 358, column: 5, scope: !107)
!158 = !DILocation(line: 358, column: 14, scope: !107)
!159 = !DILocation(line: 358, column: 33, scope: !107)
!160 = !DILocation(line: 359, column: 9, scope: !161)
!161 = distinct !DILexicalBlock(scope: !107, file: !45, line: 359, column: 9)
!162 = !DILocation(line: 359, column: 17, scope: !161)
!163 = !DILocation(line: 359, column: 9, scope: !107)
!164 = !DILocation(line: 359, column: 35, scope: !165)
!165 = !DILexicalBlockFile(scope: !166, file: !45, discriminator: 1)
!166 = distinct !DILexicalBlock(scope: !161, file: !45, line: 359, column: 6)
!167 = !DILocation(line: 359, column: 17, scope: !165)
!168 = !DILocation(line: 359, column: 15, scope: !165)
!169 = !DILocation(line: 359, column: 55, scope: !165)
!170 = !DILocation(line: 359, column: 45, scope: !171)
!171 = !DILexicalBlockFile(scope: !165, file: !45, discriminator: 2)
!172 = !DILocation(line: 359, column: 65, scope: !165)
!173 = !DILocation(line: 360, column: 12, scope: !107)
!174 = !DILocation(line: 360, column: 5, scope: !107)
!175 = !DILocation(line: 361, column: 1, scope: !107)
!176 = distinct !DISubprogram(name: "test_one_sct_in_certificate", scope: !45, file: !45, line: 363, type: !49, isLocal: true, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!177 = !DILocalVariable(name: "fixture", scope: !176, file: !45, line: 365, type: !109)
!178 = !DILocation(line: 365, column: 22, scope: !176)
!179 = !DILocation(line: 365, column: 32, scope: !176)
!180 = !DILocalVariable(name: "result", scope: !176, file: !45, line: 365, type: !42)
!181 = !DILocation(line: 365, column: 54, scope: !176)
!182 = !DILocation(line: 366, column: 9, scope: !183)
!183 = distinct !DILexicalBlock(scope: !176, file: !45, line: 366, column: 9)
!184 = !DILocation(line: 366, column: 17, scope: !183)
!185 = !DILocation(line: 366, column: 9, scope: !176)
!186 = !DILocation(line: 367, column: 9, scope: !183)
!187 = !DILocation(line: 368, column: 26, scope: !176)
!188 = !DILocation(line: 368, column: 5, scope: !176)
!189 = !DILocation(line: 368, column: 14, scope: !176)
!190 = !DILocation(line: 368, column: 24, scope: !176)
!191 = !DILocation(line: 369, column: 5, scope: !176)
!192 = !DILocation(line: 369, column: 14, scope: !176)
!193 = !DILocation(line: 369, column: 31, scope: !176)
!194 = !DILocation(line: 370, column: 5, scope: !176)
!195 = !DILocation(line: 370, column: 14, scope: !176)
!196 = !DILocation(line: 370, column: 26, scope: !176)
!197 = !DILocation(line: 371, column: 5, scope: !176)
!198 = !DILocation(line: 371, column: 14, scope: !176)
!199 = !DILocation(line: 371, column: 33, scope: !176)
!200 = !DILocation(line: 372, column: 24, scope: !176)
